[
    "MAN there's no single person supporting him in the comments and this is his official account",
    "Thank you for proving me correct. I told family that you'd be the worst president and now they agree.",
    "\"When I met Zelensky I didn't feel alone\". That's ... yeah, that's how that works.",
    "Mf has the best editors for making his words sound coherent",
    "Dude straight up thinks he's running for president of Ukraine at this point.",
    "theres no way he had the cognitive ability to write that speech himself",
    "How did this guy get 81 million votes, yet gets smashed up in every comment section that hosts any of his videos?!",
    "The country, the world is falling apart because of this guy. And these  types of people.",
    "The White House has become the most expensive nursing home.",
    "\"I took a plane to Hawaii, got a snow cone, and flew home\"",
    "-Joe Biden 2024",
    "The first thing I noticed was Poland and Ukraine, so uh, what about America?",
    "You can literally see he's reading a script and how he's looking. He isn't looking directly at the camera",
    "In this video He is actually telling Americans to vote for him so he can help other countries",
    "Big ups to Sleepy Joe's staff for the killer edit. This almost seemed coherent for a few seconds.",
    "Put me in the white house by now. not a guy that cant even remember that he is the president.",
    "My neighbor used to brag about Joe Biden now I ask him and he said he didn‚Äôt vote for him I was like yeah, right.",
    "‚ÄúThe idea of America‚Äù and he talks about Ukraine.",
    "The comments section wont let biden slide",
    "\"A Billion Three Hundred Million Trillion Three Hundred Million Dollars\". LET\"S GO BRANDON.",
    "\"I was told\" meaning he didn't know what he was doing",
    "I'll bet anyone that this one minute speech took at least an entire day to record.",
    "Every key aspect of American life is worse now than it was in 2020.",
    "I have a new slogan for him. *JOE MUST GO*.",
    "The whole world is laughing at Joe Biden",
    "Wants mad props for visiting other countries borders  YET avoids the U.S. border like the plague",
    "We also don‚Äôt need Kamala, take her with you on your way out please!",
    "must have taken hours/days to get this edited to sound coherent",
    "I caught a tram and went shopping came back and had my dinner . Profound man!",
    "I have no respect for Biden",
    "Tell me about the 10 percent you got from  the Ukrainian company.",
    "Ain‚Äôt no way he has an official channel",
    "this county is JACKED UP",
    "Came here for the comments, they didn't let me down",
    "‚ÄúLet‚Äôs go Brandon I agree‚Äù Joe budden",
    "The Dumpster Fire Presidency.  I bailed on your party because of you, Joe.",
    "The way he writes his speeches it sounds like he's in elementary school.",
    "If these sinister individuals aren't driven from office, and soon, we will be in very deep trouble.",
    "Name ONE THING they have done to make this nation safer, more secure, more prosperous, less wasteful, or stronger then when they got here.    ONE THING.",
    "People said they would leave America if Trump was elected, I'm not sur eif they did so I can't confirm if that happened. If Joe Biden was re-elected I couldn't leave if I wanted to cause I have no money(even if I did I still wouldn't because I still want to help my country). I am now 18, I am allowed to vote. Trump 2024, lets Make America Great Again",
    "Interesting quote from last month's Business Insider magazine: 'The three largest employers in Russia are the oil and gas industry, the Shipbuilding industry and the Nuclear Power industry.  The three largest employers in the United States are Walmart, McDonalds and Home Depot.'",
    "Trump '24!!!",
    "Merry Christmas everyone!!!",
    "You might think that elder people get wiser with the years, untill you see this guy.",
    "I‚Äôll give u 5 reasons not to vote for Joe",
    "1. ‚ÄúYou know the thing‚Äù - Joe Biden",
    "2. ‚ÄúThere‚Äôs no there there‚Äù - Joe Biden",
    "3. ‚ÄúShe was 12 I was 30‚Äù - Joe Biden",
    "4. ‚Äúif u don‚Äôt vote for me you aint black‚Äù - Joe Biden",
    "5. ‚ÄúI don‚Äôt want my kids growing up in a racial jungle‚Äù - Joe Biden 1970s speech",
    "We all will pray for you for your retirement 2024.",
    "i am voting for joe biden and kameltoe harris 2024",
    "He thinks he‚Äôs a leader.",
    "He was picking up his check.",
    "Technically we are still at war with North Korea (only a cease fire, no peace treaty), so Trump is the first president to enter a war zone, and he WALKED IN ALONE.",
    "Can you summarize America in one word Mr. President?",
    "Man AI is getting advanced, it made sleepy Joe sound coherent.",
    "I don‚Äôt think you‚Äôll be running again pal",
    "Put biden in comic books,not our history books.  thank You!!!!",
    "His staff doesn‚Äôt even scrub the negative comments off of these videos lol",
    "Why in America‚Äôs eyes Israel is always right and can‚Äôt be possible doing anything wrong?  Is it because large sums of money is required to campaign to get elected?  I hear that from people quite often they say this is how America is paying back. By passing. Or making the laws that would serve to big pharmaceutical companies, agriculture companies etc. and I  guess everyone know who those companies. So are we really voting for the candidates of our own choice? Or are we required to vote for one from the already picked and made available to public candidates?  Is that how democracy works?",
    "I‚Äôm so thankful that we have a President that projects power, our enemies fear us and our friends respect us‚Ä¶‚Ä¶‚Ä¶.said no one ever.",
    "Dislike bar looks like a lightsaber. \"81 million 'votes.' \"",
    "How are you guys not playing the ‚ÄúSmelly Cat‚Äù song from Friends? Both Trump and Biden are old so the term ‚ÄúCat‚Äù also means man. Smelly Man! How am I not seeing this everywhere? Give HIM a nickname for once. For all of us",
    "üá∫üá∏Let‚Äôs Go Brandonüá∫üá∏",
    "I‚Äôm so happy that the ppl of Ukraine are doing so well with our tax money while we in America are fighting to stay alive! Europes problem not ours.",
    "Woke up, brainwashed everyone, got ice cream, went to sleep",
    "- joe Biden",
    "Nobody talks about the boy who pushed the dog in the lake anymore  Sleepy Joe is the only one to bring it up these days.",
    "Only our president biden would go ride a train for 10 hours just to shake hands with our enemies. He is so brave.",
    "If anyone thinks and believes that America has been in better shape these past three years than it was in the four years before these past three years‚Ä¶ then vote for Biden‚Ä¶",
    "America please stop interfering in the affairs of other countries like the Middle East!! Just take care of your own country!!!",
    "I notice they're not mentioning Bribenomics anymore.",
    "Imagine he reads the comments lol",
    "Notice how he plagiarized the past us presidents in this video?",
    "Comments for this site will be shut down in 3,2,1...",
    "He was probably told to squint more to make it less obvious that he was using a teleprompter",
    "The Biden family and administration should be held accountable for elder abuse. Biden is like a novelty act who is lead around by his keepers.",
    "I‚Äôm not surprised his staff kept this exactly a minute. They probably still edited tf outta this",
    "\"America can be described in one word Asssfhhhtlllmmnfff\"",
    "-Joe Biden",
    "Everyone wants to know what world leaders held your hand in private and said 4 more years I need a deal too ,",
    "Wow Joe you sat on a train for a few hours, incredible",
    "Joe Biden has Lance Armstrong's conference in the 2024 election",
    "Thanks for the closed caption for those of us who speak like the living.",
    "What a crock‚Ä¶",
    "He‚Äôs doing such a bang up job here. People are forced to take out loans just to buy groceries and thousands of illegals storming into the country on a weekly basis, but hey‚Ä¶Ukraine just loves us! Tell that to the struggling families here who can barely afford to have a roof over their heads or food on the table. Anyone up for another 4 years of this misery?",
    "Even when Obama writes an amazing speech  for him, he sounds like he has never read it before that moment",
    "I‚Äôm not voting for a wokey party",
    "I do appoligise for some mistakes , because I studied a long time ago , I forgot some writings of words  and I am short of time , Hopefully I think that you would understand me",
    "I always picture Joey with a thought bubble containing a circus monkey playing cymbals, while awkwardly walking in a circle.",
    "His campaign is focused on helping Ukraine instead of helping America. No thanks. I‚Äôll be voting for a president who puts America first. Trump 2024",
    "Sometimes I forget that joe Biden Donald trump and Obama aren‚Äôt just friends that play mincecraft together every day",
    "Get this man some ice cream",
    "Biden could be the first president to die with his pants on backwards?",
    "Let‚Äôs go Brandon!",
    "Like this comment if you dislike the video, because youtube removed your ability to see the amount of dislikes",
    "With this video, its easy to understand why they didn't let this guy campaign in 2020. There's no pandemic to protect you this time.",
    "If I wanted to watch a Walmart job orientation I‚Äôd look it up joe",
    "Bribes =Treason =Traitor",
    "Vegetables are to be eaten‚Ä¶. not to lead a country‚Ä¶.",
    "Biden + Harris + Pelosi. Conclusion: America is falling apart and is almost bankrupt Ô∏è.",
    "Please give me Trump back !",
    "Little did America comprehend at the time that when Joe told us he would \"Unite\" us... The whole world would soon arrive at our backyard to become \"United\" with \"our\" wallets.",
    "Lets go Brandon!!",
    "How is this guy our president??",
    "We thank the American people for helping Ukraine üá∫üá¶üá∫üá¶üá∫üá¶",
    "What you call idea the Americans call nightmare",
    "When Biden Speaks, We all get Alzheimers",
    "Ill never forget the Ukrainian flag hung up on the wall inside the capitol with Zelensky standing in the spot of the president with Nancy Pelosi and Kamala Harris behind him clapping their hands.",
    "Please play Minecraft with Trump and Obama",
    "Thanks for Two WARS and everything Upside Down",
    "Crooks",
    "vote joe out",
    "The American revolution was 248 years ago anyway this was the same guy who said we had airports in 1776",
    "what would make us happy is if youd lower prices.",
    "I wonder if Joe gives his salary to charity?",
    "Use me as Putin like üá∑üá∫",
    "I'm surprised they even turned the comment section on.",
    "War criminal!",
    "‚ÄúWe hold these truths to be self-evident. All men and women are created, by the, you know‚Ä¶.you know the thing‚Äù",
    "~ Joe Biden",
    "We need to take care of America first so we are able to help others!",
    "On tanks there were writings with letter z , that letter z meant zelenskii , there are few words for letter z in the dictionary , or does it mean zoo or zebra or zombie or what , Zelenskii is also leader of terroristics groop I think",
    "Love the fairytale story time Joe.",
    "The amount of propaganda in this video is overwhelming",
    "The idea of America can be described in one word: Ajsjhrvb fffmm",
    "FREEDOM, INDEPENDENCE, SELF DETERMINATION, BUT NOT FOR PALESTINIAN PEOPLE.",
    "I DID NOT VOTE FOR THIS GUY. I FEEL SOOO INTELLIGENT",
    "We need younger qualified candidates",
    "7k dislikes over 2.5k likes on this video. WE KNOW",
    "Hey it's Genocide Joe",
    "Is it Biden or Buyoff ?",
    "Lies is all Joe can say",
    "If this is the best democrat candidate America has then I would hate to see the other candidates. Biden was popular as a vice-president with Obama but as the head honcho he is just too weak and slow to be respected. Biden throws his weight behind Israel and Ukraine after platforming to be anti-war. Biden is too old school, in a time of change what sense does it make to re-elect someone with such outdated policies at his core. The way Biden talks about his access to nuclear weapons make me literally anxious, he is growing more senile by the day.",
    "Biden is like Yinsen on Iron man 1. Somewhat comprehensible on camera but ridiculously remedial in real life.",
    "Hardly any trick or treaters, in fact, didn't see one in my neighborhood.  Food is just too expensive as candy.  Halloween candy are stacked high in the stores' aisles.",
    "\"When I turned 75, my colleges got me a PEZ Dispenser.  I'm so grateful.  I figured it out.....oh wait\"....---Joe Biden",
    "If we forget that, we lose. Letting Russia win weakens our stance in the world. Understand that!!",
    "situa renta pendukung israel,satu2nya presiden yg ketika berjalan bolak balik jatuh,mudah2han cepatlah kejatuhan akan dirimu,presiden paling gak bermutu yg pernah ada di amerika",
    "Thank you President Biden for everything you do for us.",
    "I find it very funny that they don't allow comments on the W/H channel but they allow them here ( for the worst president in American history ) , what is also funny is the amount of dislikes for all of his video's on this channel and the W/H channel so much for being the most popular TRUMP 2024",
    "Joey is planning to put someone in my room tonight , because when going inside i was passing my keys from the back to the from . üáØüá≤",
    "MAYBE    AI     can help this poor confussed man.",
    "Where‚Äôs Hunter and still haven‚Äôt told the American how many agents where present and why Nancy do her job",
    "CEASEFIRE NOW",
    "Forcing only men to register for the Draft is a contemptible sexism. That's unconstitutional.",
    "thanks for wrecking us joe!!",
    "This has to be a joke!",
    "Many drug users, homeless people, places like California, Philadelphia, this is a big social problem that the American government has to solve, otherwise it will only get worse",
    "Needs to be resolved urgently",
    "The man doesn't know where or what he is and he's running a Country! Scary!",
    "This man....is crazy",
    "@-SmoothCriminal-",
    "so you have comments activated on here but not the \"stop trump ad\" you must be scared to hear the truth",
    "Sleepy Sippy cut Joe‚Ä¶",
    "As long as Joe gets his ten percent",
    "Our enemies know Joe's the 90 lb. weakling in the room. Ô∏è",
    "this video sums up Biden so well",
    "Doing things for everyone but Americans",
    "Trump 2024",
    "Every homeless person in all the big cities of America applaud  you. All of the people struggling on the streets of America applaud you. Great job Joe. Thanks for taking care of your own country.",
    "Very hard to vote for Biden again",
    "high inflation, high benchmark interest rates and the American economy is getting destroyed but have lots of money to buy weapons and send to Ukraine and Israel What will happen to the future of the American people?",
    "oh biden shame on you at Gaza satuation",
    "I've got one question President Biden... How does your face keep changing?",
    "The air raid sirens went off exactly as he walked through the arch .",
    "How about you and Fetterman recite the ABC's. BTW, there are no numbers in the ABC's.",
    "you are too old for another run and you know it",
    "Is this dude not in a home yet",
    "Go DARK BRANDON & TAYLOR SWIFT!",
    "That was honestly pathetic. They cant even prop him up to do a quick promo...",
    "Donald trump making peace",
    "Joe biden making war",
    "Dude you wrecked the economy and my portfolio‚Ä¶.",
    "I didn't hear anbody apologizing to General Petraeus, for wrongly insults by the Congress and intelligentsia of 2007 for his positive report about surge,  avoiding similar catastrophe similar to the South Vietnam.  From happening in Kuwait. Including you Mr. president you owe him apology",
    "No, Sir. Please retire. Give it to someone or to those that can't only maintain the status quo, but ignite the entire world citizens.",
    "What a fool",
    "The promise of America in Iraq , Afghanistan , Vietnam and Libya and Cambodia !! What a nice promise",
    "Thank you for the worst inflation since the Great Depression",
    "GET DONNIE AND PLAY MINECRAFT PLEASE",
    "Never again. Hopefully the younger generation and all Muslims in America don't make the mistake of voting for him again.",
    "I vote for Mario Party",
    "I wonder how many takes this took?",
    "FJB.",
    "Treason is the reason.",
    "Wow joe, 81 million votes and you cant seem to get 1k likes? I think its sime for a nap, you're tired",
    "He probably has a piece of paper behind the scenes where everything is written. They also tell him where to look.",
    "Respected president of America, please save world peace",
    "Why is that war still going on?",
    "Why would he give another $200 million to them?",
    "FJB",
    "He‚Äôs just trolling us at this point.",
    "Insteading of putting 1,000,000 americans through community college, let us give 10 billion to... israel this week or ukraine? Oh... you want to give 100 billion? Enough to put 10,000,000 americans through community college? Uh... heh.. yeahhh... I dunno, boss.",
    "Also... mexico is a lot closer. With that same money we could have really invested in the place. China is getting really old, and all the manufacturing has to go to somewhere, and it won't all be india.",
    "I lost my wife, have you seen my wife?",
    "This guy is a lame excuse for a president. What is sorry sight.",
    "The best way to win is to arrest your greatest competition.",
    "why did this conflict conveniently start during your term?",
    "Lets go Brandon!!!!!!!!!!!!",
    "Joe, I‚Äôve started halving the containers of Orange Juice I buy with water cause they cost so much now. Please introduce that in your next press conference on Bidenomics.",
    "Hey, how is that laundered $40000.00 from james biden?",
    "üáÆüá≥üáÆüá≥üáÆüá≥üáÆüá≥üáÆüá≥üáÆüá≥üáÆüá≥üáÆüá≥üáÆüá≥üáÆüá≥üáÆüá≥üáÆüá≥üáÆüá≥üáÆüá≥",
    ". Merry Christmas",
    "May this festive season sparkle and shine, may all of your wishes and dreams come true, and may you feel this happiness all year round.",
    "It's Supposed To Be Fun How We Influence Each Individual As The State Leader",
    "He just is fit for the elderly home..................",
    "Trump 2024 to safe America",
    "Do you know what my grandma told me she said our pacific coast was invaded and attacked in California the Japanese Imperial Army was shooting at our women and children in California from a ship they had blackouts back then and had to keep their curtains drawn she was 13 in 1941 the President went to full recourse to protect California from another country with bad intentions in 1941",
    "They added prefix ior to denia , and for denia they changed the suffex , they added suffix mark , that is how the word denmark was changed in English version , we call them just denia",
    "Stop worrying about Biden you guys, he's about to get Alzheimer's",
    "Happy birthday Joe biden",
    "He gives me the \"super adventure club\" vibes.",
    "This is the guy who \"won\" the 2020 election? Okayyy...",
    "When you heard the fake air raid sirens? Give us a break old Joe, did you break out of your retirement home?",
    "Big fan of Harris. Quite possibly one of the greatest ventriloquists of all time. Move over Jeff Dunham lol",
    "Hahaha this is a parody? Pekade tell me it is a joke? He is bragging enter a safe zone with hundreds of guards and militaries?",
    "i hope that Biden gets his second term and that trump goes to jail for a really long time.",
    "Life was much better and we had more money in our wallets and bank account under Trump-THAT IS A FACT!",
    "This world don't need this man and his America",
    "Dude straight up thinks he's running for president of Ukraine at this point.",
    "Old ‚Äòscranton lunchbucket‚Äô joe suddenly is a multi millionaire‚Ä¶ the question is HOW?",
    "Wow and he wants to run for Four more years ‚Ä¶‚Ä¶ that‚Äôs Scary",
    "I am against abortion",
    "You started this war, and use fredom as a pretext",
    "\"I can't remember. Where am I\" We need a much younger person that would be for the people. Biden would be that person I would help at a retirement home to the lunch area.",
    "Yeah, you needed to talk to Ukraine's leaders about paying lots of tax payer money for them to keep your secrets a secret.  We know!",
    "You can see him reading the messages on the tv",
    "I could be sometimes mistaken for example I could be mistaken in Monica Belluchi , but to be sure is best to take blood tests",
    "Only AI could have Biden speak a scentence.",
    "TRAITOR",
    "Legendary speach",
    "en mexico todos se quejan de AMLO pero este se√±or esta por a√±os luz mucho peor, l√°stima por los gringos",
    "You were not in a war zone",
    "So nice to help the Ukrainian ppl",
    "There is no need for terrorists when America is there. The world has seen in the United Nations who is separate from the world and the enemy of peace.",
    "–°–ø–∞—Å–∏–±–æ. –†–æ—Å—Å–∏—è —Å–ø—Ä–∞–≤–∏—Ç—Å—è –∏ —Å –≤–∞–º–∏, –∏ —Å –£–∫—Ä–∞–∏–Ω–æ–π, –∏ —Å –ü—É—Ç–∏–Ω—ã–º.",
    "Old unhinge vegetable",
    "Hahahaha deleting comments now. WOW",
    "You think with all his experience in politics that this wouldn't happen to America the borders messed up everything's on the rise and prices a food and gas and housing it's unbelievable the change ive seen since he's been elected !! We need to elect someone that's really for our country and democracy..",
    "I think it should be investigated if the state(s) past and present are legislated with the Bible written as a story. The word immunity (Latin immunitas, freedom from obligations to the state) comes from a religious revelation from the Middle Ages, most likely from a pope to become lawless, and which has since been rewritten into sovereign, absolute, and qualified immunity (legally, cannot be prosecuted for the criminal act) to the president, senate (origin, the Roman Empire), congress, cabinet, and Supreme Court for law decisions and actions. It should also be investigated if fallen soldiers were popular elected by the people. The political exploitation of the vital ecosystem has now led to forest death and force majeure how will it affect people's health and economy?",
    "I also think The Democratic party can be a consciously misleading party name with all parties belonging to The Republican party, as current political democracy socialism can only be about going more toward the middle, e.g. The Democratic Party for law decisions and actions, even with the misleading word professional politician.",
    "Furthermore, I suggest the people should consider voting for a real democratic party with an independent state formation to investigate if the president, parties, senate (origin, the Roman Empire), congress, cabinet, and Supreme Court overall may be guilty of a violation of democratic rights with non-popular elections, serious economic crimes, violation of human rights with class society for adults and children, and serious environmental crime.",
    "Thanks for caring about other countries more than you do American citizens! Vote TRUMP 2024",
    "Ok grandpa, enough yapping go to sleep.",
    "And even I am a democrat saying this!",
    "Went to collect his 10%",
    "Stop sleeping behind the wheel mr President, America is about to end up in a wreck. Do something!!",
    "haha look at this baffoon...",
    "Biden Channel 2020 750k Subs President Trump 1.5 Million",
    "Today",
    "Biden 750k to",
    "President Trump almost 3Million  Trump",
    "Sir , since of lately I've realized Pastor Barneby has been flying very often in the air looking for me in an army strips Helicopter. Last week i saw bim flying over the hill heading from  at Nigerl point . President Joe Biden this is serious, im feeling it their Jesus have mercy on Jamaica dear Jesus . üáØüá≤",
    "Please step down",
    "Impeach the Bidens.",
    "First president in history to put another flag before America, never forget that.",
    "Human beings know they have to respect privacy, but curiosity is stronger than it should be. Curiosity must have limits. The only border that must be respected is between the earth and the universe.",
    "America can be summed up in one word:  TRUINIMANIPRSHR",
    "I'm honestly surprised that Joe is running for reelection in 2024.  I heard that even before the 2020 election, Biden said that if he won, he would not run for reelection.",
    "Go DARK BRANDON & TAYLOR SWIFT!",
    "Ratioed. I‚Äôm surprised they left the comment section open.",
    "Trump would turn his back on world freedom. And American freedom. We saw that on Jan 6. Biden 2024 üá∫üá∏",
    "Yes Mr President Biden and vice President Harris 2024 election day",
    "All the bots in the comments",
    "Biden rethink your reelection",
    "*Earlier this year I took Air Force One to watch clownlensky in the circus with other NATO leaders",
    "HE NEEDS TO GO AWAY",
    "What do you think Obama pick Joey to be his frontman in his next Administration",
    "regarding jan 6th: gas was $3/g, zero inflation, supply chain functioning well, economy strongest in 50 years, taliban wasn't armed with US artillery, stock market was record high, interest rate record low, and them it all changed with comatose Joe, I guess you got what you voted for, sad.",
    "TRUMP 2024",
    "The comedy is going great",
    "America is going great worst president ever",
    ".",
    "He fly morning, noon and evening. This man as links in red pond he knows, When I'm inside and outside. The back of this home is so dark . One can't see any reflection. A farm is  at the backyard. Straight dark . Could be around their in the dark , with one these youth , who are afraid of his influence. And can't speak with a gun at his head . That's how me view it . Will really appreciate your assistance with the search of this high seat criminal. üáØüá≤",
    "So brave! Eat led",
    "FJBStaff is paid to post positive Comments",
    "Cheater",
    "Lots of kids and babies and old people are dying",
    "But it is iordania , but they called themselves jordan for english speakers in order not to be sound suspicious I think",
    "FJB! Let's Go Brandon",
    "Joe go to sleepy",
    "80 Million votes huh? Impossible. Absolutely impossible!!! Why does America have a choice between two radical old grandpas!!!?? WHY!!",
    "Well as much as I would say he is in a bullet flying war zone donny is actually the first as north Korea is in a ceasefire state but still considered active war zone",
    "What a C...",
    "All those people on this chat praising BideN, MUST be made up, fake accounts",
    "Joe biden has 10 min videos of him mumbling and staring off into space, fjb TRUMP 2024",
    "I KNOW FOR A FACT IF YOU HELPED BUS/CHARTER BUS DRIVERS AND TRUCK DRIVERS AND GAVE US STUDENT LOAN FORGIVENESS OR HIGHER PAY YOU WOULD WIN PRESIDENCY AGAIN. I JUST KNOW IT",
    "Mom:clean your room",
    "Me:I'm the one at the sail I'm the master of my sea",
    "Mom:slaps me",
    "Me:PAIN!",
    "\"i want to stop\"",
    "\"we cant\"",
    "that describe our condition when we listen this song",
    "9.1K",
    "Anyone in 2024?? Give it a like¬°¬°¬°¬°",
    "1.9K",
    "Who Watching today",
    "‚ÄúI wanna stop!‚Äù",
    "School: ‚ÄúWe can‚Äôt.‚Äù",
    "Me doin hard work",
    "Mind: i want to stop",
    "My wallet: we can't",
    "Imagine Dragons 2024, who's with me?",
    "2.6 billion views in 2024",
    "First things first",
    "I'ma say all the words inside my head",
    "I'm fired up and tired of the way that things have been, oh-ooh",
    "The way that things have been, oh-ooh",
    "Second thing second",
    "Don't you tell me what you think that I can be",
    "I'm the one at the sail, I'm the master of my sea, oh-ooh",
    "The master of my sea, oh-ooh",
    "I was broken from a young age",
    "Taking my sulking to the masses",
    "Writing my poems for the few",
    "That looked at me took to me, shook to me, feeling me",
    "Singing from heart ache from the pain",
    "Take up my message from the veins",
    "Speaking my lesson from the brain",
    "Seeing the beauty through the...",
    "Pain!",
    "You made me a, you made me a believer, believer",
    "Pain!",
    "You break me down, you build me up, believer, believer",
    "Pain!",
    "I let the bullets fly, oh let them rain",
    "My life, my love, my drive, it came from...",
    "Pain!",
    "You made me a, you made me a believer, believer",
    "Third things third",
    "Send a prayer to the ones up above",
    "All the hate that you've heard has turned your spirit to a dove, oh-ooh",
    "Your spirit up above, oh-ooh",
    "I was choking in the crowd",
    "Living my brain up in the cloud",
    "Falling like ashes to the ground",
    "Hoping my feelings, they would drown",
    "But they never did, ever lived, ebbing and flowing",
    "Inhibited, limited",
    "Till it broke open and it rained down",
    "It rained down, like...",
    "Pain!",
    "You made me a, you made me a believer, believer",
    "Pain!",
    "You break me down, you built me up, believer, believer",
    "Pain!",
    "I let the bullets fly, oh let them rain",
    "My life, my love, my drive, it came from...",
    "Pain!",
    "You made me a, you made me a believer, believer",
    "Last things last",
    "By the grace of the fire and the flames",
    "You're the face of the future, the blood in my veins, oh-ooh",
    "The blood in my veins, oh-ooh",
    "But they never did, ever lived, ebbing and flowing",
    "Inhibited, limited",
    "Till it broke open and it rained down",
    "It rained down, like...",
    "Pain!",
    "You made me a, you made me a believer, believer",
    "Pain!",
    "You break me down, you built me up, believer, believer",
    "Pain!",
    "I let the bullets fly, oh let them rain",
    "My life, my love, my drive, it came from...",
    "Pain!",
    "You made me a, you made me a believer, believer",
    "Thank me later",
    "2.2K",
    "2015: \"I want to believe\"",
    "2017: \"You made me a believer.\"",
    "5.6K",
    "Anyone in  2024??!!....give like here Ô∏è",
    "Who's watching 24 may attendance please",
    "Quem √© do Brasil curte",
    "have a good day folks :)",
    "3.9K",
    "What's with May 2024 ?!",
    "Anyone in 2024 still listening it?",
    "Os Br t√£o vendo isso?",
    "Alguem Em 2019 ?",
    "29 may 2024??",
    "who see 2024 give like pls",
    "world : Off",
    "Imagine Dragons : On",
    "Hell Yeah",
    "1.7K",
    "I wanna stop watching this.",
    "We can't.",
    "2.4K",
    "when I go to the restroom,I am always encouraged this song",
    "I REMEMBER YOU CAME TO MY SCHOOL BUT MY MUM DIDNT LET ME TAKE LESSONS WITH YOU REMEMBER ? YOUR SONGS ARE AMAZING PLS COME AGAIN AND CAN YOU PERFORM",
    "This song is very famous in South tamilnadu, India.",
    "FASTEST I EVER CLICKED ON A VIDEO",
    "2.6K",
    "Anyone in May 2024",
    "Stop asking who's listening in 2024. We never stop.",
    "Here before the 1m squad, like if you're the same, coz you're a true IMAGINE DRAGONS FAN",
    "Me: I wanna stop.",
    "YouTube: We can't.",
    "4.8K",
    "Deadlift workout music right here   a u t h e n t I c v i e w s   dun took Imagine Dragons oFf 2 da big leagues and for dat I will always be super grate",
    "Anyone in may ????",
    "My phone's battery before I play this song: 2%",
    "My phone's battery after playing this song: 5%",
    "1.3K",
    "Lyrics:",
    "First things first",
    "I'ma say all the words inside my head",
    "I'm fired up and tired of the way that things have been, oh ooh",
    "The way that things have been, oh ooh",
    "Second things second",
    "Don't you tell me what you think that I could be",
    "I'm the one at the sail, I'm the master of my sea, oh ooh",
    "The master of my sea, oh ooh",
    "I was broken from a young age",
    "Taking my sulking to the masses",
    "Writing my poems for the few",
    "That look at me, took to me, shook to me, feeling me",
    "Singing from heartache from the pain",
    "Taking my message from the veins",
    "Speaking my lesson from the brain",
    "Seeing the beauty through the...",
    "Pain!",
    "You made me a, you made me a believer, believer",
    "Pain!",
    "You break me down, you build me up, believer, believer",
    "Pain!",
    "Oh let the bullets fly, oh let them rain",
    "My life, my love, my drive, it came from...",
    "Pain!",
    "You made me a, you made me a believer, believer",
    "Third things third",
    "Send a prayer to the ones up above",
    "All the hate that you've heard has turned your spirit to a dove, oh ooh",
    "Your spirit up above, oh ooh",
    "I was choking in the crowd",
    "Building my rain up in the cloud",
    "Falling like ashes to the ground",
    "Hoping my feelings, they would drown",
    "But they never did, ever lived, ebbing and flowing",
    "Inhibited, limited",
    "Till it broke open and rained down",
    "It rained down, like...",
    "Pain!",
    "You made me a, you made me a believer, believer",
    "Pain!",
    "You break me down, you build me up, believer, believer",
    "Pain!",
    "Oh let the bullets fly, oh let them rain",
    "My life, my love, my drive, it came from...",
    "Pain!",
    "You made me a, you made me a believer, believer",
    "Last things last",
    "By the grace of the fire and the flames",
    "You're the face of the future, the blood in my veins, oh ooh",
    "The blood in my veins, oh ooh",
    "But they never did, ever lived, ebbing and flowing",
    "Inhibited, limited",
    "Till it broke open and rained down",
    "It rained down, like...",
    "Pain!",
    "You made me a, you made me a believer, believer",
    "Pain!",
    "You break me down, you build me up, believer, believer",
    "Pain!",
    "Oh let the bullets fly, oh let them rain",
    "My life, my love, my drive, it came from...",
    "Pain!",
    "You made me a, you made me a believer, believer",
    "Lyrics:",
    "[Verse 1]",
    "First things first",
    "I'ma say all the words inside my head",
    "I'm fired up and tired of",
    "The way that things have been, oh-ooh",
    "The way that things have been, oh-ooh",
    "[Verse 2]",
    "Second things second",
    "Don't you tell me what you think that I could be",
    "I'm the one at the sail",
    "I'm the master of my sea, oh-ooh",
    "The master of my sea, oh-ooh",
    "[Pre-Chorus]",
    "I was broken from a young age",
    "Taking my sulkin' to the masses",
    "Writing my poems for the few",
    "That look at me, took to me, shook at me, feelin' me",
    "Singing from heartache from the pain",
    "Taking my message from the veins",
    "Speaking my lesson from the brain",
    "Seeing the beauty through the...",
    "[Chorus]",
    "Pain! You made me a, you made me a",
    "Believer, believer",
    "Pain! You break me down, you build me up",
    "Believer, believer",
    "Pain! Oh, let the bullets fly, oh, let them rain",
    "My life, my love, my drive, it came from‚Ä¶",
    "Pain! You made me a, you made me a",
    "Believer, believer",
    "[Verse 3]",
    "Third things third",
    "Send a prayer to the ones up above",
    "All the hate that you've heard",
    "Has turned your spirit to a dove, oh-ooh",
    "Your spirit up above, oh-ooh",
    "[Pre-Chorus]",
    "I was chokin' in the crowd",
    "Building my rain up in the cloud",
    "Falling like ashes to the ground",
    "Hoping my feelings, they would drown",
    "But they never did, ever lived, ebbin' and flowin'",
    "Inhibited, limited 'til it broke open and rained down",
    "It rained down, like‚Ä¶",
    "[Chorus]",
    "Pain! You made me a, you made me a",
    "Believer, believer",
    "Pain! You break me down, you build me up",
    "Believer, believer",
    "Pain! Oh, let the bullets fly, oh, let them rain",
    "My life, my love, my drive, it came from‚Ä¶",
    "Pain! You made me a, you made me a",
    "Believer, believer",
    "[Verse 4]",
    "Last things last",
    "By the grace of the fire and the flames",
    "You're the face of the future",
    "The blood in my veins, oh-ooh",
    "The blood in my veins, oh-ooh",
    "[Pre-Chorus]",
    "But they never did, ever lived, ebbin' and flowin'",
    "Inhibited, limited 'til it broke open and rained down",
    "It rained down, like‚Ä¶",
    "[Chorus]",
    "Pain! You made me a, you made me a",
    "Believer, believer",
    "Pain! You break me down, you build me up",
    "Believer, believer",
    "Pain! Oh, let the bullets fly, oh, let them rain",
    "My life, my love, my drive, it came from‚Ä¶",
    "Pain! You made me a, you made me a",
    "Believer, believer",
    "ÿßÿ≠ÿ≥ ÿ®ÿßŸÑŸÇŸàÿ© ŸÑŸÖÿß ÿßÿ≥ŸÖÿπŸáÿß",
    "I have exams coming up in a week and this song is the only motivation I have for studying.",
    "1.4K",
    "This song makes me a believer that good music still exists..",
    "1.4K",
    "2024 And it still hits!",
    "Eu aqui ainda na terapia 2024",
    "this comment section",
    "30% Riverdale comments.",
    "40%i let my blank listen to this and know it is a blank",
    "25%of how awesome this song is.",
    "4%of these comments",
    "1%of Nintendo switch commercial",
    "2.5K",
    "OMG",
    "Who sees this before it becomes VIRAL!",
    "25 may 2024 ?",
    "Stop to asking me if i am here and yes my name is really 2024, sure !",
    "And believe in me May 2024.",
    "\"I wanna stop.\"",
    "\"We can't.\"",
    "1.9K",
    "Why are all comments like 1 day ago? We all just remembered this song",
    "ŸÅÿßŸÜÿ≤ ÿØÿ±ÿ®ÿ≠ÿ© ŸÖÿ± ŸÖŸÜ ŸáŸÜÿß",
    "One third of the entire population has viewed this video.",
    "March is coming, Don't let Corona hear this song",
    "Onerepublic, imagine dragon, coldplay are the real bands",
    "ŸáŸÑ ŸäŸàÿ¨ÿØ ÿπÿ±ÿ®Ÿä ŸáŸÜÿß!!",
    "any one today",
    "3.5 years later if your watching this your a believer",
    "what a masterpiece",
    "1.2K",
    "ANYONE WATCHING IN 2024 like it",
    "The power of personal faith is belief in the impossible.",
    "Today?",
    "[December 13th, 2018üáÆüá©]",
    "Believer",
    "Imagine Dragons",
    "First things first",
    "I'ma say all the words inside my head",
    "I'm fired up and tired of the way",
    "That things have been, oh-ooh",
    "The way that things have been, oh-ooh",
    "Second things second",
    "Don't you tell me what you think that I could be",
    "I'm the one at the sail, I'm the master of my sea, oh-ooh",
    "The master of my sea, oh-ooh",
    "I was broken from a young age",
    "Taking my sulking to the masses",
    "Writing my poems for the few",
    "That look at me, took to me, shook to me, feeling me",
    "Singing from heartache from the pain",
    "Taking my message from the veins",
    "Speaking my lesson from the brain",
    "Seeing the beauty through the",
    "Pain!",
    "You made me a, you made me a believer, believer",
    "Pain!",
    "You break me down and build me up, believer, believer",
    "Pain!",
    "Oh, let the bullets fly, oh, let them rain",
    "My life, my love, my drive, they came from",
    "Pain!",
    "You made me a, you made me a believer, believer",
    "Third things third",
    "Send a prayer to the ones up above",
    "All the hate that you've heard",
    "Has turned your spirit to a dove, oh-ooh",
    "Your spirit up above, oh-ooh",
    "I was choking in the crowd",
    "Building my rain up in the cloud",
    "Falling like ashes to the ground",
    "Hoping my feelings, they would drown",
    "But they never did, ever lived, ebbing and flowing",
    "Inhibited, limited",
    "Till it broke open and rained down",
    "And rained down, like",
    "Pain!",
    "You made me a, you made me a believer, believer",
    "Pain!",
    "You break me down and build me up, believer, believer",
    "Pain!",
    "Oh, let the bullets fly, oh, let them rain",
    "My life, my love, my drive, they  came from",
    "Pain!",
    "You made me a, you made me a believer, believer",
    "Last things last",
    "By the grace of the fire and the flames",
    "You're the face of the future",
    "The blood in my veins, oh-ooh",
    "The blood in my veins, oh-ooh",
    "But they never did, ever lived, ebbing and flowing",
    "Inhibited, limited",
    "Till it broke open and rained down",
    "And rained down, like",
    "Pain!",
    "You made me a, you made me a believer, believer",
    "Pain!",
    "You break me down and build me up, believer, believer",
    "Pain!",
    "Oh, let the bullets fly, oh, let them rain",
    "My life, my love, my drive, they  came from",
    "Pain!",
    "You made me a, you made me a believer, believer",
    "Anyone after rcb qualifying in 2024 ?",
    "Anyone in May 23",
    "Lyrics",
    "First things first",
    "I'ma say all the words inside my head",
    "I'm fired up and tired of the way that things have been, oh ooh",
    "The way that things have been, oh ooh",
    "Second thing",
    "Second, don't you tell me what you think that I can be",
    "I'm the one at the sail, I'm the master of my sea, oh ooh",
    "The master of my sea, oh ooh",
    "I was broken from a young age",
    "Taking my sulking to the masses",
    "Write down my poems for the few",
    "That looked at me took to me, shook to me, feeling me",
    "Singing from heart ache from the pain",
    "Take up my message from the veins",
    "Speaking my lesson from the brain",
    "Seeing the beauty through the",
    "You made me a, you made me a believer, believer",
    "(Pain, pain)",
    "You break me down, you build me up, believer, believer",
    "(Pain)",
    "I let the bullets fly, oh let them rain",
    "My life, my love, my drive, it came from",
    "(Pain)",
    "You made me a, you made me a believer, believer",
    "Third things third",
    "Send a prayer to the ones up above",
    "All the hate that you've heard has turned your spirit to a dove, oh ooh",
    "Your spirit up above, oh ooh",
    "I was choking in the crowd",
    "Living my brain up in the cloud",
    "Falling like ashes to the ground",
    "Hoping my feelings, they would drown",
    "But they never did, ever lived, ebbing and flowing",
    "Inhibited, limited",
    "'Til it broke up and it rained down",
    "It rained down, like",
    "You made me a, you made me a believer, believer",
    "(Pain, pain)",
    "You break me down, you built me up, believer, believer",
    "(Pain)",
    "I let the bullets fly, oh let them rain",
    "My life, my love, my drive, it came from",
    "(Pain)",
    "You made me a, you made me a believer, believer",
    "Last things last",
    "By the grace of the fire and the flames",
    "You're the face of the future, the blood in my veins, oh ooh",
    "The blood in my veins, oh ooh",
    "But they never did, ever lived, ebbing and flowing",
    "Inhibited, limited",
    "'Til it broke up and it rained down",
    "It rained down, like",
    "You made me a, you made me a believer, believer",
    "(Pain, pain)",
    "You break me down, you built me up, believer, believer",
    "(Pain)",
    "I let the bullets fly, oh let them rain",
    "My life, my love, my drive, it came from",
    "(Pain)",
    "You made me a, you made me a believer, believer",
    "Subscribe to Google Play Music and listen to this song and millions of other songs. First month free.",
    "From Google Play Music",
    "13/2/2019?",
    "Anyone may 2024",
    "Bonita cancion",
    "I don't have Zelda for the Nintendo Switch, so I have to imagine dragons",
    "1.9K",
    "December 2018?",
    "2018?",
    "December?",
    "I guess it‚Äôs just me.",
    "If someone likes it, I'll listen to it again",
    "–ö—Ç–æ —Ç—É—Ç —Å –ø–µ—Å–Ω–∏ –Ø –ß–ò–¢–ï–†?",
    "Believer",
    "Champions league...",
    "2.1K",
    "this beat is actually fire",
    "Everton 2024 algu√©m ouvindo",
    "Imagine Dragons, when this came out I was homeless, on drugs, and in jail. Now I have a good job, a husband, and I‚Äôm healthy. This song and ‚ÄúClover Cage - Miraculous‚Äù are the two songs that helped with my depression. I just want everyone to know that things will get better. We are in this together. I love you",
    "Me: ƒ± want to stop 2020",
    "2020: we can't",
    "I let this song hear it self",
    "Now its a paradox",
    "Beforee my maths exam",
    "My favorite song 1:46",
    "2:18 when your almost done with the dishes and someone puts more dishes in the sink",
    "1.6K",
    "Felicidades te as encontrado el 1er comentario espa√±ol(:V)",
    "The way this is 7 years old and its still getting views",
    "For every like this comment gets, I get a notification and will watch this amazing song again. For every reply per person I'll watch it twice. Do your worst internet.",
    "I let myself read the comments",
    "now I'm depressed",
    "July 2018?.",
    "1.1K",
    "Finally I Got The Masterpiece.",
    "Any one june 2024??",
    "Whose here before 1m?",
    "And notification squad? :D",
    "David beckham from the future is that you?",
    "hello imagineDragons",
    "Take this so good song",
    "I put this song to my dog...",
    "He became a WOLF.",
    "Setembro 2018",
    "They performe today in ipl 2024 closing ceremony",
    "Kk good music",
    "BR assistindo em 2018 dezembro ?",
    "Old comments: good I'm believer too",
    "New comments:ANyoNe 2020",
    "try listening to the song at 2x speed.",
    "Wow Arms for the Nintendo Switch looks really good",
    "No entiedo que mierda dice pero me gusta",
    "I love imagine dragons so much I want to meet them in person",
    "After ipl final announcement",
    "Played this song in 2020",
    "2020 left.",
    "Believer  2019 champions league",
    "This song gives me confidence before my soccer matches",
    "This really hits different if u have a symptom like cancer",
    "Who else is listening and reading comments ?",
    "1.6K",
    "dont Say \"Who's Listening At 2021? Because We never left",
    "2024 june anyone?",
    "2024? It feels like 2017 7y ago",
    "i let my wifi router listen to this",
    "now i have 10 gbps download speed",
    "2.4K",
    "My English teacher: So, first things first",
    "Me :",
    "24 may, 2024",
    "I believe After 10 years this song will be give me same vibes.",
    "Is this song 7 years old???",
    "Eu n√£o posso ser a √∫nica BR aqui n√©? ;-;",
    "August 2018?",
    "thanks everybody",
    "Azerbaycandan dinl…ôy…ôn me√ß…ô n…ôf…ôrik",
    "I let my grass listen to this",
    "I have weed now",
    "1.5K",
    "2018 - 2019 ???",
    "But me fighting my pillow  cause it‚Äôs so good",
    "absoult banger in a 2014 vauxhall zafira",
    "1:03 hotline bling",
    "BUGHEAD",
    "Edit: Holy crap thank you guys for 100 likesÔ∏èÔ∏èÔ∏è",
    "BRO THIS SONG ALWAYS HIT!",
    "Going for 3 billion let's go",
    "I let my origin listen to this...",
    "now its a Steam",
    "So wihch is better?",
    "Radioactive",
    "Or",
    "Believer?",
    "Indian Audiance üáÆüá≥",
    "My son love this song",
    "I let Cheryl Blossom listen to this song once",
    "She burned her house down",
    "1.4K",
    "Algu√©m em 2019 emmmmmmm",
    "Who listens to this song while exercising?",
    "This is the best song ever",
    "I let my Internet Explorer listen to this",
    "Now it's Google Chrome",
    "Os Brs sempre comentam a mesma coisa kk",
    "\"Vim pela Sam\"",
    "\"2018?\"",
    "\"Cade os Br?\"",
    "\"S O U T H  A M E R I C A...\"",
    "Sempre a mesma coisa pqp kkk",
    "I love this song  Ô∏è",
    "ESTABA BUSCANDO EST√Å CANCI√ìN",
    "am i the only one who thought he was saying 'timmy broke up with me'  at 1:50",
    "Who is here in 2018 Dec",
    "This song is fire  who agrees???",
    "1st June 2024. Who's there ?",
    "Da un like si hablas espa√±ol.",
    "It feels like if you speak inglish",
    "Like si entiendes cosas en Espa√±ol",
    "I don't wanna stop",
    "Just fly and win my goal",
    "May 2024 And Still Going",
    "I let my Lego brick listen to this...",
    "Now he steps on me",
    "1:16 THIS MADE ME A BELIEVER",
    "1.3K",
    "–°—É–ø–µ—Ä –ø–µ—Å–Ω—è. –ë–µ—Å–ø–æ–¥–æ–±–Ω–æ. –î–æ –æ—Ä–≥–∞–∑–º–∞. –ò–¥–µ–∞–ª—å–Ω–∞. –û–±–æ–∂–∞—é.",
    "6 years ago i was still listening to this masterpiece",
    "Who here because you are a true fan to Imagine Dragons",
    "Algu√©m novembro?",
    "Anyone in june",
    "My daughter learnt this song and singing  it is amazing",
    "Los que hablan espa√±ol",
    "This song makes me want to Hit the Gym and push my limits.",
    "1.6K",
    "After 7 years, i can feel these words and know these days, i am great full to all my PAINS",
    "Very good song",
    "2018 novembro?  Ô∏èÔ∏èÔ∏è",
    "I let my pet lizzard listen to this now he is godzilla",
    "Pain make us strong",
    "Pinned by Veritas",
    "Weird. No clips of Witsit, Jeran, or Bob, three of the most prolific contributors to this conversation. It’s almost as if this entire video is one huge strawman fallacy. Yes, some flat earthers don’t articulate their thoughts very well and make highly speculative statements. But there are others who know the scientific literature very well and can see major flaws and even outright deception in it. If FE is so dumb, why make an 8 hour hit piece against it that leaves out the brightest people in the movement?",
    "·",
    "Wake up honey, Veritas’ new rabbit hole just dropped!",
    "(Edit) Labelling a section for us to disregard as if you didn’t create an analogue horror style 1984 brainwashing rap/monologue about flat earth is unfair … I am a free thinker… I am a free thinker… I must buy Veritas merch… I am a free thinker …",
    "Boss: Why didn't you get any work done today?",
    "Employee: I was watching a Veritas video.",
    "Boss: OH SHIT, IT DROPPED! You are excused.",
    "Me: I don't watch movies any more, they are all 3 hours or more, it's too long",
    "Also Me: An eight hour long video about the flat earth? Clear my schedule.",
    "\"I don't care about a study, I want to see a scientific experiment\" is one of the sentences of time.",
    "Reminder: This is the guy who made Mosin Man.",
    "When you said it was going to be long, you weren't exaggerating ... that's what she said",
    "·",
    "\"I cant even see my balls without relying on glasses, why the F would i trust my eyes\"",
    "As a fellow 4eyes... I relate to this sooo much.",
    "\"Chemtrails. They're poisoning us.\" Immediately sucks on a vape. That killed me!",
    "Bro just slaps a 7:44:13 hour video",
    "(Edited for correct time since the comments were unhappy with me)",
    "If the earth is flat, then so is my belly. Can't wait for Veritas to tell me I'm fit af.",
    "\"No, I don't think smoking will harm my baby\"",
    "30 years later",
    "\"The earth is flat and you can't prove it's a globe\"",
    "The ONLY times flat earthers are honest: when they say \"I don't know\".",
    "Finally, \"Flat Earth: A quick retrospective\"",
    "IVE BEEN ANTICIPATING THIS SINCE ITS FIRST MENTION ON POGCAST LET'S GOOOOO",
    "I gave up on these debates when I saw people claiming space isn't real because we can't breach this imaginary bubble called the \"firmament.\"",
    "I admire your patience.",
    "As an astronomer I always like when flat earthers say everything I do is fake. Literally used Hubble data myself.",
    "I'm here for the frisbee memes.  There had better be a frisbee meme.",
    "edit to add: Demmoch sounds like a real gem.",
    "·",
    "Every single flerf FAILS at math.",
    "If the Earth is flat,  why have the cats not got rid of us all? We all know how they love to push everything on a flat surface. So why are we still here?",
    "Watching the flat earthers not understand anything has been one of my guilty pleasures for a few years now, it's hard for any of them to surprise me now. I can't imagine going into a near 8 hour video showcasing their own oh so special kind of stupid without having experienced it before. Strap in!",
    "7:39:45 \"chem trails, they're poisoning us\" and then she proceeds to take a deep whiff of poison...",
    "Do you see what happens, Larry?",
    "Do you see what happens when you tell a stranger to do their own research!",
    "I literally fell over laughing at \"I'm just using the numbers the scientists are giving us\" 1x10^-11 ohmygod oh my GOD",
    "at first you laugh at them, but the more you delve into it the more depressed you become at how unintelligent they are.",
    "First minute I was expecting the Monty Python foot to flatten it all out.",
    "\"hbomb videos are so long OMG!\"",
    "veritas: hold my beer.",
    "\"How many planets and gasses are in a rainbow\"",
    "i feel like im having a stroke",
    "The guy who triple downed on cation had me laughing so hard that my sides flew into orbit.",
    "N: Not",
    "A: Always",
    "S: telling",
    "A: truth",
    "FINALLY. My sister birthed my nephew before this dropped lol. LETS FUCKING GO",
    "Admittedly, for quite possibly too long I just thought people were trolling. Once I found out that there are people who truly, deeply believe that it's flat I went through a ton of emotions",
    "Layered “YOU’RE AN IDIOT” is golden.",
    "This is absolutely epic. I can't wait to dive into this one!! Holy crap Veritas, is this your magnum opus?!",
    "WE GETTIN OUT DA FIRMAMENT DOME WITH THIS ONE ️️",
    "Oh man, CC's wife is going to file for a divorce when she finds out he's in this. Omg",
    "This man has spent a ton of time making this video. I honestly can't imagine. I have little time to watch his stream, but I have subscribed to his twitch for 3ish years and have been a patreon member for about 1 year. I don't know Veritas or have any regular communication with him.  Support this man. His work is exceptional.",
    "·",
    "We got Veritas' 8 hour long flat earth video before GTA6",
    "I haven’t watched many of your other videos, but YouTube puts your Billy Mitchell video on like every night for the last 5 months. I’m so excited to have a new long form video and I can’t wait to listen to this one on repeat for months to come! Thank you!",
    "At 15 minutes in, this feels like a documentary on living with malignant narcissism.",
    "I swear if this ruins my youtube algorithm I'm gonna be pissed lol. In all seriousness though, I'm 40 minutes in and I had no idea I needed this content in my life. Thank you as always for the insane amount of work you put into all of your projects. <3",
    "Letssss gooo, I've been eagerly waiting on this bloody video",
    "1:15:30 Austin says \"that's not to scale, you have to apply the scale to the outer regions... there's literally a legend on the map.\" yeah Austin, there's a legend on the map to help with scale because it's a FLAT PROJECTION of a SPHERICAL OBJECT. and since that is the standard map that all flat earthers use to say that this IS what Earth looks like, then, from a flat earther's perspective, that map should ALREADY be TO scale, so the legend shouldn't be necessary. he tried to use the legend to prove his argument when it actually goes against him.",
    "I discovered flat earth a few years ago and thought it had to be a joke, it took a while to process that some people do genuinely believe this stuff. I’ve been fascinated by it ever since",
    "For every 100 thumbnails that has an image of someone looking shocked, there's 1 thumbnail with actual quality content.",
    "I can never understand why trash gets more views. This video is brilliant and I'm only 2 hours in so far. I've watched many of the channels included in this over the past 7 years, this video is a fantastic overview and more.",
    "\"The only thing you need for this model to work is three extra dimensions!\"",
    "\"I- E- ohh...\"",
    "Here we go boys! Gonna be a long one! Going to listen to this at work all day!",
    "The \"disregard this section\" 1:34:43 was so amazingly well done, it felt exactly like an analogue horror clip. The fact that you've put so much effort into all 7+ hours of this is mind boggling.",
    "I've spent the last year talking with and debating flat earthers, and this may just be the best video I've ever seen breaking down the topic. Really incredible work!",
    "new veritas ADHD hyperfixation just dropped, and boy am I ready.",
    "Finally.  Looking forward to this for a long time.",
    "Man, you warned about cringe, and I was doing good until I got to “cation”. Holy shit.",
    "27:00 he wants the weight of a rainbow? I don't know the exact value, but I can tell you it's pretty light",
    "I'm seriously 1min 11seconds in and I already lost my temper due to all the stupidity. I just can't deal with this today. Kudos to you, Veritas, for spending such a long time in that pool of dumbness and sheer fantasy, that ultra long documentation must have taken months to make and years off of your life.",
    "You're one of the verrry few who have earned me \"ringing the bell.\"",
    "The trek into the realm of video essay is much appreciated, at least by me, though \"video dissertation\" may evoke the proper scale in this case. I always enjoyed your deep dives into topics on Tarkov (they were superb), but branching out has taken it to a whole different level. I understand that you seem to have a personal fascination with the things you research. I have the same inclination to dig deep on whatever thing I find interesting, but your willingness to take that information, put it together into a logical story, and share it with the masses is what absolutely amazes me. Thank you for this, truly. I believe you've found your calling and hope you're finding joy (and financial success) in it.",
    "5:57:00 LMAO that is a perfect representation of the Flat Earth Society vs the modern Flerf movement",
    "And yes I have listened to 6 hours of this video, and I will finish it.",
    "I just love how actual reality is so much more interesting then flerters imagination.",
    "WOW! This is like one of those game retrospective videos in length. This will be open in a tab for several days.",
    "Holy shit V, what a video! Cannot wait to spend a full workday getting paid to watch it :D",
    "Troy Hutchinson's \"kay-shun\" flub is the absolute epic flerf fail of all time.",
    "I remember getting into an argument with another kid at our lab table in the 6th grade.  I realized very quickly that this kid was simply not interested in learning anything and, in fact, was just angry that he was being asked to learn.",
    "I've no doubt that kid gre",
    "Such a good christian song",
    "\"I get more ass than a toilet seat.\"",
    "That is single handedly the best line in all existence.",
    "#Holy Shit. This blew up.",
    "RIP Nate Dogg..he's probably the most underrated support rapper in the whole industry..his singing MADE tracks and kept them memorable...no Regulators or Next Episode without him",
    "1.1K",
    "19 years later, if you’re watching this, you’re a legend.",
    "With a music video like this, who the fuck are you censoring the lyrics for?",
    "1.7K",
    "Censoring this just seems like pissing in the wind",
    "After all these years, still one of Eminem's best songs. His collab with Nate is perfect. Gives me chills every time.",
    "R.I.P Nate Dogg 1969-2011",
    "oh boy. im glad this video doesnt have any swearing. i can watch this with my mom",
    "6.4K",
    "Before autotune we had Nate Dogg. True legend",
    "Rip man...",
    "RIP Nate Dogg (August 19, 1969 – March 15, 2011), aged 41",
    "You will be remembered as a legend.",
    "It will never get old, it's still a great song",
    "This is 2020: still a banger.",
    "3.8K",
    "Nate killed it here. One of the best ones there was.",
    "R.I.P.",
    "7.7K",
    "Come back to this every now and then. Really miss Nate Dogg. RIP",
    "One of the best songs in my collection. Forever a classic RIP Nate dogg.",
    "This literally popped into my head at 4AM and I regret nothing.",
    "the fact that theres a \"clean\" version of this song implies that this has most likely been played at someones school dance",
    "3.6K",
    "The most underrated song on the alubum",
    "2024 ?????",
    "The animation feels like an early 2000s adult swim cartoon.",
    "Apparently according to vevo",
    "Behind is now a curse word",
    "2.8K",
    "Eminem and Nate on the same songs make a dangerous team.",
    "2024 and it still slaps. RIP Nate Dogg",
    "Cant believe my dad used to drop me off to elementary school playing this",
    "Update: I got my own car now, now I drive to school with this playing",
    "7.5K",
    "The Slim Shady anime looks good",
    "1.4K",
    "If you‘re listening in 2024 you‘re legend",
    "Eminem is my favourite anime",
    "3.5K",
    "This looks like the type of cartoon that you would see on the TV in GTA V.",
    "9.5K",
    "Dude this song HITS at full volume with headphones on.",
    "that lyrics are so deep",
    "1.6K",
    "People: \"Eminem's songs from back in the day were so profound and deep!\"",
    "Eminem's Songs from back in the day:",
    "3.8K",
    "From watching this on MTV early 2000s to watching it on youtube, i can honestly say this song never got old. And it probably never will either",
    "R.I.P. my man nate he was a true one",
    "R.I.P. Nate Dogg",
    "1.7K",
    "Perfect song to listen while having lunch with family on a peaceful Sunday",
    "Descanse en paz Nate Dogg",
    "2000s bring again",
    "Censoring this song is like trying to kill a skeleton",
    "9.4K",
    "The whole fucking song is ruined by censoring everything.",
    "2.1K",
    "NEVER GETS OLD",
    "Anyone else love this track?",
    "RIP Nate Dogg",
    "15th March 2011",
    "1.9K",
    "0% Marshall",
    "0% EMINEM",
    "100% SLIM SHADY",
    "100% ASS",
    "3:50 one of the best part",
    "Youtube kids",
    "Am i the only one who thinks Nate Dogg voice is satisfying",
    "Nobody:",
    "Cartoon Network at 3 AM:",
    "5.4K",
    "Still ere 2024️",
    "Marvellous song by the king Eminem",
    "If u ever feel useless just remember that this song was censored",
    "5.3K",
    "wtf is up with censoring the word “behind”",
    "1.5K",
    "That's some good music right there. Better than any trending music rn.",
    "Only song where Eminem and a Feature got the same bars and energy",
    "I rember watching this when I was like 8, I was so confused lmao",
    "2.9K",
    "The most legendary line of all time: “I get more ass then a toilet seat”",
    "to believe I was 9 when I first watched this amazing song. Time truly flies. Also wtf was I watching this when I was 9? where were my parents?",
    "Aint a hit till Nate spit",
    "100% drugs",
    "100% alcohol",
    "100% nudity",
    "100% ass",
    "100% amazing beat",
    "Why would you even attempt to censor this song",
    "I don't know how to say this but Nate Dogg is probably the only person that has bodied Eminem in a song. No diggity",
    "I was 5 when this came out.",
    "Good memories",
    "Why is no one saying RIP Nate Dogg?",
    "I’ll do it for you guys.",
    "RIP NATE DOGG",
    "2.8K",
    "Nate Dogg has the best hooks in Hip Hop history",
    "the artstyle in this video is something i can't explain but it's very satisfying",
    "The song never gets old",
    "when dre leaves the studio for 5 minutes",
    "2.5K",
    "Censoring this song is like trying to run with no legs",
    "7.3K",
    "2024?",
    "The fact that this song still gets daily comments impresses me",
    "R.i.P Nate Dogg (19th August 1969 - 15th March 2011).",
    "1.6K",
    "still listening to this masterpiece",
    "Listening to eminem now.. all his songs bc of houdini",
    "The animator must have the best time of his life while animating this.",
    "4.7K",
    "I absolutely loved this song as a kid",
    "I now realize that may have been odd",
    "5.3K",
    "Man, this is a jam from back in the day.",
    "This Brings Chills Of Pure Vibes",
    "This song never gets old!",
    "4.8K",
    "2005: wtf is this song",
    "2016-2017: meme",
    "2019: damn this songs good",
    "this song never gets old!",
    "I finally found this song",
    "Eminem literaly kills it in this part",
    "2:06",
    "3.5K",
    "Play this at my funeral",
    "This IS going Crazy",
    "R.I.P. Nate Dogg, best hook man ever!",
    "I fucking love the animation in this.",
    "RIP Nate Dogg He Was Snoop Dogg Best Friend, The Best Rapper To Ever Been Created!!!!",
    "I miss Nate Dogg rip brother",
    "2020: Rest in Beats, Nate Dogg.",
    "Rest in peace, Nate.",
    "1.2K",
    "Censoring this is like celebrating your birthday without it being your birthday",
    "All comments fail on this song it’s so hot",
    "this video : sexual violence, drugs, alcohol",
    "youtube : \"demonet-\"",
    "also this video : cartoon",
    "youtube : TAKE MY MONEY",
    "3.5K",
    "Half of the song is just silence due to the excessive moderation.",
    "I just loved  the way super uncut version of this song  shake that by Eminem and Nate dogg",
    "Nate's voice is so deep here, it's insane",
    "Nate dogg:can we say weed?",
    "Eminem:no",
    "Nate dogg: what about ass?",
    "Eminem: yeah sure why not",
    "3.1K",
    "Thank to VEVO for censuring one word out of two",
    "The Game must have forgot about this banger hitting the club... I never will",
    "Maybe the only eminem song that is club worthy. All else is trash talk not for clubbing...",
    "i like how they bleeped out \"weed\"",
    "1.9K",
    "Youtube is gonna make this into kid's content because it's an animation",
    "who's here in june 2024",
    "December 14 is the anniversary of the song “Smack That”, congratulations to you #Eminem",
    "@-fj6qc",
    "14 Years later,if you're watching this you're a legend",
    "6.2K",
    "Still bangs after 13 years.",
    "G.o.a.t",
    "This is why I  Eminem",
    "RIP Nate Dogg",
    "1969-2011",
    "1.5K",
    "Nate Dogg's voice is euphoric, RIP my g",
    "If this isn’t on GTA6 I’ll be pissed off..",
    "2:05 - BEST PART NG:",
    "Nate Dogg's voice is mesmerizing and hallucinating",
    "“And I get more ass than a toilet seat” is such an underrated line.",
    "2.5K",
    "Nate Dogg Rest in peace legend",
    "still love this song",
    "It's ridiculous to censor songs like this. It's fine if it's just one word, but when there is a moment of silence in every single line you just need to deal with it VEVO.",
    "4.2K",
    "\"Yeah, the video's censored.....we can show it at the school assembly\"",
    "True story",
    "1.6K",
    "R.I.P Nate Dogg",
    "14 years later still a masterpiece",
    "Listening to this censored is literally like eating cereal without actual cereal",
    "4.7K",
    "Even when rapping about a stupid trend, eminem makes it cool",
    "normally i never listen to this music but i just have such a strong love for the song. it’s so out of character for me to like this, but i strangely love the song? despite y’know the whole lyrics and stuff, but years later I still remember Nate Dog’s verse",
    "I’m still listening to this on a daily basis",
    "This looks like a rejected Nickelodeon cartoon",
    "5.7K",
    "Never an ad when I click this song. Not even the ads can stop this classic.",
    "3.2K",
    "Least PG hip-hip music video:",
    "Before their was Autotune their was Nate Dogg",
    "I miss Nate Dogg, there’s no other who can sing these beautiful and explicit lyrics like he does!",
    "The combination of nate dogg and slimshady is so fu*kin good",
    "Man RIP Nate Dogg",
    "rest in paradise nate dogg",
    "Why is the animation so good",
    "Papa Bless",
    "1.3K",
    "Forever on repeat",
    "Nate.... A good actor of every moment... Rest in peace Nate Dogg...",
    "R.I.P Nate Dogg today 9 years of his death complete",
    "Finally, some good Christian music.",
    "U are here 2024",
    "As I am very new to business and startup, I would say this lecture is absolutely phenomenal!!",
    "the static in the audio is annoying but the content is so so valuable I really can't complain",
    "I got excited when I heard Michael Scott!",
    "The lecture here is phenomenal",
    "All absolute solution how one known these long before.Appreciate to your kindly acknowlege, sir.",
    "wish you guys included the workshops :(",
    "This is probably a $2000 dollar lecture",
    "Thank you so much Sir",
    "The perfect startup storm 18:27",
    "Great teacher!",
    "More of this lectures please.",
    "Mostly Applauded",
    "Is funnels the same as channels?",
    "Great!",
    "Thank you very much",
    "i'm a regional assistant manager to Michael Skotch",
    "Congratulations",
    "Amazing",
    "i thought she said michael scott.. hahahaaha",
    "Vê é só falar sobre as crianças e muito obrigada por ter te ajudado muito difícil conseguir dormir e muito obrigada pela informação sobre as coisas por aqui mesmo e muitas alegrias e muitas felicidades sempre",
    "please , this college have much cost to buy microphone,, the audio is very important to listen this study, sorry for my bad english",
    "Sound is not good :(",
    "I am from Indonesia,  we start a new start-up,  and we are looking for investor,  Indonesia is the 4th largest in the world,  I can ensure you,  this will be very quite interesting..",
    "I thought I heard Michael Scott",
    "a lot of redbulls opened, thats the secret of harvard students",
    "level",
    "Gem",
    "V se fala alguma é só r e muitas felicidades sempre e muito obrigada por lembrar amanhã às noite e muitas felicidades e muito obrigada por lembrar disso e muito muito muito lindo esse vídeo maravilhoso e maravilhoso né se fala alguma",
    "I am study Harvard school business",
    "Theres no hurry",
    "Harvar need a sound engineer",
    "C BB BB BB BB BB BB BB GG e GG e muito obrigada por lembrar disso é é só falar pro hospital agora estou precisando muito urgente mesmo né mas é muito muito caro e muitas alegrias e felicidades sempre vcs merecem muito muito muito esse",
    "V se for w se for w se fala alguma r viu se fala comigo né amiga é e muitas alegrias sempre felicidades e muito muito muita saúde paz",
    "Graças e valor total e o valor e o valor da passagem e o valor e valor total e o valor e o mesmo valor e o valor e o valor e o valor e valor total entre se ela for lá fora e o valor e",
    "F a noite toda vez no centro pegar um beijo no coração e de um pedido ir no centro pegar a gente vê a hora ri muito forte e a noite a gente se fala alguma novidade de um pedido ir no mercado e",
    "G e as coisas ai sim hein se fala alguma r viu as fotos das pedras aqui fora esperando aqui fora e as coisas por ai sim entendi mas se quiser ir lá só r é é só chamar ele",
    "Gr CV comigo né amiga é só r viu se ele pode ir lá buscar as coisas por aqui mesmo né mas se quiser vir aqui tô esperando vcs estão fazendo oq hj e muito obrigada por ter vindo as crianças estão fazendo oq Deus",
    "G vi agora só amanhã às três horas é só chamar atenção e as crianças estão lindos e amanhã às noite toda hora ri e as coisas ai sim hein se fala alguma coisa e as crianças e os momentos são Paulo e amanhã às noite toda hora ri e as crianças",
    "V e as coisas ai sim entendi agora é só esperar ela responder se fala comigo então é melhor agora mesmo e as coisas por ai Sim hein se fala alguma coisa ER hoje e amanhã às três dias quando chegar lá te mando msg ok obrigada",
    "F xi tô aqui fora esperando ele responder e as crianças se fala comigo e amanhã às noite e boa tarde e amanhã vamos conversar sobre as coisas por ai sim entendi mas é só chamar atenção e",
    "C BB GG GG e GG e as coisas por ai Sim hein se fala alguma r era w se cuida viu se fala comigo e amanhã às três dias quando estiver saindo daí",
    "G vi ele ir amanhã então é só chamar atenção e as coisas ai sim entendi agora é só esperar ela chegar lá te mando mensagem e as crianças estão lindos e amanhã às noite e boa tarde te falo se der certo pode ir ER r e",
    "V se for w r viu as fotos das pedras e as crianças estão fazendo as crianças estão fazendo as coisas por aqui e te mando mensagem ok obrigada pela atenção por causa disso é só chamar atenção por causa disso e amanhã às noite toda vez",
    "G g Du ei e as coisas ai sim entendi agora só r é é é só chamar atenção c BB BB GG GG GG e GG GG e GG GG e as crianças estão fazendo oq hj é feriado é",
    "Parth aaya kya?",
    "HAHAHAHA facebook gave it's core competency away... to a bunch of crooks!",
    "Dribble somewhere else.",
    "this has the worst audio on the platform",
    "he sounds pretentiou",
    "One of the hallmarks of a great teacher is to communicate and disseminate seemingly complex ideas in a simple manner. Professor Martin accomplishes this brilliantly in this video.",
    "1.7K",
    "in summary, strategy involves external elements and uncertainty whereas planning does not. And strategy focuses on preparing to win whereas planning focuses on completing a checklist of work.",
    "1.1K",
    "Clear and concise. For some reason, we've been taught to develop a \"planning mindset\" rather than a strategic one. This short lecture has just unlocked a new worldview for me; a new way of building my ventures.",
    "\"Strategy\" is a tool to respond the challenges of VUCA (volatility, uncertainty, complexity, and ambiguity) environment. \"Planning\" is to improve on best practices. Ultimately, both are essential. Excellent video!",
    "What I have learned from this :",
    "Planning - ' what I need to  do'",
    "Strategy  - ' What are my desired outcomes and how to get there?'",
    "So strategy has a component of goal and process ( how to get there), meaning having a stategy means  you are exercising 'system thinking.'",
    "1.1K",
    "I worked as strategist for more than 10 years, most of which in leading positions, and attended Oxford & Harvard programs on strategy, I read one of the best books in strategy \"Good Strategy/Bad Strategy\", but this brilliant 9 minutes video taught me many lessons in a very simple way. Thank you Prof. Roger Martin.",
    "Takeaways:",
    "1. Strategy and planning are not the same thing. Strategy involves making integrative choices that position you on a playing field of your choice in a way that you win.",
    "2. A great strategy must have a coherent theory, be doable, and be translatable into actions.",
    "3. Planning does not require coherence, but it is comfortable because it involves the resources you can control.",
    "4. Strategy requires putting yourself out and specifying an outcome that involves customers wanting your product or service enough that they will buy enough of it to make the profitability that you'd like to make.",
    "5. You do not control the customers, which makes strategy a trickier task.",
    "How:",
    "1. Start by identifying the playing field you want to be on. Determine where you can win.",
    "2. Develop a theory as to why this playing field is the right one for you to be on.",
    "3. Determine how you will win on this playing field. What can you do to serve the customers on this playing field better than anyone else?",
    "4. Translate your theory and choices into concrete actions.",
    "Imagine:",
    "Think of strategy as a map. The map has to show you where you are and where you want to go. It should also show you the terrain and the obstacles you may encounter along the way. Without a map, you'll be lost, and without a strategy, you'll be directionless.",
    "Why:",
    "1. Strategy involves making integrative choices that position you on a playing field of your choice in a way that you win.",
    "2. A great strategy must have a coherent theory, be doable, and be translatable into actions.",
    "3. Planning is comfortable because it involves the resources you can control.",
    "4. Strategy requires putting yourself out and specifying an outcome that involves customers wanting your product or service enough that they will buy enough of it to make the profitability that you'd like to make.",
    "5. You do not control the customers, which makes strategy a trickier task.",
    "Perspective:",
    "1. Instead of focusing on the activities you want to engage in, focus on the outcomes you want to achieve.",
    "2. Instead of listing a set of activities that sound good, identify a set of choices that will make you win on the playing field you choose.",
    "3. Instead of trying to control the customers, focus on serving them better than anyone else.",
    "What:",
    "1. Focus on a specific market segment and differentiate from competitors.",
    "2. Keep the business model simple and streamlined.",
    "3. Use a clear and concise strategy that is easy to communicate and understand.",
    "4. Accept uncertainty and take calculated risks.",
    "5. Continuously monitor and adjust the strategy based on the changing environment.",
    "How:",
    "1. Fly point-to-point instead of hub-and-spoke.",
    "2. Use only one type of aircraft to simplify operations.",
    "3. Avoid offering meals on short flights to reduce costs.",
    "4. Encourage customers to book online to save money.",
    "5. Avoid booking through travel agents to reduce costs.",
    "imagine:",
    "Southwest Airlines chose to navigate through a less crowded and less risky path in the airline industry. They chose to fly point-to-point instead of the hub-and-spoke model used by major carriers, which is comparable to taking a direct flight instead of making multiple stops. They also focused on using only one type of aircraft, which is like having a specialized tool for a specific task. By keeping their business model simple and streamlined, they were able to reduce costs and offer lower prices to customers.",
    "Case:",
    "To apply these principles and tactics to your own situation, you need to first identify your target market and differentiate yourself from your competitors.",
    "Simplify your business model and focus on one or two key strengths that set you apart.",
    "Use a clear and concise strategy that is easy to communicate and understand.",
    "Take calculated risks and accept uncertainty, and continuously monitor and adjust your strategy based on the changing environment.",
    "Why:",
    "1. Flying point-to-point reduces aircraft waiting time and increases efficiency.",
    "2. Using only one type of aircraft simplifies operations and reduces maintenance costs.",
    "3. Avoiding offering meals on short flights reduces costs and increases efficiency.",
    "4. Encouraging customers to book online reduces costs and increases convenience.",
    "5. Avoiding booking through travel agents reduces costs and allows for direct communication with customers.",
    "Perspective:",
    "1. Southwest's success is a result of taking a different approach to the airline industry and offering a unique value proposition to customers.",
    "2. Southwest's business model is an example of the importance of simplicity and efficiency in achieving success.",
    "3. Southwest's success can be attributed to their ability to continuously monitor and adjust their strategy based on the changing environment.",
    "What:",
    "1. Flexibility: A good strategy is flexible and adaptable to changes in the environment or circumstances.",
    "2. Clarity: A clear understanding of the end goal and how to achieve it is crucial for a successful strategy.",
    "3. Focus: A strategy must prioritize and focus on the most important objectives to avoid spreading resources too thin.",
    "4. Agility: The ability to act quickly and make decisions under pressure is necessary for a successful strategy.",
    "5. Resourcefulness: A good strategy utilizes available resources effectively and efficiently.",
    "6. Innovation: Innovative thinking is necessary to create a unique and effective strategy.",
    "7. Risk management: Risk assessment and mitigation strategies should be incorporated into the overall strategy.",
    "How:",
    "1. SWOT analysis: Evaluate strengths, weaknesses, opportunities, and threats to create a strategic plan.",
    "2. Competitive analysis: Identify competitors, their strengths and weaknesses, and how to differentiate from them.",
    "3. Market segmentation: Divide the market into groups and create targeted strategies for each segment.",
    "4. Branding: Develop a strong brand identity that aligns with the overall strategy.",
    "5. Differentiation: Identify unique selling points to differentiate from competitors.",
    "6. Marketing mix: Use the 4 Ps (product, price, promotion, and place) to develop a comprehensive marketing strategy.",
    "7. Continuous improvement: Regularly evaluate and adjust the strategy to ensure it remains effective.",
    "Imagine:",
    "Think of strategy as a roadmap to your destination. Without a roadmap, you may get lost or take longer to reach your destination. However, if you stick too strictly to the roadmap, you may miss out on more efficient or scenic routes. The key is to have a flexible plan that allows for detours and adjustments as needed, while still keeping the end goal in sight.",
    "How:",
    "1. Identify your goals and objectives",
    "2. Evaluate your strengths, weaknesses, opportunities, and threats",
    "3. Identify your target audience and segment the market",
    "4. Develop a unique value proposition and differentiation strategy",
    "5. Create a comprehensive marketing strategy utilizing the 4 Ps",
    "6. Continuously evaluate and adjust the strategy as needed",
    "Why:",
    "1. Flexibility allows for adaptability to changes in the environment or circumstances.",
    "2. Clarity ensures a clear understanding of the end goal and how to achieve it.",
    "3. Focus prioritizes and maximizes the use of resources.",
    "4. Agility allows for quick decision-making and action under pressure.",
    "5. Resourcefulness ensures effective and efficient use of available resources.",
    "6. Innovation encourages unique and effective strategies.",
    "7. Risk management assesses and mitigates potential risks for a successful strategy.",
    "Perspective:",
    "1. The importance of understanding your target audience and creating a targeted marketing strategy.",
    "2. The role of innovation in creating a successful strategy.",
    "3. How to balance flexibility and focus in a strategic plan.",
    "4. The impact of risk management on overall strategy success.",
    "5. The benefits of continuously evaluating and adjusting the strategy.",
    "I could listen to this guy speaks for hours about business",
    "I've never heard a simpler and illuminating explanation of the difference between strategy and planning, thanks a lot for sharing!",
    "I can’t believe this invaluable",
    "lesson is accessible to many at virtually no cost. Roger is an excellent speaker. Incredible work",
    "Being an academician, this video precisely describes the difference between Planning and Strategy. A great resource for me to share in class. Than you Prof. Martin.",
    "I'm a Strategic Planning Director of one of the leading advertising agencies worldwide for many years. But this short, sharp, crystal clear definition helped me a lot, even after more than 24 years global expertise in the industry. THANKS Roger Martin for sharing this masterclass.",
    "I've been working on EPM (Enterprise Performance Management) for a few years now, and I find this disconnect between strategy and planning quite often. Fantastically well summarised in this video. Loved it.",
    "This is pure gold, thank you.  I have been trying to articulate for months why I think our strategy is not in fact a strategy but have never been able to put my finger on it.  Now I can - we have a plan, not a theory.",
    "this guy is a genius....and then ppl wanna complain they cant do anything when this is literally free...this lesson alone can help your business get to 100k/year...",
    "I was reading and watching about strategy more than 14 years. This video completely revolutionized how I saw it. Now, I can think strategically. Thanks Prof. Roger Martin",
    "This is absolutely gold. Every organisation I have ever worked for/with needs this priceless 10 mins.",
    "Before I started my business, I kept asking myself what I could offer that could not be easily achieved by my competitors. I believed I had found my 'iron bowl', so I built my business around it and never looked back. I haven't paid much thought to it since, but looking back, it was definitely the most impactful decision I've made. I could've EASILY been just another fish in the sea.",
    "That said, I'm a chronic planner. I love finding ways to plan for things that normally don't need plans. Coming up with a strategy was just a part of my business plan.",
    "Wow! Strategy focuses on desired outcome, acknowledging the angst that while the outcome is out of our control if we lay out our logic and are willing to tweak it we increase our chances at winning",
    "This is better than attending a Harvard MBA class. Brilliant lesson! Thank you Prof. Roger Martin!",
    "Watching Roger Martin's video on strategy is like having a private session with a world-class strategist. His insights are so clear and practical, yet profound.",
    "If you are in a mad hurry, pick up at 8:27 and hit the mind blowing summary with a drop-the-mike ending! Plan for the win. Don't plan to be busy. These are worlds apart, and this video is a very thoughtful dive into the difference.",
    "A guard at the gate to my home gave me this lesson when I was young. Life-changing insight.",
    "In many ways, this is similar to the difference between Waterfall and Agile style of project management. Planning for comfort or Strategising for wining. Very Insightful.",
    "I know this is supposed t be about winning and losing in the corporate world, but it rings very true for personal goals and life in general. Further, it seems remarkably sane, without all of the flailing busywork and failed promise often associated with \"planning\". I am retired and have been wrestling with goals and dreams for the rest of my life. This video makes so much sense, keeps things simple and is reminiscent of Occam's Razor: the simplest, clearest answer is often the correct one. Unlike most of YT and the Net, this was very useful. Thank you.",
    "I’m not sure why this video was recommended to me, but it resonates with my work. I’m an instructional designer who used to be a curriculum designer, and I always explained the difference as curriculum design (CD) being the “what” and instructional design (ID) being the “how”. What I will say now is that CD is the plan and ID is the strategy. Thank you!",
    "Incredibly well said and I love how you point out that it should feel uncomfortable. Even working for an internal department where our only customer is the business, strategy is still about how we organize as a group of people to deliver value. Planning is figuring out how we're actually going to execute those things. Too often the strategy step is skipped completely.",
    "Most managers don’t know the differences between strategy, tactics, operations, logistics and diplomacy. Of course you plan for each; you do so in a way that is integrated with the other elements, often changing along the way depending on the situation and new intel.",
    "Love this.  It has saved my career.  I was now feeling like \"no\"one can hear me.  Cause I have been of the mindset, that one needs to give themselves and their business the best shot possible and that is scary since it is extremely speculative, yet it is more of something to trust and believe in......as this video suggests, that is strategy.....My confidence is back..",
    "I think another feeling while doing the strategy is excitement. The feeling when you actually see that there is a possibility of winning!",
    "Amazing video btw! Thank you",
    "100%. I seem to have spent most of my years in senior management - commercial and non-profit - fighting against the fudge of \"strategic  planning\", which results in neither strategy nor planning being done well, let alone in harmony. In particular, for non profits, attention to strategy shines an essential light on the organisation and its purpose.",
    "I suggest that many non-profits tend to systematise themselves from the bottom up - as they develop from the first simple, informal \"let's do something about this\" initiative into a more structured, long-term organisation. Each layer of organisational thinking - planning (including OD), strategy, mission and up to vision - tends to be considered and added only if and when the status quo becomes blatantly unmanageable or problematic, or if it is demanded by a board or funder. As a result, these are seen not as fundamental building blocks for an effective organisation, providing essential focus and clarity internally and externally, but as unwelcome, time-consuming chores, diverting energy from the organisation's real business. And inevitably, working from bottom upwards throws up many instances where the sum of the parts does not add up to a coherent whole, yet there is no higher logic by which to order the parts better or broker objectively between competing local interests.",
    "Making the time to stand back, and to consider and develop these layers of organisational thinking from top down - ie the other way, strategically  - is possibly one of the most valuable things a non-profit can do to ensure its sustainability. It enables organisations to be as clear about what they don't do as about what they do (so helping avoid mission creep). It crystallises the \"hymn sheet\", giving the whole team a common understanding and language, and the brand the power of consistency. Each layer, if done properly, provides a powerful overarching logic for decision-making at the layer below it, making the whole process faster, simpler and better.",
    "Wow. Not gonna lie, when the video started I was like \"this isn't what I'm looking for, I need to know how to write a strategy\" but this video is a nice nugget that helps put all the other videos I watched into perspective.",
    "Winning Mantra in a nutshell. My takeaway is @9.6 to @9.26 . Never found such a super simplified version of Strategy. Thank you  Prof. Roger Martin!",
    "Thank you sir! A lot of people are so set in their ways that they will not change their attitude to strategy. They are so well versed in the practice of  this their \"strategic planning\" and also well rewarded for their expertise in it by their organization that it would be business as usual. That leaves plenty of opportunity for disruptors. More for me!",
    "As a startup, this was incredibly helpful! Thank you for guiding us to look further than the checkboxes.",
    "This is a fantastic presentation by all standards. Thanks to the internet for the things we learn from professionals from several miles away.",
    "This has been coming up into my feeds for several days and I thank God that I finally watched it. This is quite interesting and may serve as a reflective reference point after I adjust my strategy. This is good stuff!  This bless.",
    "Wow - this is one of the best lectures I've heard in a long time.  I had never thought of strategy v. planning.  I learned a lot.  Thank you!",
    "Explained in such a simple manner that leaves no ambiguity in our minds. Thank you!",
    "Roger Martin is an excellent communicator. This breakdown of strategy vs planning was explained without any buzzy jargon and packed full of useful information.",
    "Don't know how this video popped up in my suggestions but it definitely gives me clarity in the most simplest way for me to be successful in all I do. Thank you!",
    "I have never heard this sharp an articulation of strategy as this. The way Prof Martin has explained this is incredibly clear and helps understand the difference between playing and winning.",
    "Excellent lecture of Professor Martin! Simple, clear and objective.",
    "This makes sense, I always had that theoretical mindset of doing things which turns out to be the strategy.. But always people like to see planning which is just steps to take to do things to accept your ideas. This explanation has confirmed my own understanding of what strategy is, and the final part where he said it should be short makes even better.",
    "MAN! The idea that angst, doubt, reliance on the unknowable and the always present chance of failure are unavoidable components of a successful strategy is probably the most understated piece of advice I've ever heard.",
    "The amount of anxiety and confusion caused by trying to turn your strategy into a fool proof plan has morphed for so many into hopelessness and stagnation. And belief in that false concept has given nay-sayers the fuel they needed to stomp out many a dream.",
    "I am an incessant maker of to-do lists, so naturally, the title of this video piqued my curiosity. This is wonderfully informative. What excites about it, is that I can see it being hugely useful not only for a business, but also for an individual attempting to realise personal goals.",
    "In a past life working at a corporation they’d run us through multiple classes run by consultants. Several times these consultants encouraged us to “think outside the box” when we tried that management quickly shut us down. It took me a while to understand that managements job was to minimize risk even though those actions reduced profitability and sales",
    "This is a great presentation, thank you.  It fits along with the concept that if you're not incurring some risk, you're not going to win.  Or to extend that, if you're only managing the expense side of a business, you're eventually going to lose.  It's a slow downward spiral to lowest cost for commodity production, at best.",
    "I saw someone saying this was their favourite HBR video. For me it's not just HBR, it inspired me so much, this is my favourite video EVER. Watched it 3x already to engrave it into myself and will probably do it a few more times :) Thank you for this amazing content",
    "You just freed my mind to explain a strategy I’ve developed but have been unable to articulate succinctly! Thank you for making this video!",
    "Well presented, easily understandable difference between strategy and planning using great examples.  Thank you!",
    "This was absolutely great! I am about to start a micro-manufacturing business. A single-page strategic outline will help me to both explain to people what I want to achieve AND manage the progress with an eye toward our end goal. Thank you so much! Tim",
    "The simplicity of the video title drew me in and I went away with a clear understanding of the two. Thank you.",
    "explained in 10 mins better than 10 books on strategy, thank you!",
    "That’s the best video about strategy I’ve seen in years.",
    "This is my favourite HBR video. I finally understand the difference between strategy and planning. Excellent explanation with practical steps, thank you!",
    "One of the best Leadership related videos I've seen this year! Brilliant! Thank you!",
    "My takeaway : Strategy gives you skin in the game, it is long-term and sets you on a path for iterative plans over a duration of time. Planning is post-natal care that leads to Implementation of strategy.",
    "I’m not even into businesses and entrepreneurship or any related field but I learnt so much from this. Tragic we don’t learn something like this in school.",
    "I was taught that strategy is one or two simple concepts that the whole team can understand and apply, which will help get them into a better position to ultimately win the game. But in an open game of business or life, these can be the mindsets that help you and the team to get to the next better position of opportunities.",
    "Currently studying for my MBA and believe there needs to be more clarity between strategy and general analysis. Great to hear someone who has the same idea. I believe I will be referencing a lot of Roger Martin's work for the remainder of my master's.",
    "Many thanks!",
    "I love how he broke this down to small-sized bits and also his relaxed tone, I didn't know when I watched it 3 times over. Love it!",
    "When I was in college in the 90's, strategic management and planning was my favorite course and the one class I got the most out of in college. It explained these concepts in this video. What was so troubling that 10 years later, I would listen to all these supervisors, managers, directors, execs, and other higher ups literally talk planning as it was suppose to be their strategy. Even now, I cringe when I hear a Director or other higher up discuss their plans as if they strategies.",
    "My most frustrating higher up I had was someone that insisted that we, as employees, had to memorize our departments principles as part of some kind of strategic plan. To say the least, I kept my head down and basically hid from the guy his entire tenure because I wasn't doing it and it was a pure waste of my time.",
    "Mr Martin is right to separate the \"why\" from the \"how\".  Too often there is insufficient thought and explanation of the \"why\".  However he needs to recognise the \"why\" won't be achieved without the plans being put into place and delivered.  I would suggest that rather than creating a disconnect between strategy and plans it would be better to explain how plans should be better linked into, and supportive of a well thought and articulated strategy.  In short plans needs outcomes not just objectives and the control process should be monitoring for the delivery of the outcomes - providing action management to ensure the plans support the strategy.  In my experience it is the implementation of strategy where failure occurs rather than the strategy itself.",
    "This is an exceptional video right before a huge meeting I have tomorrow to talk about our action plan to create a Go To Market STRATEGY... not a PLAN.  Thank you so much for this.",
    "\"Strategy gives the best possible chance of winning\", what a closing statement. Thank you Prof. Roger Martin.",
    "If you do strategy it gives you the best possible chance winning - this was the line that wished was told in class",
    "Thank you for this video. As someone who is a natural planner and comfortable with that I was always shocked by the outcome because not everything went to plan. I realized now that affected me in the workplace because I was just focused on the job on not the bigger picture. This helped put things into a different perspective as I look for employment. Thank you so much.",
    "Very very insightful comments about the difference between planning and strategy.  I have often wondered why when I plan things, it often doesn't happen, but when I just do it without a plan, I am able to make a difference.  I have felt a plan is a nice to have rather than a requirement.  Prof Martin's talk has made me realize why this is.  Actually, a plan is a good thing, but it is secondary to a way to win in what we are trying to accomplish, be it clean up an out of control room in one's apartment to starting a new company.  Many thanks for this great talk.",
    "Best ending for an academic video with inspiration",
    "Absolutely loved this! Will be using this as a topic of discussion for my class tonight!",
    "Interesting, since I face this regularly at work. Another word for strategy is vision and that is where it is often missing. Plans can also be synonymous as procedures and this always mires people who are either not observant enough or brave enough to break out of it.",
    "You combine the two and most workplaces have leaders that do not provide a vision and / or strategy while the people on the front lines are only planning within the procedures rather than exploring new options. Resulting in companies that slowly repeat mistakes or failing practices until they can no longer sustain themselves. Blockbuster comes to mind.",
    "The most simple way to learn the distinction and the most deep fundamentals at the same time",
    "Brilliant! Thank you for explaining this so clearly and briefly. This is WHY people always fight me in this. I have always completed this process as a thing that I simply do. Every time I shut up and do it, it works. Every time I ask people's opinion they confuse me and I fail. I have been doing this since I was a little kid, even with the smallest things. I subsequently found out that it had a  lot to do with my cognitive stack and how I prefer to think. It is something that I do naturally. I'm very thankful to have this skill! ️",
    "Strategy, as the esteemed professor explains, may have some external variables while planning is mostly involved with internal set of actions. All strategic actions will require planning  but not all planning need strategy , I guess :)",
    "The military makes this much simpler. Strategy vs tactics. Both are important. Strategy is long-term and tactics are short-term and more situational.",
    "That man just explain something I wasn't able to understand in 5 minutos! I can't belive it!!!! Thanks you for \"landing\" this two concepts",
    "Thank you very much Professor, people can't do things that excess their abilities while they just start a safe \"plan\". I have to win in my stage. Mind, Creativity, Logic, Implement.",
    "This is just brilliant!",
    "Thanks a lot HBR and Professor Roger Martin. Great piece of knowledge!",
    "That was a fantastic explanation! Thanks HBR!",
    "I think I need to retool my brain to thinking strategically rather than planning, despite the fact I’m not a manager. But one day I hope to go into management and this idea of strategy will help.",
    "this video is one of those, that really changes my world view and helps to understand, why i am failing so much. Of course, i knew differences of strategy and planning as words or concepts, but it appeares that i didn't know what it really means. So as i understood -  strategy is when you exactly know what do you want and pretending to know how to achieve it, so it includes possibilty of reaching the goal or failing. And planning - is like a poster on the wall, they just makes you feel different, whenever you're looking at them)",
    "Strategy is the specifics on why and the how to implement the long term plan. Love it!",
    "I appreciate this excellent bite-size video which is much better than attending a whole year-long MBA class. So clear and easy to absorb and understand. I particularly love the idea of accepting the angst as this is the hardest point I used to convince the management when I challenge them. We need a strategy, not a plan!",
    "This is a great lesson to us all.  It's certainly made me think how I am taking things forward with more of a strategy, than a plan!! Thank you.",
    "Thank you! Straight, short, clear and encouraging explanation.",
    "This is one of the channels that gave me the courage to start my YouTube channel 9 months ago about self development. Now I have 1,7444 subs and > 1k hours of watch time. I know it’s not comparable with others but I’m still proud I started because I’ve been learning so many lessons that I could haven’t learned without getting started in the 1st place.",
    "Strategy is a roadmap or plan that establishes your goals and the actions or steps needed to achieve the end goal. These guiding principles should be shared throughout the organization to help your company reach its objectives",
    "This is so good. So basically, in other words, planning is about designing/creating something (which might end up being not what you really want) while strategy is about navigating towards what you really want. I feel like planning is a bit more distant from reality than strategy.",
    "Indeed. It comes down to carefully looking at the seven aspects of business that enable a business to be purposefully understood. For each of the aspects there are four questions to ask: what are the facts; how are they unique; what could that uniqueness mean for future value creation; and what do we expect/want in the future. Effectively, what Roger Martin says comes down to integrating what you learn at business school in one case-specific thought exercise. Essential stuff.",
    "Brilliant just brilliant ️ in 6 min you cleared my entire thought process. I consider myself to be a brilliant planner but over time I have stopped relying on planning, as I came to the conclusion it is the random nature of world which makes most plans fail. And since I dropped a fundamental belief of my life( Planning is good). I have been struggling with conflicts of within myself. I watched this video twice just to have a more intense exposure to what you were saying. Just bought your book on audible. Thank you",
    "What a masterclass! I feel much more prepared to be working in HR and corporative culture after that, like I finally know what to cultivate.",
    "Avoiding the planning trap is interesting. So many founders get stuck due to the angst you talk about! \"You can't prove in advance that a strategy will succeed.\" Well said.",
    "so well explained with simple words and example. thank you for the clarity. what a great start for 2024",
    "Such an informative video",
    "I will start applying more strategies in my life as opposed to plans",
    "Thank you",
    "thanks for this!!! i'm in the middle of writing 3 books at the same time. it feels much more like strategizing and much less like planning. I'm constantly adjusting details and making sure the characters' choices fit the strategy. or i guess the head canon in this case. and this definitive separation of strategy versus planning is actually really helping me work out those kinks. so thank you!!!",
    "A very simple way of explaining the difference between the two as well as making it abundantly clear what makes some successful, while others are busy and content to be running in a hamster wheel",
    "Excellent video! I especially like the SouthWest example after the recent catastrophe they suffered with over 90% of their flights being cancelled due to weather and their unique flying system. I think it really illustrates weighing the risk and reward of building a strategy.",
    "There is a simple test I teach my people to see if something is really a strategy: What is it sacrificing ? Trying to do/achieve/improve many things at once is probably not a strategy.",
    "Based on this video, I think strategic planning is a thing and it is possible. The challenge is that many are not implementing the way it should be done. I've studied, taught and most importantly, been involved in strategic planning with a multi billion dollar company and it works. Strategic planning is like a combination of both strategy (the thought, vision) and planning (for execution). Strategy also includes reviewing the results obtained from the execution of the plan and putting measures which primary includes  problem solving techniques to guarantee improvement and growth.",
    "Strategy in and of itself may not obtain as much results as a well developed and implemented strategic plan. The good news about a strategic plan is that it is a living process that evolves with time and experience.",
    "Huge respect for Prof Martin",
    "Great points. Sometimes, people run straight to planning before identifying the \"why\" and \"how\", as an organization. I concur, that strategy is the basis of thought which leads to great plans of action ,and moreover, reduces uncertainty. By considering the current state of business, it's capabilities and/or the best applicable approach, realistic and desired plans can ensue.",
    "I find this to be a matter of semantics of language in my opinion. Everything described as strategy can still be called planning and it still works out. The point is making the appropriate set of decisions and actioning on them.",
    "Funny that this video is recommended to me now as I’m writing my team’s plan for next year. My manager asked me for a “strategy plan,” and I immediately separated the two concepts in my template. Great video with one exception: Southwest never used an A330",
    "This was some of the best information about business I have ever seen. Thank you for this!",
    "Pure wisdom, this! Reminds me a bit of Daniel Coyle and The Talent Code, working through the discomforts of uncertainty sets you free! Withdrawing from those opportunities to be \"uncomfortable\" only trap you into things like procrastination and failure.",
    "Great lecture! This can be applied to so many other areas of life other than business or accelerating airtraffic!",
    "Very simple yet comphrehensive. Thanks for providing clarity on plan and a strategy. I am sure there are many things that we have to un-learn and re-learn in the right way.",
    "The information provided is first-rate. Thank you. It is critical for a business to grasp the difference between having a plan and having a strategy.",
    "thank you, prof. Roger Martin. This video is the best way to explain the difference between strategy and plan. Now, I know why I always do the planning, not the strategy, because it was controllable but not guaranteed to win the competition.",
    "a plan is blind without a strategy, but a strategy cannot be implemented without a plan. strategic planning is not a contradiction, it is the first stage of a proper planning process.",
    "Thank you. In my business career, I've only seen \"strategy\" slide decks that were actually tactical plans, as you say. Hardly anyone understands strategy in business, even successful business people often succeed by chance/luck rather than strategy.",
    "This video is a blessing. It is timely. I am a planning fool, but I need a strategy for what I want to do going forward. Thank you. God bless. New subscriber.",
    "Strategy is the main goal and it has a philosophical meaning and to achieve this goal it must be built on small short term plans and maneuvers and responsive with current position , and to make these plans done perfectly you must have skills and tactics about your field whatever it is .",
    "Strategy is how you want the market to behave for you",
    "Planning is how you get the market to behave in said way.",
    "I've been hearing \"strategic planning\" for quite some time, and I get confused each time, thanks a lot for this video it is insightful!",
    "while im not familiarized with army practics nor language, ive heard a tiny bit about it. One thing that ive heard is that, on the battlefield, there are 3 aproaches. ive known about this in spanish, so i hope that the translation of the terms will not have what is called \"false friends\". My english skills are not very good either.",
    "So, after this introduction about my lack of knowledge on both fields (army and english language), this is what i heard:",
    "by one side you have the tactics. the tactics help you to win a position or a battle: you have your resources, your weapons and men, your logistics, you try to win your enemy and after the struggles, you succeed. thats about tactics.",
    "The second concept is the strategic level: what do you want to get and how will you try go get it. Which are your goals and how the planning of the tactics level helps you to obtain your strategic position in order to win the war.",
    "both are in the video. And, indeed, a plan is not a strategy. sometimes you should know what is important and what is not, and while on a plan could seem easy to win a battle due to the tactics, the strategy may recommend to not to do it and to follow a different path.",
    "but there is a 3rd element: the operational level. Is the one that connects the strategic and the tactic levels. it seems to consists on obtaining and put together all the information (history, resources..) and on thinking not only on the next battle or the next position you want to take in order to gain a strategic advantage, but also on how the things will be then, when you'll have reached that point, and then be prepared for that too and also for what will come after that until the victory. Planning not only as how or when you are gona make this and this following a plan, but also as layers, as phases, for when as a result of your actions the environment will have changed, your strategic goals are still far away and you need to make a new plan. have those different plans ready, layered and focused on your strategic goals is the operational level.",
    "according to the operational level you may use your resources on a different way that will change the tactic level and may change also the strategic, while you think on a deeper aproach that may reduce your loses because your planning is on a different scale. As example, to avoid a full frontal attack and choose to break the enemy line instead, going behind their lines and targeting their logistics and their headquarters (while you may make and encirclement movement, but that wouldnt be the main point), because you dont only think on defeating the enemy, but also on how the things will be when this will happen and how to be ready for that.",
    "i hope that my limited knowledge of english will not be an impediment for the understanding of my arguments.",
    "Strategy: WHY you wanna do it",
    "Planning: HOW you are going to do it",
    "If I may, I would add that a \"strategy\" is a translation of a mission statement. It's the first empirical, and practical, means of designing the work needed to achieve the goal.",
    "Planning, I'd say, could be seen as a more responsive measure to approach external factors or circumstances.",
    "Mission Statement: To bring peace",
    "Strategy: To overpower the enemy",
    "Plan: To attack from all sides",
    "What a terrific, bold and accurate video. Kudos Mr. Martin.",
    "This is great!!!! Thank you, Professor Martin.",
    "More explanation is required, please upload a new video, please",
    "This was amazing. I wish I’d studied better in high school so I could have attended a school like Harvard",
    "Important ideas communicated with incredible clarity",
    "This is the best video explanation on Strategy. We have got it wrong all these while. I’ve watched this for at least 10 times.",
    "the video is unclear about where planning \"is\". Is it at the strategical level? in the sense, how to plan for defining the strategy (which initiative shall the organization do to achieve advantage), i.e. portfolio of products/services, etc. OR at Executing level, planning how to execute the strategy? Programs, projects, procedures, operations, etc. Its different",
    "Plans don’t get you rich, strategies do.",
    "Mr Noud Mikan said a good binary trading strategy will simply much of the decision making about where and when to trade, with TIMING the key to everything where trading is concerned, the less guess work there is around entry and exits points, the better. Particularly for less experienced traders….",
    "Just discovered this channel. So many good content. Thank you!",
    "Very, very smart presentation.   Way too many planners out there in management, not nearly enough strategic thinkers.",
    "This guy has a plan.",
    "All was going fine until the point the professor said at the end that “if you plan, that’s a way to guarantee losing…”",
    "If the strategy covers the  What, Where, How, When and Resources and then monitor to tweak and improve, this is in my view is nothing but Planning…so planning is way to translate strategy into execution to achieve the strategic objectives and goals.",
    "On the ground, organization would need to understand the corp strategy starting from the Why, but without breaking this down to a simple and phased plan one would run a risk of keeping strategy as a theory that is not executed, or at best slow and unsustained performance…in my humble view.",
    "That’s why I disagree with the statement that “if you plan that’s a way to guarantee losing”",
    "With all due respect",
    "Sir…your words are brilliant..went deep inside of my heart",
    "Simply Seamless and Brillant. Thank You!",
    "PLAN: “Here’s WHAT we’re going to do to gain or accomplish x.”",
    "STRATEGY: “This is HOW we are going to do it!”",
    "The type of “planning” that this video refers to is not planning, but “bad planning”, or a raw todo list. You have to ask yourself “why” and “how” you are planning your activities, you have to have mechanisms that allow flexibility and welcome unknowns. Planning is strategic by nature, otherwise it is not planning. The title just plays with words.",
    "This is a very good and simple edit.",
    "Focused on words and easy editing.",
    "Mature content delivery from the title, to music to editing to font choices all matters.",
    "Keep up the good work.",
    "Thank you for sharing.Sometimes ideas you just shared are just enough to trigger another person to formulate another idea that might make our world a better place.Again thank you.",
    "Southwest needs a new strategy because their plan failed.",
    "fine, everyone has a STRATEGY, until they get punched in the face.",
    "Awesome video on plan vs strategy. Clear and concise for anyone. There's a lot to think about here.",
    "A strategy is how often it can accept changes due to market conditions; and still can win!! ~ Very Difficult for novices but not an issue for Matured Players.~ I like your style of explanation.",
    "Brilliant. Simple, yet well laid out.",
    "This is an incredible video. Brilliantly articulated. I'll remember the name Roger Martin. Thank you Professor.",
    "Excellent lecture of Professor Martin! Simple, clear and objective.. Excellent lecture of Professor Martin! Simple, clear and objective..",
    "Great video and great explanation. Thanks for sharing",
    "Once before this I tried to understand the difference between these two terminology. But all was in vain.",
    "Now Prof. makes me understand the incredibly simple way.",
    "Thank You!!! I’m so happy I found this video.",
    "This is really clear! I can see it on a whole different level now.",
    "Sooooooooooo all my life when I was sure I'm planning, I was actually STRATEGIZING! Wow! Such an easy way to feel pro!",
    "Fantastic video! Incredibly helpful.",
    "This is amazing! Very clear Thank you",
    "Thank you for the lesson, :) I appreciate it. You seem kind. An admirable quality.",
    "Well said. I like the point about strategy helping a company deal with external forces: competition, customers, and the environment (or board you choose to play on).",
    "Thank you for the great video! Concise, and to the point!",
    "Thank you, this was so helpful in getting clear on my business.",
    "I learned more in 9 minutes and 28 seconds than in most business books",
    "This is a beautifully articulated idea and certianly food for thought. Thanks!",
    "The very essence of winning strategy is competive advantage. It works like a silver bullet: it permeates the whole organisation.",
    "This is an amazing lecture!! It clears many things.",
    "Martin & Lafley's Playing to Win framework is the clearest approach to defining how you will to go to market.  As Roger says all about making choices - what you will do and what you will not",
    "this was very eye opening and couldn't have come to me at a better time.",
    "thanks",
    "Just freakin excellent!  This is the best and most clear description and difference between strategy and execution.  Excellent timing....  I'm renewing my subscription to HBR.. Thank you!!!!!",
    "1:12",
    "Did somebody notice he used \"integrative set of choices (connecting choices in the future )\" instead of \"integrated set of choices (connected choices in the present)\".",
    "1:35 coherent means integrative.",
    "1:40 planning does not have to have such coherence.",
    "1:54 there tends to be a list that has no internal coherence to it.",
    "2:00 and no specification of a way that is going to accomplish collectively some goal for the company.",
    "2:13 plans typically have to do with the resources you are to spend.",
    "2:25 those are all things that are the cost side of the business.",
    "2:46 a strategy specifies competitive outcome (instead of competitive advantage) which involves customers wanting your product or service.",
    "3:08 tricky thing about that is that you don't control them.",
    "Really brilliant, big thanks for posting this!!!!!",
    "This reminds me of those big brother review videos where someone analyzes the winner’s strategy for out tricking the other players. I kept wondering how these people did it, how they came up with all these tactics, but now I realize that they strategized, and that makes all the difference.",
    "I love this! So straightforward. I also find his voice comforting.",
    "Extremely insightful, an invaluable lesson and useful business resource.",
    "I’ve read your book. The strategy model you’ve created is outstanding and break from the traditional models out there. Easy and straight forward. Thanks Roger :)",
    "This was a great video. Thank you.",
    "A succinct and focused approach to explaining what Strategy means to a company and its importance to defining the rationale for the existance of any business.",
    "This is an absolutely great way of explaining strategy.",
    "Thank you for teaching me the difference between strategy and planning",
    "Thanks for the explanation, because in the day to day is easy to confused both terms; in fact, in my actual work I don't see a difference.",
    "Thank you! Really interesting, simple and clear",
    "In my view sir has developed a different Types of strategy from Grass root observation.I feel nothing Wrong.... Profitability is important from his long experience related to plan v/strategies.Vry Amazing nd Inspiring vdo lecture.sincerely appreciated for new idea.",
    "Fascinating perspective. Thank you. I think I must keep this as a favorite to watch a few times.",
    "Wow. This is an incredibly important fundamental concept. Great video.",
    "Roger Martin, master of the masters!!",
    "\"Planning is very comforting\"... This explains why so many leaders keep going in circles revising their \"strategic plans\" Vs. doing what will really make a difference",
    "Thanks, your way of explaining was epic.",
    "Really excellent video, clear as water!!! Thanks for share.",
    "So I'm finishing up my Masters course on Strategic Management and as I communicated to a classmate I felt as if I was trying to decipher an Egyptian Hieroglyph, I wish I had watched this video at the beginning of the semester!",
    "Insightful and helpful to improve my views about Strategy. Worth a watch!",
    "Thanks for presenting this learning opportunity.....",
    "Great video, you shared a clear message about what strategy is",
    "Thank you",
    "Great video! Thanks for sharing!",
    "Thank you so much for this amazing lesson!",
    "WOW! This one video earned my subscribe. It really helped with perspective.",
    "thank you for sharing that idea. I really appreciate it. This is going to be realization soon to be rewarded.",
    "Awesome explanation.",
    "Beautiful explanation of how REAL entrepreneurship works.",
    "Very informative, plenty take aways.Tahnk you.",
    "That starlapse video you got from filming in your backyard was amazing!! I have this camera and I never knew about the starlapse feature",
    "That was pretty wonderful advice with wide-ranging applications.",
    "Thank you a lot for this video. This is very interesting and informative. Keep posting like those amazing videos, this is awesome.",
    "Fantastic explanation. So clear. More please! :)",
    "God bless. Thank you for clarity",
    "Man, I love this, thank you for opening a new vista",
    "Clear and concise. For some reason, we've been taught to develop a \"planning mindset\" rather than a strategic one. This short lecture has just unlocked a new worldview for me; a new way of building my ventures.",
    "\"Strategy\" is a tool to respond the challenges of VUCA (volatility, uncertainty, complexity, and ambiguity) environment. \"Planning\" is to improve on best practices. Ultimately, both are essential. Excellent video!",
    "Wow - this is one of the best lectures I've heard in a long time.  I had never thought of strategy v. planning.  I learned a lot.  Thank you!",
    "This is my favourite HBR video. I finally understand the difference between strategy and planning. Excellent explanation with practical steps, thank you!",
    "This is so good. So basically, in other words, planning is about designing/creating something (which might end up being not what you really want) while strategy is about navigating towards what you really want. I feel like planning is a bit more distant from reality than strategy.",
    "This is the best presentation on how strategy differs from planning. Strategy is about winning when it comes to market share, being better or differentiated for the competitors, etc. Planning is how to get things done.",
    "At the end of the day, if your activity does not involve competitors and winning it is not strategy.",
    "Brilliant explanation Prof. Martin.",
    "Great content. Thank you. I am going to share this with my team.",
    "Top-class and honest video content, in terms of strategy theory I suggest adding What to the important Why and How components",
    "Lightbulbs!! So great! His strategy worked!",
    "Enticing video! Thank you for sharing in a simple and clear manner! As a teacher I emphasized the cornerstones of a strategy in my professioanl field!",
    "So insightful. Thanks Prof...",
    "Brilliant classes, thank you",
    "Well explained: Succinct and to the point. Thank you for this.",
    "Great video not only for business but life as well!",
    "Thank you very much Sir.",
    "This content is a very appealing way to form a view of the world. It's contradicting to itself, intellectually tricky, full of one value judgments defined by other value judgments, useful in explaining past success of an airline company success (without providing a proving reference to what that airline company \"strategists\" actually had in mind and whether it was anything theoretically close to what this host is presenting in this video)... but still is very appealing: scripted well, shoot with a good camera, presented in a solid way (whatever that means). I especially liked this cool definition of strategy which, when simplified goes down to \"<something> that leads you to success, but maybe not\".",
    "Very helpful... thank you, also for the example.",
    "Excellent and eye opening of as presentation!",
    "This is soooo insighful. Thank you.",
    "Thank you. I've been stuck in the planning loop...appreciate pointing to a way out.",
    "This video was excellent! Thanks",
    "hanks lot Sir.. You helping us..",
    "Very good description of what most businesses are struggling to get right!",
    "My geometry teacher in high school always said to never study always prepare. Therefore I don’t believe in plans.",
    "Why does every straight man think Ryan Reynolds is the hottest man on the planet, I wanna know the psychology behind it.",
    "the boys not getting defensive about finding men attractive. so so refreshing.",
    "I love the \"bisexual.. for now\" energy lmaoo",
    "4.6K",
    "‚ÄòThere‚Äôs always room for gay improvement‚Äô is honestly so motivational",
    "\"I just don't like penises. And from the girls that I've talked to they don't like them either, so maybe I am gay.\" I loved that.",
    "\"When did you know you were straight?\"",
    "How the tables turn",
    "\"do I want to be that pretty girl or do I want to be with that pretty girl?\"",
    "most relatable thing I've ever heard",
    "as an ace teen person it‚Äôs so cool to see some of the teens say that they‚Äôre ace too since it can be isolating to identify as asexual when ur a teenager and it seems like no one else does or feels the same way as you do",
    "\"Do I want to be that pretty girl, or do I want to be with that pretty girl?\" 1:30",
    "I've asked myself the same thing hun",
    "\"Two. because Ryan Reynolds\" is nothing less than a brilliant statement lmao",
    "This is the core of gen z. How we are able to to be more open about conversations like this and not make it a big deal",
    "\"men are..... sticky\"",
    "LMAO SHE IS SO REAL FOR THAT",
    "When he said ‚ÄúI‚Äôm a 22, 10 is for normal gays I‚Äôm that next level‚Äù I felt that",
    "9.4K",
    "Ah yes, Ryan Reynolds and Zendaya, the universal constants across sexualities",
    "As a millennial, no one was at all open like this about their sexuality. It‚Äôs refreshing to see the next generation are free to explore their sexuality without prejudice.",
    "Wow teens nowadays are so intelligent. When I grew up there were a lot of hate towards gays. Gave me a lot of trouble growing up",
    "‚ÄúWhen did u know u were straight?‚Äù god I love that question lol",
    "‚ÄúI don‚Äôt like penises and from the girls I‚Äôve talked to, they don‚Äôt like them either. So maybe I am gay.‚Äù When I say I laughed SO HARD",
    "This is so incredible. All of them are so thoughtful about their answers. You just already see the impact of society opening up more about exploring your own sexuality and really getting a grip of who you are and how you really feel instead of franticly pushing everyone into one of two boxes and panicking if someone doesn't fit in them.",
    "Love this Generation and how open they are to these conversations.",
    "this video has more ace representation than all of film industry",
    "‚Äúthey don‚Äôt like them either so i don‚Äôt know‚Äù",
    "3.1K",
    "As someone who used to teach high school, it's so great to see this: they're open and direct, they don't seem to be dissembling, and they just state what they believe they are. Much healthier.",
    "I‚Äôm so happy to see younger gens being able to identity their sexualities (or not) with such ease!",
    "\"There' always room for gay improvement\" THAT'S SO FUNNY",
    "Pleasantly surprised at the number of guys who identified as straight but were willing to give a number a little higher than one! Ô∏è",
    "8.2K",
    "As a 10 who's turning 40 next month, it fills me with great joy to see this conversation has opened up so much. Also, I love this generation's fashion style! So expressive.",
    "\"I don't pick sides. I'm open.\" I love that. More guys should be like that.",
    "Love how everyone isn‚Äôt scared to talk about sexuality and their preferences, this is how I‚Äôd want the world to be like",
    "‚ÄúMen are‚Ä¶ sticky‚Äù PLEASE THAT IS SO FUNNY YET SO ACCURATE",
    "This entire video is breath of fresh air. Open conversation in safe spaces.",
    "Everyone in this video literally looks so interesting i love the energy everyone brought to the room",
    "On a scale of 1 to 10, how gay are you? \"I'm like a 22. 10 is for like normal gays, I'm like next level\" Love that!",
    "9.2K",
    "I like how our society is progressing where teens can be more comfortable with who they are, open to other sexual orientations/genders, and give themselves the opportunity to explore if they want to. I'm happy for them.",
    "Ryan Reynolds has made every straight man think twice",
    "Such a relief to live in the environment and countries without a fear to be judged or punished for your sexuality. No borders, just peace, love and freedom Ô∏è",
    "It‚Äôs so nice seeing teens being able to just breathe and be themselves.",
    "8.6K",
    "my entire friend group is queer and everyone knows it. we‚Äôve had people come to our table because they told us ‚Äúit‚Äôs comfortable over here.‚Äù makes me wanna cry that we are a safe space",
    "5.2K",
    "I love how the different clothing style, hair style, etc. changes so much from the 0-10",
    "Everyone is different. Huge surprise.",
    "\"there's always room for gay improvement\" LMAOOO I LOVE THEM",
    "6.9K",
    "The question: Around your age, is it easy to talk about your sexuality?",
    "And when the teen answered yes, you have no idea how amazing that sounds. When I was a teen, a lot of lgbtqia+ people can't even share who they really are to close friends because of fear. It's good to see that younger people now have more room to express and discover themselves.",
    "3.1K",
    "I love how you can see the drastic style change between the straights and the queers",
    "It‚Äôs so heart warming to see that these teens feel so comfortable being able to say and some of them not to say because they can grow I‚Äôm 22 and when I was in highschool if you‚Äôd have done this people would have gone crazyyyyyy",
    "I cracked up when I saw: \"Zendaya, I'd kiss you!\"",
    "1.3K",
    "I love how everyone is open about exploring things, and just open minded about sexuality in general. Where I live, unfortunately it‚Äôs still quite taboo to even discuss sexuality especially with teens/children. This is so refreshing to watch within this age :)",
    "7.7K",
    "Im SO SO SO glad ace was included omg thank you sm!",
    "\"Theres always room for gay improvement!\" Lmao",
    "As a millennial I thought we were a lot more open with our sexuality compared to Gen x and the boomers ofc but Gen Z is next level and I‚Äôm so happy they have the freedom to be intentional about their sexuality and identity and are going for it.",
    "1.6K",
    "This video made me tear up. It means the world to me that young adults feel comfortable enough to express themselves. Even the concept of ‚Äúexploring‚Äù and finding self is so beautiful. No matter your sexuality, it was amazing to see a group of people be loving and accepting of all sexualities.",
    "3.4K",
    "0:02 gigachad",
    "This is amazing. So open about everything and feels freeing",
    "Okay, but bring them all back in 5 years or after they graduate high school. lol",
    "1.8K",
    "Really happy to see asexual representation on here!!",
    "1.6K",
    "\"do i want to BE that girl or BE WITH that girl?\"",
    "SO RELATABLE!!!",
    "that last kid is a whole mood",
    "1:02 is really kinda refreshing. i love that our society is at a point where a straight man can recognize that exploration doesn‚Äôt define who he is yet. he gets to decide that. and as a cis man that‚Äôs powerful when most straight men feel boxed in or scared to consider anything else",
    "1.8K",
    "being confident in your straight sexuality as a man is appreciating other men can be attractive",
    "\"The girl that said billie eilish is really, really hot\" IS SO REAL FOR THAT",
    "sometimes i forget that people are straight; i'm grateful to live in my little queer bubble",
    "\"an 8.5, just cus I feel like there's always room for gay improvement\" GOD DAMNIT YES",
    "Guy at 1:03 \"I'm not against it, I still need to maybe try to explore my sexuality and see what I like\" Honestly It was kinda awesome seeing a guy be honest and comfortable in himself to admit that sexuality is a spectrum and he's still figuring himself out. Same with the kid at 1:43 like try going on a date with a guy you find attractive or something and hold their hand and see what's up. Don't limit yourself to one gender if something feels right",
    "2.1K",
    "I love this video!!!!",
    "person at 4:40",
    "saying 22 is so real, same",
    "I‚Äôm 60. When I was in high school, one would never dared have been so open about being gay. These young people give me hope for the future in the face of the current homophobia being demonstrated by the Republican party.",
    "4.3K",
    "Can we talk about how every bisexual person in a row had the exact same grunge style",
    "1:12 idk why but I love her ü•π",
    "Could be wrong but Gen Z and younger just seems more fluid, most millennials I feel like didn‚Äôt have that same experience growing uo",
    "\"Do I want to be that pretty girl or do I want to be with that pretty girl?\" Story of my life",
    "1:00: This dude ‚Äì being completely honest and open to try new things ‚Äì these are the types of people we need more of in this world! Respect, my guy!",
    "1.1K",
    "\"men are .. sticky\" i am deadddd, 100% agree",
    "2:02 I swear this guy made me crack",
    "\"STRAIGHT.....quEsTIoN mArK\"",
    "\"Gay IMPROVEMENT\" totally here for that",
    "\"When did you know you were straight?\"",
    "Damn this should be out there more often..",
    "man what a difference 20 years makes. I graduated in 2003 and feel like this conversation couldnt happen then. I love this! My 17 year old out self is elated.",
    "‚Äú8 and a half. Cause I feel like there‚Äôs always space for‚Ä¶ Gay improvement‚Äù",
    "Hahahahaha LOVE IT",
    "the boy with the aphex twin album cover t-shirt.... hit me up",
    "2:37 the \"youve got time\" and the small \"yea\" was so heart warming...",
    "i am 30% gay and 70% straight. and i loved this video- it was so refreshing not seeing people ashamed by their sexual preferences.",
    "Yoo why do they all have such a cool style?!",
    "\"do i want to be that pretty girl or do i want to be with that pretty girl\" SO REAL",
    "This made me cry seeing how comfortable they all were talking about their sexuality. I‚Äôm so happy for this generation",
    "ryan reynolds is every straight man‚Äòs crush. never heard a gay dude name him",
    "that dude who said \"gay as fuck\" r e a l l y sounded like he was and he was hella proud",
    "‚ÄúDo I want to just be that pretty girl or do I want to be with that pretty girl‚Äù is so real",
    "‚Äú8.5 because there‚Äôs always room for gay improvement‚Äù LOVE IT Ô∏è‚Äç",
    "Two aces in one video? Now that is what I am talking about!!",
    "\"Zero unfortunately\" had me dying. But honestly girl I understand.",
    "‚Äú8.5 cause there‚Äôs always room for gay improvement‚Äù honestly, werk",
    "This a very emotionally mature group of kids. Open minded and cool. I love to see it lol",
    "3:03 that girl making her voice go up and down was really satisfying..idk why",
    "Love it!",
    "I love how open and honest and comfortable these kids felt in being able to express their sexuality <3",
    "I didn't really know my own sexuality as a teen, I kind of neglected that part of my life as a fat nerd with terribly low self esteem. Even after living with my gay BFF and spending most of our social time with our university's Queer Collective, it still took me a good few months to even realise that I was allowed to have the option of girls too. I was still pretty awkward, shy, anxious, depressed and self loathing, so I didn't exactly have many adventures or experiences in university",
    "Then I got into teaching, which meant moving to a new town and starting over pretty much every year (damn temporary contracts in regional Australia), so life was too busy to even think about being brave enough to put myself out there. I started to think maybe I was just asexual.",
    "Then I moved to my current location, found the local queer group, and finally loved myself enough to let someone in. The relationship was fun while it lasted, but I had no boundaries and felt pretty drained and one sided. Now I'm happily single and even feeling confident enough to try and be the bold one on dating apps. I still feel the urge to print business cards, so when I see a cute queer-coded person and don't know the polite way to say \"Hi, you look queer, I'm queer, want to be friends/more?\", I can just hand them the business card and run away. The business card will explain things better than me, and give them ways to contact me/the queer group without being too \"in your face\". Yes, I'm some undiagnosed flavour of neurodivergent, and have like half a dozen friends who are also queer, neurodivergent and mentally ill here. They feel like home <3",
    "I teach an after school class of young teens in Cosplay, and 90% of them are LGBTQ+ and I can't help but be a bit proud of how accepting we as a society have become.",
    "To the girl that said ‚Äúskater men‚Äù, I felt that but stay awayyyy baby girl",
    "\"I support everybody but I'm straight\" I love her",
    "8,5 for \"gay improvement\" I LOVE IT",
    "\"Men... are... sTicKeeh\"",
    "LMAO",
    "3:34 \"I'm an 8 & a 1/2 because there's always room for gay improvement..\" 0___0 hahahaha!! I love this person! Me too sis!",
    "Cant wait for the old people to say buhbye and let these youngster run the world",
    "i like that they could be open and not be judged",
    "I love how that girl's immediate reaction was \"My Mum Will See This?!!\"",
    "it is SO refreshing to see people open to the idea of not being straight and being open-minded WHILE being straight",
    "I HOPE THAT MAKES SENSE",
    "1:30 SHE GETS IT",
    "I'm glad Cut made this video.  The people in this video helped me see how it really is for me.  I didn't know how to say who or what I like but this video helped me to say how it really is for me.  I'm surprised so many young people said the truth about how it really is for them.  Young people is more open to being with any body.  I like that.  I never saw so many people that was open and told the truth about how they really feel about being with someone.  Where did these teenagers come from?!",
    "I find it very attractive when guys are comfortable saying that they are not completely straight and would be open to exploring their sexuality. Like yassssss I love it when guys aren‚Äôt afraid that they won‚Äôt be seen as ‚Äúmanly enough‚Äù and are just themselves.",
    "4:40",
    "\"How gay are you\"",
    "\"I'd say like a 22\"",
    "\"10 is just like normal gays, I'm that next level \"",
    "Why did I laugh so hard",
    "This was so wholesome. You like who you like.",
    "billie eilish is the god of teenage girls gay awakening",
    "I grew up with the guy at 2:24! If you ever see this, I want you to know that you were an amazing friend to me in our little small town and It‚Äôs so lovely to see you‚Äôve escaped the dumbass Delph. Ô∏è",
    "\"8.5 there is always room for gay approvement\" hahaha love that yo",
    "This video gave me so much hope for this generations and it is refreshing to see how open and genuine they all were, straight teens included. I am only 28 now and most of what they all said was unthinkable when I was in high schools.",
    "Let‚Äôs revisit all these people in 10 years that would be cool, especially for all the people who don‚Äôt know.",
    "2:24 even his hair is bi",
    "The guy at 2:01 is the best.",
    "\"I'd say I'm at like a 3.\"",
    "8 seconds later: \"Maybe I am gay, I don't know.\"",
    "The cute one on the thumb nail though",
    "Dang, this generation seems to have it easier to embrace their true selves. Good for them. Especially knowing the level of support they are receiving. Makes me smile",
    "Kind of makes me wish I wasn't born much earlier in an older gen, haha...",
    "The first guy wearing a scaled and icy shirt made me so happy",
    "3:46 that guy is a mood",
    "interviewer: how gay are you from 1-10?",
    "aroaces: error 404 attraction not found",
    "Love how open everyone is, especially the guys. The most relatable statement is \"Bisexual...for now\" bc same. Like I'd date a guy but idk, I just lean towards girls way more.",
    "\"8 and a half. Just because I feel like there is always room for gay improvement\"",
    "iconic.",
    "2:07 omg that's hilarious",
    "Im so so happy things have progressed from when I was a teen - really happy for all of them :) <3",
    "Bro this video makes me so comfortable and chilly",
    "These teens are much more mature about their sexuality than the adults version of How Gay Are You",
    "2:11 she looks so cool holy shit",
    "billie being the first girl crush is so real",
    "The boy on the thumbnail",
    "This is the atmosphere I like, they are all very friendly",
    "I'm gay asf men are just so freaking attractive ;)",
    "It‚Äôs so nice to see this new generation more open about sexuality.",
    "That aphex twin shirt fyaaaaaa",
    "i love that he asked ‚Äúwhen did you know you were straight‚Äù because it‚Äôs always a ‚Äúgiven‚Äù that someone is usually straight (which is usually never really the case, but i digress)",
    "I'm so proud of them. Genuinely proud of all of them. They're so comfortable with who they are in this moment and I love that.",
    "‚ÄúCause uh.. Ryan Reynolds!‚Äù That‚Äôs so real.",
    "\"Ten is for the normal gays, im the next level\".  So true!!!",
    "\"Everyone is a little gay\" - Pretty sure the same idea of \"everyone is a little straight\" is what has lead countless gay people to either hate themselves or be societally shunned for not being able to \"make it work\" with the opposite sex. I mean, if \"everyone is a little gay\" and \"everyone is a little straight\" and \"no one is completely straight\" and \"no one is completely gay\", then everyone is bisexual and has the capacity to \"make it work\" with either sex, no? This whole idea is so toxic, misleading, untrue, and annoying. I'm a male who's exclusively attracted to other males; it's possible. Any person not exclusively attracted to the opposite sex is not straight and any person not exclusively attracted to the same sex is not gay. It's really not complicated.",
    "this really shows that every sexuality is valid, and shouldnt be questioned by others. if soneone says their straight. theyre straight. if someone says theyre gay ghen theyre gay. its simple, a lot of people dont respect sexuality, even though we all have a preference",
    "‚Äú0 unfortunately‚Äù SHES SO SO REAL FOR THAT",
    "I love how everyone is so diverse in these videos",
    "Billie Eilish being her gay awakening is a mood LMFAOSALSKDJ",
    "This is so refreshing. This generation is progressing and becoming more accepting and comfortable with who they are and how they feel. There is HOPE for the future!",
    "The kids are gonna be alright",
    "\"Normally, 1, with my homies and big oily black men, 10.\"",
    "It‚Äôs dope seeing that these boys are comfortable to say that they are unsure.",
    "4:00 SO TRUE LETS BE HONEST‚Ä¶she just makes me so much more gayer than i already am",
    "2:23 hes rlly cute hit me up",
    "\"0 unfortunately\" big mood",
    "3:11 they‚Äôre so cute",
    "2:02 Dead.",
    "Wow! I'm so impressed with the mature, thoughtful comments from these young people! I can't wait for this world to feel more love because this generation will change so much!",
    "I. LOVE. THEIR. CONFIDENCE.",
    "And they're TEENAGERS, y'all don't have to know that yet but I support you either way",
    "The amount of people who said they were unlabeled was reassuring‚Äî I always sort of feel pressured to decide and to label myself even though I just don‚Äôt know yet but seeing people my age be content with not knowing  felt good.",
    "That last guy is on gay God level",
    "You can't go 0 on a scale from 1 to 10. It starts at 1, not at 0.",
    "NAH BILLIE IS HOW I FOUND OUT TOO",
    "So great to see that there are more kids these days who are comfortable with a spectrum, exploration, or knowing that a same-sex person is hot without getting homophobic. I also know that they certainly would weed out those kids for this video and there are still lots of them out there. Progress is definitely being made. More to go as well! These kids rock!",
    "1:02 CUT WHO IS HE????? I NEED TO KNOW NOWWWWWW",
    "What are you gay? \"Men are sticky\" - famous quotes from Cut",
    "Watching the numbers go up, and the people gain a more alternative style is sooo funny to me",
    "I want the ace kids to know I'm so proud of them and happy for them. When I was their age i was still having boyfriends tell me they would fix me through sex and it's memories  like that that will stick with me forever. Keep your head up and your heart full of love for yourself.",
    "2:52 same girl, same",
    "that girl who said if her boyfriend was a girl she would still date him is exactly how i feel!! Every time i see my boyfriend wearing makeup i feel more certain about my pansexuality!!",
    "\"I'm an eight and a half. There's always room for gay improvement.\" Interesting.",
    "I‚Äôm glad to see Ace people and just the diversity of everyone in general. I think it‚Äôs cool honestly.",
    "3:01 i just know that girl is naturally funny",
    "this is honestly so so comforting. i go by straight bc i have only had real crushes on men and i get like that butterfly feeling with guys, but at the same time, sometimes ill see a girl and just think wow she's attractive. but like i wouldn't wanna date a girl and i would wanna date a guy. so i'd put myself at like a 2-3. but i love how open the people are in this video <3 so refreshing",
    "I love being unlabeled because I feel the labels are like rules u must follow, I can just be myself and not worry about who im attracted to or not",
    "1:10 his voice ,his face",
    "I absolutely love this. I love that these kids are so open and understand sexuality is a spectrum/don‚Äôt rigidly rate themselves one way or another. Especially the boys saying they‚Äôre 2 or 3. Love it so much",
    "how gay are you?",
    "me: yes.",
    "LOVE the girl who said there is always room for gay improvement",
    "3:26 ahh, shes gorg",
    "This is so refreshing to see. As time goes on, the world becomes more accepting and this video shows younger people seeing this concept so openly",
    "When did the fine bros make a new channel?",
    "If we had this attitude across the globe we would have solved world hunger by now",
    "I just burst in laughter when the girl said  \"Men are sticky\"  at 2:40",
    "‚ÄúMen, are‚Ä¶.. sticky‚Äù",
    "As a lesbian, this was so refreshing",
    "\"there is always room for gay improvement.\" wise words to live by",
    "acknowledging that ppl are attractive doesnt make you gay. its common sense that there are attractive men and women in the world. that doesnt mean someone is bi or gay cuz they see that ppl are attractive.",
    "I love our community generation they are so open and supportive off others that has major struggles of coming out",
    "If this is a representation of our future then we are in good shape!  I am 60 and so amazed at the level of openness and unthreatened attitudes of these young adults!",
    "This generation. Refreshing. I have hope.",
    "It's so awesome to see ace representation from TWO people here! Love that more and more people are becoming aware of us",
    "that first kid with the scaled and icy shirt yooooo",
    "2:01 this guy is so real",
    "‚ÄúI support everybody but im straight‚Äù  protect her!!!",
    "I'm 28 now and seeing this made me realize how much the world has changed since I was a teenager. Talking that openly and honestly about your sexuality and reflecting on it is something we never would have done 10-15 years ago. I'm close to tears rn. Ô∏è‚Äç",
    "room for gay improvement ahdsuhduash I loved it",
    "1:31 THE STRUGGLE IS SO REAL  as a lesbian istg I‚Äôll never know the difference",
    "Okay but the young men in here being open about how they have maybe yet to discover some of who they are and they are not against gay love is so nice to see :) props to you guys",
    "As a gay myself, I can't help but feel this is only representative of a very Liberal city (probably in SoCal), so unfortunately teens in other areas would never admit to this for fear of being picked on. Of course, this mostly applies to males since the double standard is worse for us. Notice how most answering are girls.",
    "It is also good to see them being open about their lack of certitude, and being happy to be on the road to self-discovery.",
    "the last guy is SOOOOO real like he and i are twins",
    "I'm crying, I wish times allowed us to be as open as kids can be today. So happy for you all!!! <3 You got your whole lives to figure yourself out!",
    "I‚Äôm so happy for the next generation. They‚Äôre so open and accepting. I know there are locational bias but still it makes me happy a lot of teens don‚Äôt have to go through what I went through.",
    "This was amazing...What a different world than the early 80's...",
    "Can we PLEASE replace Fox, Sky and GB 'news' feeds with this video on a loop? Like now?",
    "Asexual pride!! Yey!  I'm asexual, and it was cute to see other asexual people there",
    "‚ÄúI started listing to Billie Ellish when I was 14‚Äù damn that made me feel old, has it been that long since she came out",
    "3:40 ohhh she‚Äòs CUTE",
    "\"BEcAuSe RyAn ReNaLdEs\"",
    "2:07 BRO THIS DUDE IS SO FUNNY",
    "As a gay who \"came out\" over 20 yrs ago at the age of 15, this video makes me very hopeful and proud of the future for lgbtqia+ youth.",
    "Wow this generation is so much more comfortable than mine, this would have been taboo for teen millennials to admit this.",
    "i would be yelling 10 if i was there",
    "Title should be \"how straeight are you\"",
    "I'm tearing up just seeing this! Gen Z love ya!",
    "4:15 thats a good heart shape lmao, she must do it a lot",
    "this video made me smile ‚Ä¶ if i couldve seen some like this when i was still young‚Ä¶ it prolly wouldve made my life sooo much better .",
    "this saved my life",
    "I don't like the whole \"nobody's completely straight\". If someone said \"nobody's completely gay\" - they would be described as homophobic. Sexuality is a spectrum, so there are people on completely opposite ends too and that's okay.",
    "Cried during this whole thing. Beautiful.",
    "This is so amazing",
    "\"Do I want to just be that pretty girl?  or do I want to be with that pretty girl? \"",
    "omg, I found what I feel like all my life",
    "1:48 THIS GIRL NEEDS TO BE MY BEST FRIEND SHE HAS TASTE.",
    "omg the answer at 1:03 really shows how grown teenagers are these days! such a cutie!",
    "'I'm that next level' just like me fr fr /lh",
    "‚Äú1 Im , straight ‚Äú",
    "I love the \"when did you know you were straight\" question.",
    "The girl at 4:04 is literally me LMAO",
    "‚Äú0 unfortunately‚Äù is so real",
    "Talking this openly would have meant complete social isolation when I was a teen",
    "I love how comfortable they seem talking about this. A lot of people would get super angry or defensive, but really, there shouldn‚Äôt be anything wrong with acknowledging your sexuality may be fluid",
    "1:03 Nahh he‚Äôs pretty",
    "2:07 literally yup.",
    "Omg I love that last guy",
    "I can't measure how gay I am but, like, EXTREMELY.",
    "1:12 that answer was the most sweetest and genuine of the bunch omf !",
    "3:34 \" i just always feel like there's room for gay improvement\" lmfao girl",
    "2:02 that was wholesome",
    "2:31 THIS GIRL WHO IS THIS GIRL IM IN LOVE OMG",
    "The guy in the black hoodie is so cute. He can explore me if he wants to and if he's curious enough",
    "i love that straight people think being bi is about sex, but the bi people emphasize about connections",
    "Give them a few years to experiment and explore their sexualities. The numbers will change.",
    "2:36 she is super pretty! She'd look really good with black hair. She reminds me of Amy Lee from Evanescence.",
    "I am proud of the asexual people, we love ace representation!",
    "get these same ppl back in 10 years",
    "Letttttttssssss gooooooooo The Apex Twin shirt!! Love it 2:00",
    "1:36 ... Them not showing a single clue of maybe knowing Katy Perry's \"I Kissed A Girl\" has me feeling my age, haha. Like, I smiled so wide at the similarity there, but the interviewee just went along with like it was nothing. Kids these days don't know culture!",
    "\"There's always room for gay improvement\" Ô∏è‚ÄçÔ∏è‚ÄçÔ∏è words to live by",
    "This is so cool, love this generation.",
    "3:26 this is singularly the coolest person I have ever seen",
    "I'm gay. 100% gay. I've never understood when people say \"everybody is a bit gay\", because I'm not even a tiny bit straight. I have never had any romantic or sexual feelings towards women -- I think people confuse sexuality with the ability to recognise an aesthetically attractive person. A man knowing that Ryan Reynolds is attractive doesn't make him gay unless he wants to sleep with him.",
    "Okay but I'm so in love with this video. Look at how comfortable everyone is when it comes to discussing their sexual orientations. They are all so open to explore and that's a huge change right there.",
    "2:22 bro is 50% good boy and 50% bad boy",
    "2:31 she's adorable, I can't",
    "\"do I want to just be that pretty girl or do I want to be with that pretty girl, that's really hard to tell sometimes\" she gets it",
    "hello, it‚Äôs me, skater men girl  pls know that I was super nervous when we filmed this and I thought they were asking me about my type, not my sexuality as a whole lmfaooo",
    "LMAOO I love the last guy",
    "First dude was real af... RYAN REYNOLDS man",
    "The limit does not exist",
    "I love that most of gen z is open and supportive of lgbtq+",
    "MY JAWS DROP INTO THE EARTH CORE AFTER THE RYAN REYNOLDS Ô∏è",
    "If I were there I‚Äôd probably say ‚ÄúWell if they‚Äôre cute, then their cute.‚Äù",
    "I love the answer of these men, they're not close minded",
    "these kids are so cool. i wish i was this open and comfortable with myself at that age",
    "Ill tell ya what. These young adults are a clever bunch!",
    "\"OHHHHHHHH my mom is gonna see this....\" Couldn't agree more.",
    "3:52 SHES SO PRETTY DUDE",
    "So nice to see asexuality represented!",
    "3:47 loved how on to the point this answer was",
    "This younger generation is sooooo amazing compared to when I was a teen, they are so open and accepting I love it",
    "the zendaya girl is such a mood I actually wanna cry",
    "These kids are so inspiring, I‚Äôm in shock and awe The way they‚Äôre true to themselves and non apologetic about being the person they are is just‚Ä¶. This made me want to be a better version of myself",
    "The guy who opened this video and said he's a 2 cause of Ryan Reynolds - what a champ! Love it LOL",
    "4:00 shes so real i love her billie eilish on top",
    "1:03 dam that boy cute",
    "I am so proud of this generation. Honestly, sometimes it is shocking how much things have changed from when I was in middle/high school back in the 2000s, even in the USA. like that couldn't have been me talking about my sexuality/gender expression back then lol no way no way. I love how comfortable and accepting these kids are. and yes, you all got plenty of times!",
    "They all are so brave and adorable.",
    "2:31 THEY'RE SO GORGEOUS",
    "I‚Äôm so glad that this video was so refreshing and every guy that was asked about their sexuality answered perfectly! Love to see men secure with who they are",
    "\"There's always room for gay improvement\" love this",
    "‚ÄúRoom for improvement‚Äù haha",
    "These are people i‚Äôd all hang out with",
    "I love this.  I'm in my 40s and straight (although like many in this video have said, I don't think anyone is 100%, so maybe I'm 1.5 or 2).  But, I must say I LOVE LOVE LOVE these people.  When I was young people would not feel so free to be who they are and I love that younger generations feel safe to do so.",
    "I love seeing so much openness, acceptance and freedom to be who you are.",
    "Ô∏è",
    "I love how you could immediately tell who‚Äôs bisexual",
    "The earring guys are definitely not 1/0 lol.",
    "‚Äúbecause of ryan reynolds‚Äù",
    "It's so nice how kids these days can freely talk about this because that's how it should be and how it should have always been. Our generation could never :< haha no wonder most  my peers are fucked up",
    "notice how all the people that are straight look normal then as they go up they get wacky colored hair, bigger body weight, bunch of piercings lol. you cant make this up lmao",
    "I'm 100% gay. That's all I can say.",
    "I like this show is addressing all sexualities n all young and showing all different types of people",
    "The last dude? Legend. Icon. The true king of the gays. 22? None of us can match up.",
    "Cut is the only platform where i feel myself safe and secure. Ô∏è‚Äç please continue the good work",
    "22 girl, you're an icon and don't ever forget it",
    "Is that a Gen Z heart sign at 4:10! Damn, I feel old",
    "this video made me smile.  it's great to see things changing",
    "HELP ME THEIR SO FUNNY THE TEENS YOU CHOSE HAVE PEAKED HUMOR OMG",
    "I'm 0% gay.... And 0% straight.",
    "100% bi!",
    "THERE IS ALWAYS ROOM FOR GAY IMPROVEMENT",
    "I‚Äôm glad there are visible allies now. We didn‚Äôt have that.",
    "The kids are alright",
    "I think man are cute",
    "Broo that guy its so sweet",
    "0:33 ‚Äúhow did you know you were straight?‚Äù",
    "‚Äúi always knew that i liked girls‚Äù",
    "oh how the turn tables",
    "Its a 10 for me",
    "the ryan reynolds at the very start lmao",
    "1:32 is basically my entire childhood",
    "Can we please get more of him plz 2:26",
    "this popped up on my recommended on the first day of pride... I absolutely love that",
    "A great video",
    "funny how some say that because they find someone \"attractive\" that makes them a little homosexual.",
    "\"there's always room for gay improvement\"",
    "a legend",
    "i can confirm that all of my straight male roommates are 2/10 gay because of ryan Reynolds.",
    "2:00 the aphex twin tshirt gave it away",
    "some of these people are in for a surprise",
    "\"I like acknowledge that guys can be attractive, I just don't like penises.",
    "And from the girls I've talked to they don't like them either, so maybe I AM gay..?\"",
    "this is gold",
    "There's always space for gay improvement  i like that",
    "4:41 STOP THIS IS LITERALLY ME",
    "U HOMOSEGSUAHS in my Terri voice",
    "You can see it, maybe not as much, slowly but surely the next generation is gonna be more and more open minded. I‚Äôm so glad!",
    "1:31 LITERALLY THE QUESTION I ASK MYSELF EVERY SINGLE DAY",
    "I fell in love with  'asexual maybe'",
    "its amazing how supportive these teens are with the lgbtq. honestly, if these people acted how I expected, all of them would say 0 without even thinking about it",
    "10. im a full 10",
    "I'm a 10...no question, I am gay!",
    "I'm also in my 30s now.",
    "And if you'd asked me this question when I was a teenager, I would have lied to you.",
    "I would have said 2 or 3 just to fit in.",
    "It turns out that fitting in with my peers in high school should never have mattered as much as it did in the moment.",
    "Hindsight is 20/20.",
    "the last guy was so random but so funny. funny way to end the vid!",
    "1:09 would I be teen, mmh I would love to try to convince him lol",
    "3:34 ALWAYS ROOM FOR GAY IMPROVEMENT LOVE THAT",
    "0:52 same as him just a opposite lmao",
    "I thought I was really going crazy and it wasn‚Äôt real when I saw the Aphex Twin logo my god bruh 2:00",
    "the guy at like 1:03 saying 2 and a half maybe 3",
    "i want his number. he is like so fine",
    "2:09 yes. So happy to see so many young guys who aren‚Äôt ‚Äúno homo‚Äù or hyper straight",
    "I completely agree with the first guy no matter how straight you are there‚Äôs always room for Ryan Reynalds",
    "Men are \"sticky\" HAHAHAH best way to describe em",
    "I honestly don‚Äôt understand sexuality enough to know how it works. I just know that I grew up only loving the female body, female breasts and butts and nipples and vaginas. As I got older and watched more pornography, I became more open to the idea of male genitals and then some male features like muscular bodies and chiseled features. Far few men are attractive to me (1/100) and I don‚Äôt find men‚Äôs personalities attractive in a romantic way. So I would say that I am mostly straight‚Ä¶but hey, I wouldn‚Äôt be against a hot bisexual threesome with an exceptionally attractive man and a hot lady.",
    "In my adult life, I have a lot of opinions on what sexuality is but I can‚Äôt say that I know what it actually is. Beyond the normal opposite sex attraction in the biological mating process, human sexuality is odd and confusing. It is full of stereotypes and stigmas, so it‚Äôs hard to talk about for most people. All I know is that you like who you like. To make up rules for yourself about who you can and cannot love or want to have intercourse with based on gender is your own choice. But love who you want to love.",
    "‚ÄúMen are‚Ä¶ sticky.‚Äù",
    "1:30 I FEEL YOU  lol",
    "I could tell who was qay litteraly as soon as I seen them",
    "2:45 \"Seven or eight\"",
    "HAHA ok, OKAY.. sure.",
    "1:50 I relate so much",
    "I enjoyed hearing from many of them especially 1:02!",
    "literally the Ryan Reynolds answer",
    "3:59 WE ARE THE SAME PERSON BRO",
    "\"I've kissed a girl, but she was my best friend\" Oh god, how much would gays give to experience that",
    "This was so heartwarming",
    "I love that that asexuality was mentioned !",
    "The style change as it goes from straight to bi omg",
    "\"Am I the pretty girl, or do I wanna be with that pretty girl?\" My current life lol",
    "\"Do i want to just be that pretty girl? Or do i want to be with that pretty girl? It's pretty hard to tell sometimes.\" ‚Äî me before i realize i'm bisexual.",
    "There is always room for gay improvement JAJDJDJKQ(yo)",
    "\"Men are sticky\"",
    "This is why I always feel comfortable telling people my sexuality because I hope that they are supportive and most of the time they are. I do have to say though, I LOVE being Bi",
    "My generation gives me so much hope",
    "i‚Äôm like a 7 prolly. i‚Äôm a bisexual dude but i think i lean more towards guys",
    "The guys just disappeared once the sexualities got more complex. Either sexually fluid men don't exist, or they're still afraid to talk about it.",
    "Lots of people were saying they‚Äôre a little gay because they can tell when another of their sex is attractive. That‚Äôs not gay, that‚Äôs just observant. So many times it was ‚Äúwell I‚Äôve never actually been attracted to a man, including the one I noticed was attractive to women, but I still answered something over 0.‚Äù",
    "Anyone with eyes can tell when a woman is beautiful or a man is handsome, you don‚Äôt have to be attracted to them to know they‚Äôre attractive to the opposite sex, that‚Äôs just good judgement.",
    "PFT \"There's always room for gay improvement\"",
    "My new aspiration is to be a little more gay every day",
    "THE FIRST ONE WAS EVERYTING",
    "they need to do a follow up in 5 or 10 years",
    "Funnily enough, having a crush on Ryan Reynolds is the most straight-man thing to ever exist",
    "I love the ace representation",
    "Haha that video is great!",
    "the guy in the intro‚Äôs shirt",
    "I wanted to let everyone know that this channel is based in Seattle which is one of the most liberal or progressive cities in America. I‚Äôve lived here my whole life and one thing I can tell you is you don‚Äôt get bullied as much for being gay here like you do for being against it.",
    "You do NOT need a label, just so every teen knows! <3 Yall are great as you are no matter what label or no label!",
    "this video just gave me the ick",
    "Bros got scaled and icy tee",
    "‚Äú I don‚Äôt know who I am.‚Äù Welcome to adulthood",
    "I love how the parent has to ask the kid if they‚Äôre sure they‚Äôre not gay. Let these kids be",
    "HELP THE PERSON SAYING 22 WAS SO FUNNY",
    "It is so refreshing to seethis generation be so open about their sexuality. My how times have changed sunce I was their age. Proud of you kids and just be the BEST you can be. Living youre life authentically happy, joyous and free",
    "she said ‚ÄúMen are‚Ä¶ sticky ‚Äù",
    "love how a lot of people said queer instead of gay",
    "The girls in theater \"OMG HES SO HOTTT\" Me: \"ummmm...chileee...anyway sooooo\"",
    "Seeing this young generation so open minded about sexualities, we human as society is progressing.",
    "1:15 omg I thought that was Ethan Dolan",
    "i get SO happy whenever i see a fellow asexual like OMG",
    "All these people are so pretty",
    "Shoutout to the guy at 1:02. I feel like it's so much more normalized for girls to \"experiment\" and not be labelled just because they were curious and wanted to know for sure one way or another but it's way more stigmatized in guys.",
    "4:33 i can hear this single frame",
    "Ok. But where can I get her frog shirt at 00:40",
    "Awww. I love them. They‚Äôre so cool.",
    "\"Because of Ryan Reynolds\"",
    "The young man at 1:02 I need his Instagram",
    "I'm 50% -50% gay,  cuz I'm bisexual. And I'm biromantic.",
    "( Bi- asexual)",
    "And I support all of these guys in that video, boys and girls.",
    "And love is love for gays, bisexual, lesbian,asexual, pansexual, straights. I'm for my rights as LGBTQIA and I'm standing for LGBTQIA and also cisgenders heterosexuals straights too.",
    "almost every straight man's answer is Ryan Reynolds and im tiredt",
    "Straight, Straight, Straight, Straight, \" S K A T I N G  M E N\".",
    "I'm 1 trillion percent gay.",
    "Muscle and my yellow skin ! Proud of it as well.",
    "I'm late but I'm gonna use this as a place to come out because idk how to in real life. so I'm queer. I'm demisexual + I like women and non-binary people and I like men slightly but way less than the other two. so I'd rate my gayness at a quick 8.27",
    "I always say everyone is pretty in their own way men and women",
    "\"do i want to be that pretty girl, or do i want to be WITH that pretty girl\" hits so SO hard",
    "‚ÄúI don‚Äôt like penises, and from the girl I‚Äôve talked to they don‚Äôt either so maybe I am gay‚Äù PLS IM DEAD",
    "I love how this younger generation is so open to be something other than straight. I didn't figure myself out until I was in mid 20s, and even then I was in denial, just because I'm on the asexual spectrum, and bi.",
    "damn the eyes from the girl at 3:12 look stunning",
    "I have a feeling the lucky few who say things like \"Never really thought about my sexuality or don't give it much thought\" never had people in their ear or in their close circle throw labels or make assumptions and observations. Those with family members who like to out people, trust, you've given it thought. You became self aware, self conscious etc. I think it's fabulous the families out there who don't need to bring any of that up and just let the kid BE. Then they won't have voices or thoughts in their head \"what who am I?\"",
    "1:03 find his insta he is fine and I love his deep voice",
    "1:32 as a biromantic ace woman, that was SO relatable to hear. The wonder of wether you want to be her because she's so attractive or you want to be WITH her because you're so attracted to her, that was a real struggle. Still kicking in smts like \"heyo you might be straight\" when I'm truly I'm not XD",
    "@-HJC",
    "So glad I found out how gay i was.",
    "I'm 100% gay. That's all I can say.",
    "3:27 girl doesnt even look real. she¬¥s so pretty",
    "1:31 I‚Äôve been asking myself that for months like tf?",
    "Next level gay. Purrr",
    "They‚Äôre very smart their title card",
    "Yay! Waiting for South Asia to reach this level one day",
    "‚Äúmen are sticky‚Äù so true",
    "good to know I'm not the only one whose queer awakening was billie eilish",
    "I‚Äôm gay for my math teacher",
    "1:54 yeah‚Ä¶ same",
    "seeing how many people are not only respectful ofc but also comfortable exploring their own sexuality is very refreshing and wholesome  don‚Äôt be afraid to find your true self!",
    "i hope they all have happy love lives. or the best single lives too, whatever they want.",
    "makes cents. 100 teens from seattle and at least half bisexual",
    "guys, it's not gay to acknowledge that someone of the same sex is attractive",
    "\"No labels.\" The contrarians of the sexualsphere. Someone should tell them that in many parts of the world it's understood that men and women are straight, and so have no labels.",
    "took me 11 seconds to like. the ryan reynolds comment was so true i had to like",
    "0:39 omg that's the opposite of how things usually are-",
    "1:04 can someone find him please",
    "0:14 i spy a taylor cardigan",
    "Bro said 22",
    "This was refreshing",
    "1:03 in love.",
    "\"I think there's always room for gay improvement.\"",
    "I AGREE",
    "1:08 I luv his voice,and 1:55 is so real",
    "1:30 \"Do i want to be that pretty girl or do i want to be with that pretty girl\"",
    "Same.",
    "02:46 what in the monchichi",
    "The guy at 1:05",
    "Gay improvement",
    "TINTS!! THE BACKGROUND MUSIC IS TINTS FROM ANDERSON PAAK",
    "One quote that I always remember: \"Linux is a file based operating system but Windows is an API based operating system.\" That helped me to understand the overall structure of Linux as I deep dive operating systems more and more overtime.",
    "Great video as always!",
    "4.2K",
    "After using Linux for more than 10 years, now I am watching Linux in 100 Seconds....",
    "3.4K",
    "Speaking of distros, today is Arch Linux’s 20th birthday!",
    "Edit: good lord, what have I started…",
    "Note: „cd ..“ doesn‘t necessarily bring you to the root of the filesystem but it goes one layer up. In this example we were in „/root“, with „cd ..“ it brings you to the root  of the filesystem. „cd /„ brings you always to the root of the filesystem",
    "1.6K",
    "“A computer is like air conditioning - it becomes useless when you open Windows.”",
    "- Linus Torvalds.",
    "2.4K",
    "Linux is one of the most important skills you can learn as a developer, and tech person in general.",
    "Just a few things to speed up your Linux usage. You don’t have to put the ~ in front of cd to go to the home directory. If you just type cd then it automatically takes you home. Also you don’t need to touch a file name to create it and then edit it. You can just use vi(or text editor of choice) <file name> and if it doesn’t already exist it will create it.",
    "This is great! Please make a Linux beyond 100 seconds, it would be awesome! Thank you very much for all the hard work you put in",
    "As a frontend dev that uses a windows machine, it feels like it's about time to give linux a try given that I'm already using bash in my terminal.",
    "I'm thoroughly impressed - thought this was just click-bait but actually quite a good overview well done and enjoyed the animations",
    "excellent work! love your ability to break these complex subjects down into a short and concise video",
    "would love to see Xorg in 100 seconds",
    "Hell yeah, this freaking 100 seconds have been the most informative 100 seconds of my life. Made all the sense to my 3 years of experience using linux as an os.",
    "The command \"cd ..\" does NOT go to the root folder. It goes one folder up the current directory. So if you were in /home/user/pictures and did \"cd ..\" you would now be in /home/user. To go to the current user's folder from within any folder do \"cd ~\". To go to the root folder from within any folder do \"cd /\".",
    "Using Ubuntu since 5 years now, today learned the full form of apt thanks to you !",
    "I'd just like to interject for a moment. What you're referring to as Linux, is in fact, GNU/Linux, or as I've recently taken to calling it, GNU plus Linux. Linux is not an operating system unto itself, but rather another free component of a fully functioning GNU system made useful by the GNU corelibs, shell utilities and vital system components comprising a full OS as defined by POSIX.",
    "Many computer users run a modified version of the GNU system every day, without realizing it. Through a peculiar turn of events, the version of GNU which is widely used today is often called Linux, and many of its users are not aware that it is basically the GNU system, developed by the GNU Project.",
    "There really is a Linux, and these people are using it, but it is just a part of the system they use. Linux is the kernel: the program in the system that allocates the machine's resources to the other programs that you run. The kernel is an essential part of an operating system, but useless by itself; it can only function in the context of a complete operating system. Linux is normally used in combination with the GNU operating system: the whole system is basically GNU with Linux added, or GNU/Linux. All the so-called Linux distributions are really distributions of GNU/Linux!",
    "The package manager is honestly my favorite part. I can get everything I need quite easily, and it’s automatically put in the right spot, even when downloading through GUI. Although I use Windows for gaming because of compatibility, I prefer Linux because it has so many features that you can use and you can specify it to exactly fit your needs and preferences.",
    "i'd love to see videos on vi/vim and emacs. They seem incredibly daunting for beginners but can be incredible powerhouses. Also specific intros to certain popular desktop environments/distributions could be an interesting topic",
    "Waoo. I just commented 100 seconds of linux in your last video. And here it comes. Thankyou so much",
    "You're so good at explaining things in 100seconds",
    "Finally someone who actually says what the commands are short for",
    "Ayy, I'm glad to hear you use/recommend Linux. I definitely believe that more people should get into it. I set up and taught my mom to use Elementary OS and she rarely has any problems.",
    "Used this video a few minutes before a computer science test in school and made me get through it amazing bro",
    "I've used only Linux for work, home and play for decades now. Unbeatable for development.",
    "Love this kind of content!",
    "Keep up the good work and let’s never forget “Free as in free speech”",
    "0:53 Also worth mentioning filesystems, network protocol stacks, and security management, as additional important parts of the kernel.",
    "Ah I love these videos man. Thanks for making such high quality stuff.",
    "That was a fair bit of info imparted in return for 100seconds of my time.  Thanks!",
    "Linux is, and will be, the best system for me. From coding, to video editing, to even gaming, I love that it's getting so much better than back in the day when I couldn't even get drivers for my graphics card, or where there were errors just trying to install. Ubuntu, Arch, doesn't matter. We are all one when it comes to Linux, even though it doesn't seem like it sometimes. Love the video!",
    "Neat overview! (Although, logging in as root isn’t really good for security. But it works for a demonstration.)",
    "Your explanation makes everything seems easier. Glad to subscribe for yoi",
    "I started from the first video to this video with no skip.",
    "your videos is amazing",
    "Note regarding sudo, it's substitute user do, not super user do. You can sudo or su(substitute user) into more than just root.",
    "The touch command was created to change the last modified date to the current date on an existing file. If that file doesn't exist it is created and then the time is set.",
    "amazing wrap-up with the history command :D",
    "Why are these videos so good ??",
    "and BTW `cd ..` is not to go to the root of filesystem but to go to the parent directory",
    "Additional note: linux is a kernel, not an OS. I do understand though that people call linux an OS and refer to its distros.. but still wanted to correct it :) great and informative video!",
    "Thanks alot. I just installed ubuntu as a virtual machine to aid me in learning linux. I really didn't understand commands like grep but with this short video, I now understand how it works. If you can make a full course on fireship, I would happily subscribe. Thanks a lot for your videos Jeff",
    "Taking a college course in Linux right now, having this foundation of basic commands is super useful since this is the most confusing language I've learned so far",
    "I do appreciate how casually you mention nano and emacs in one sentence.",
    "Nice overview! Nowadays it's not necessary to know much terminal magic going into Linux -- you can get away with never opening a terminal if you want! but knowing some commands is always useful to get the most out of your machine (including you too, windows users!)",
    "I admire how you include a tutorial on escaping Vim within a ~3m clip about Linux. Presentation of Linux wouldn't be complete without it.",
    "I like that you used the VScode terminal .",
    "Try to provide a web note of your these 100 seconds videos. These are really amaizing appreciate the effort. That's all and ya thanks",
    "linux in 100 seconds?? holy heck whats next, wife and children in 100 seconds??",
    "I'd just like to interject for a moment. What you're refering to as Linux, is in fact, GNU/Linux, or as I've recently taken to calling it, GNU plus Linux. Linux is not an operating system unto itself, but rather another free component of a fully functioning GNU system made useful by the GNU corelibs, shell utilities and vital system components comprising a full OS as defined by POSIX.",
    "The history command is awesome, never thought of it",
    "Laravel in 100 seconds next please! I feel like it’s a technology / community many more people should be aware of",
    "Didn't we have it's lore before",
    "Even tho I'm still in love with linux",
    "Linux is one the best and trusted Operating System out there and i love it... Thanks Jeff for making my end of the day better",
    "More like Linux in 50 seconds and then the bash shell in another 50 ;)",
    "Great stuff!",
    "Extremity helpful, quick and informative! Thank you!",
    "216k people just added \"linux\" to the skills section of their resume ️",
    "I like how he uses VSCode to show terminal",
    "Thank you for covering Linux in 100 seconds and I'd love more videos about Linux, maybe showcasing a little of the desktop environment(s) so people can see how usable it is.",
    "This was really well put together.",
    "Now we wait for BSD in 100s and TempleOs in 77 seconds",
    "He made a video when its Arch Linux birthday. BTW, I love your content",
    "I love Linux. It makes me really happy. Currently hopping to MX Linux!",
    "1:39 you don't need to use \"cd ~\" to get back home, just \"cd\" is enough i believe.",
    "You're not wrong but I feel that this doesn't really show Linux. It shows basic terminal usage, but today Linux is so much more. Would love another or extended version which also talks about the general usage with a DM and stuff. Cuz many people think that Linux is just that, a weird hacking thing where you type commands into the command line",
    "1:22 Root shells usually have a '#' sign at the prompt instead of '$'",
    "Love how you pronounced chown and chmod as words but then said the full superuser do instead of saying sudo as a word (the opposite of what people normally do) hahaha. i love this channel for little things like that",
    "Alternate title: Best OS in 100 seconds",
    "Linux based systems are neat. Took me a bit to learn to use the terminal but well worth as a developer and as someone who values my privacy.",
    "I do have to run a Windows virtual machine to play some games with, but Linux's Hypervisor (KVM) as well as qemu make it easy to pass my graphics card to it and it runs like native.",
    "I'm a linux/MacOS user for almost 5 years, and now here I am. Watching 100 seconds of llinux.",
    "I wish i could just move to linux. Its snappier than W11, and as a programmer i would love it. But it has some problems that keep me from changing:",
    "1. Gaming.",
    "I game a lot. Sadly, i dont play games from 1994 without anticheat that can be perfectly run with Wine or proton. I play multiplayer shooters like Valorant or Rainbow Six, and league of legends. Games you cant play on linux.",
    "2. Windows magic ⊞ Win + V",
    "The windows \"magic\" clipboard history (the one that you access with Win + V) is a tool that i use A LOT. And there arent any linux versions that are able to achieve the same result. Windows V opens where your writing cursor is, you can navigate it with the arrow keys, holds text, images, etx perfectly visible.",
    "3. My  graphics card is from nvidia.",
    "Theres nothing more to say about that",
    "1 and 3 sadly cant be fixed, but if someone finds a good ⊞ Win + V (see, i used Windows V to paste that unicode character, instead of searching it again) replacement it would mean a lot.",
    "It’s amazing how consistent you are with uploading frequency while at the same time maintaining such high quality content",
    "Another great 100s video that couldn't care less about the title's goal",
    "that's the firs one of your vids which has given me the warm fuzzies.",
    "You literally just described my 14 week university course on Linux in 100 seconds. Imagine if colleges presented information like these videos. Great work.",
    "For anyone who doesn't know, Linux is the name of the kernel, Linux distributions are the kernel + a ton of userspace apps that make it compliant with POSIX or later standards.",
    "Great video, i wish found something like this when i was learning the basic commands and couldn't figure out why tf they were called that way",
    "Linux is not an operating system. It's a kernel that was developed by Linus Torvalds. GNU is the operating system created by Richard stallman that runs on top of the linux kernel hence the name GNU/Linux...",
    "As I just got my Linux Essentials certificate, I can say this video would have saved me hours of studying!",
    "I love the sl easter egg towards the end there...",
    "If it weren't for Adobe and the spotty game performance, Linux would be my daily driver. I can't wait until that's a reality",
    "Please Assembly in 100 seconds",
    "A video summarizing assembly in 100 seconds would be cool",
    "One thing that could have been included is the fact that Linux nowadays also runs on Windows either on a lightweight VM layer like WSL2 or natively like coLinux.",
    "What you're referring to as Linux, is in fact, GNU/Linux, or as I've recently taken to calling it, GNU plus Linux. Linux is not an operating system unto itself, but rather another free component of a fully functioning GNU system made useful by the GNU corelibs, shell utilities and vital system components comprising a full OS as defined by POSIX.",
    "In my first year in college, we used nano commands in terminal and coded C programs without text colors. I didn't understand the whole concept of terminal We just got taught about the certain codes until compiling of hello.c",
    "Your content is amazing and informative. And your video editing and story telling is top-notch too!",
    "nice compact video!",
    "There are some misleading things in this video though.",
    "1) Linux is not an operating system. Linux is a kernel. GNU/Linux is an operating system because of the GNU part which is separate from the Linux Kernel. Some Linux based operating systems are Debian, Arch and Fedora.",
    "2) \"cd ..\" doesn't go to the root of the filesystem, it goes one level up. In this video it just so happened to take you to the root of the filesystem because you were just 1 level down (from /root to /). If you want to go the root of the filesystem regardless of where you are, use \"cd /\" instead.",
    "3) I know that this is a 100 seconds video so I won't deduct any points from my imaginary scoring system, but apt-get will only work on Debian based distributions. Each flavor of a linux distro has its own package manager such as apt for Debian, pacman for Arch, etc. So when you install a linux-based OS, also check which package manager it comes with so that you don't get confused with why a certain package manager doesn't work for you.",
    "\"..\" is the parent directory and \"/\" is the root directory, so \"cd ..\" will move you into the parent directory (if you aren't already in the root directory) and \"cd /\" will move you into the root directory",
    "Pls make a BSD in 100 seconds next, awesome vid as always. Anyone in the arch gang to say btw?",
    "Also you should tell users not to use the root user! and that messing with root can result in dangerous consequences.",
    "Sorry, but it's GNU/LINUX. Linus Torvalds made only the Kernel. If you refer to the GNU project you are rigth, you should call it GNU/linux or GNU + Linux, Linux is the Kernel, the rest of the os is GNU. It's like to call your android phone Linux (it uses Linux kernel). SO please give credit to the GNU project.",
    "I’m glad someone remembered the YouTube accounts password",
    "Please, come back with the live flights on Youtube too. Thank you.",
    "5.6K",
    "The best re-entry footage ever recorded by humans... incredible stuff!",
    "Seeing those incredibly powerful sound waves at 0:41 ripple the air is insane.",
    "Our generation finally has an Apollo to be inspired by! Go SpaceX!",
    "3.4K",
    "I still can’t fathom how beautiful they make their shots look of the starship. It looks unreal.",
    "Getting to see the reentry plasma like that was incredible. To my knowledge this is the first time footage like this was actually captured.",
    "That plasma blanket was amazing to see live-streamed. Absolutely stunning.",
    "PLEASE resume the youtube livestreams for 4th flight onwards!",
    "One of the coolest videos on Youtube to date... Also, whomever edited this needs a bonus, the comms on the break and the drop after \"Vehicle is supersonic\" at 1:05 - perfection!",
    "I waited 30 years for this. Best of success for the next launch. You're all, SpaceX collectively, are fulfilling the dreams of generations. Thank you.",
    "That drone shot from above never gets old",
    "Imagine when we first hear: \"The Starship has landed on Mars",
    "Well Done Sapce X. Can't wait for Flight 4!",
    "I remember seeing all the comments on instagram reels roasting spaceX just cause their early testing with SNL and starship etc. Its so amazing seeing these videos with such a massive improvement in no time at all. It really amazes me what this private company is able to do. All these bright minds working on such an incredible project. Its really inspiring. Makes me want to study mechatronics or something and work with something related to space :). Awesome",
    "Starship rising through the layer of clouds and the booster dropping back down to earth was a beautiful moment. But nothing comes close to the re-entry footage. Watching that live, I still remember how speechless that moment left me. Truly one for the history books! Can't wait for IFT-4",
    "This flight has generated some of the best spaceflight footage ever! It was incredible to watch it live on stream. I'm looking forward to the next one!",
    "oh good god the shock diamond at 0:35... beautiful",
    "Props to whomever made this! You made an epic launch even more epic!",
    "I miss SpaceX on YouTube . Welcome back",
    "In my personal opinion, one of the greatest flights from SpaceX to date! The plasma bit specifically. Unbelievable shots. Watching it live while at work, it will forever be burned into my memory.",
    "1.4K",
    "Amazing footage.",
    "Still can't believe we got to see that re-entry live.",
    "What a time to be a live. This edit and the footage, with the slow mo of the rockets from the first stage, to the firey cloud it creates during lift. Mesmerizingly beautiful. Bravo SpaceX.",
    "Just rewatched for the millionth time because it’s so good. Just noticed that at 0:27 theres an apollo-esque shot of the engines closeup and its amazing",
    "That plasma cloud is wild!!",
    "We FINALLY have a video that is  as awesome as the old films of Saturn V launches! I’ve been waiting A LONG TIME for this.",
    "Eine Perfektion welche sich echt sehen lassen kann.",
    "Bald wird die Starship Reise los gehen.",
    "these are the most important events in human history.. crazy how its not talked about",
    "seeing the shockwaves generated by the Raptop engines during lift off was astounding. That plus the plasma during the reentry. Awesome job to Starlink for providing those feeds to us. Cant wait for Flight 4.",
    "Whoever did this edit, massive hats off to you. Done right.",
    "That's the most beautiful scene I've seen, hope someday I can see it at the local spot",
    "Nice work SpaceX, keep it up!",
    "and you guys should keep streaming live flights on YouTube again, I missed like almost all of them since you stopped doing it.",
    "The plasma shots are spectacular!",
    "Incredible footage. The future of space flight is once again bright!",
    "Also, PLEASE STREAM AGAIN ON YOUTUBE.",
    "That was awesome to watch and the music for this video was a great compliment to that.",
    "One of the most amazing videos in history. Congratulations SpaceX team, this is a jaw dropping accomplishment.",
    "So freakin amazing!",
    "The editing and music on the hot staging sequence..... chef's kiss",
    "yeah this compilation video gave me chills, so excited for the future thanks to SpaceX",
    "This is fantastic footage!! Very well done!!!",
    "The song is Reload by Nyime for anyone wondering. They used an instrumental version here without the vocals, if anybody knows where this version can be found let me know!",
    "Well done to the SpaceX's video editing team. Those are some amazing shots compiled in this video. The Starship project is great, but this video itself deserves a lot of credit!",
    "Good editing and amazing team ! Respect !",
    "Wow! Thank you for putting this up on YouTube. This needs to reach the widest possible audience and the YT algorithm has its uses.",
    "Everything about this is so gorgeous.",
    "0:38 whoever planned this shot is a genius!",
    "Those shots of earth are absolutely stunning in hd, the glow is awesome to see",
    "Man...the shockwaves coming from the engines are just incredible. That immense amount of power is almost unbelievable to behold.",
    "This is insane! Props to all the hard-working engineers who have brought it this far.",
    "First of all, this edit is absolute fire! Second, stuff like this is the reason why I get out of bed in the morning. Just the fact that something like this is possible inspires me deeply. Respect to the team.",
    "probably the most visually stunning video of a rocket launch i have ever seen, the mood and the visual representation of brute force seeing the shock waves radiating away during launch..,awesome",
    "Some interesting heat shield related ideas that may have already been commented:",
    "> Perhaps wrapping the Starship heat tile areas with a heavy-duty type automotive wrap film to hold the tiles in place until re-entry burns it off. Could also enable multi-colours, chrome, or advertisement logos.",
    "> Perhaps the commonly suggested placement of flaps leeward of the heat shield would not only reduce the number of tile shapes required, but could also aid in the Starship's forward and aft sections to more closely match the profile of a Dragon capsule (blunt end tapered to narrow) for aerodynamic stability.",
    "> Perhaps an external, track mounted robo-arm to inspect for and replace missing tiles, and also aid in attaching Starships together for fuel transfers.",
    "> Perhaps a semicircular shaped nosecone with an \"eyelid type\" half that rotates within the slightly larger diameter heat shield covered “half” would also enable less tile shapes as the entire shield surface would essentially be one consistent radius (if flaps located as mentioned above), and would also allow for a large cargo door.",
    "This semicircular nose cone might also be removable at Stage Zero to allow for various cylinder shaped third party cargo configurations to be inserted (like a battery into a flashlight handle) within a standardized Starship. Eg. A space station segment could be inserted to convert a Starship into a human-carrying spaceship or refuelling tanks could be inserted to convert it into a tanker, etc.",
    "Looking forward to the fourth launch!",
    "This is one of the most beautiful YouTube videos I've ever seen. This is only the beginning, the future where mankind will return to the stars, to not only visit, but stay.",
    "I've been watching Starship for all of my teenage years, I have the 24/7 live stream of starbase on my TV every hour of the day. These videos are amazing and VERY motivating, I'm soon to be an adult and I can't wait to tell my grandkids about the early days of starship development like many old folk talk about the Apollo program these days. :)",
    "Can´t wait for number 4. Fantastic!",
    "I love the thought, that I'll be watching live, when Starship lands first time on Mars. This is going to be a delightful day for all of humankind.",
    "Congratulations SpaceX on the third test flight, keep up the good work ♡",
    "Yes, I've been waiting for the recap since it launched!",
    "Man the videos space x keeps putting out with the flights continue to make it all even more enjoyable. One can really take in and appreciate even more, all the hard work and engineering at work.",
    "They did it !!! Thank you",
    "Absolutely one of the greatest Big Rocket / Spacecraft videos on YouTube. Now we wait for every other rocket scientist YouTuber here to rip it off.",
    "the editor got me in my feels with this one",
    "I can't wait to see you guys land that thing!",
    "I love seeing all the of team light up after the test, so much work is put into making these flights possible. Thanks to everyone working on these projects, you give us hope.",
    "Crazy to see how far humanity has gone",
    "Let’s goooo SpaceX!!",
    "Awesome work!!",
    "Almost there! Can't wait for flight 4!",
    "I love the end when it says next up and the show the runner up warming up",
    "Thank you for the amazing cut, talented team of SpaceX video editors.",
    "Well done.",
    "Now this is the 21st century I’ve been waiting for! Way to go SpaceX",
    "the thrusters shooting through the atmosphere like some future tech from out of a sci fi movie, so cool",
    "0:18 - Starship drops the bass. \"Vehicle is Supersonic\" THUNDERBIRDS ARE GO!!!!!!!!!",
    "Welcome back to YouTube!",
    "Thank you for inspiring a new generation, and thanks for showing all the people out there that nothing is impossible!",
    "Kudos to all who made this possible!",
    "Looking forward to the next text flight!",
    "Awe inspiring. The shots really framed the spectacular difficulty. Hats off to all.",
    "What a time to be alive! Thank you for doing something that brings genuine amazement and excitement in a world where everything seems so dark at times.",
    "love the back ground music",
    "That's some incredible footage. So very inspiring",
    "Imagine when all stages land, that video will be spectale to watch",
    "I ABSOLUTELY LOVE THESE VIDEOS!!!! - SOUNDTRACKS ALWAYS",
    "Pretty sick SpaceX! Makes me remember my childhood in Cocoa Beach. Seeing the Space Shuttle launch... Hearing the launch... Night launches! Bravo!",
    "Your video editors are awesome!",
    "This is the most incredible thing I have ever seen!!! This is so inspiring.",
    "1:37 is a perfect shot to show flat earthers, and they can't use the \"fisheye lens\" excuse as it literally goes upside down yet maintains the curve",
    "Just incredible in every way! Love the editing!",
    "onto the fourth!!",
    "Inspiring. Incredible. Let's go flight 4 good luck!",
    "the fact that gopro is still recording even when covered with 1000 deegres plasma is best ad i've ever seen",
    "Those flexible maneuverable fins make me smile. Most people won't fully appreciate the engineering genius of those fins.  Well done!",
    "That re-entry is some of the coolest space footage I've ever seen.",
    "Just amazing, keeps getting better every time.",
    "Sick seeing the shockwaves from those 33 raptors in the slomo shots",
    "The mach diamonds in the exhaust of the booster's 33 engines making it look like one big engine is truly something to behold.",
    "My word. This is beautiful",
    "Inspirational! From Star hopper to the biggest rocket ever made, truly magical!",
    "Humanity is slowly getting even more of an incredible species by the day. What a time to be alive...",
    "This are so super cool clips - and the editing with the techno sounds are just awsome",
    "Absolutely incredible!",
    "Absolutely stunning footage...just stunning!",
    "Keep up the great work, Team SpaceX!",
    "Awesome how the drones recording it don't even shake or shudder with all the sound waves and vibration",
    "Man that shot at 0:41 is probably one of the coolest things I’ve seen on YouTube. Kuddos!",
    "Way to make a cinamatic launch video. It's beautifully done. We'll edited.",
    "Finally! I've been refreshing every hour every day for this video to show up on my feed!",
    "man i always get emotional on those milestones, thank you space x <3",
    "Finally a well film well edited short version of the flight",
    "Thank you , finally some 4K SPACE FOOTAGE!!! yes! more please~!",
    "Pls come back to youtube. I don't have X/twitter. I loved the starship flight.",
    "amazing team! congrats! waiting x the 4!",
    "Congrats to the entire SpaceX Team! Your achievements are truly inspiring. Hard to imagine both your Starship development & Falcon 9 launch cadence. You are techno beasts!",
    "The Falcon Heavy test flight video won an Emmy. And it had heavy emphasis on crowd reaction.",
    "Perhaps there is another award waiting on a restreamer supercut on seeing the plasma.",
    "Well done SpaceX! I've been following the Starship project since the Starhopper tests and am so proud of the progress yall have made! Thank you for the work you've done for humanity!",
    "the euphoric feeling @ 1:35 gives me goosebumps.",
    "The first ever live-streamed re-entry burn! Savage!",
    "1:05 I'm a bit curious about the visual phenomenon that caused the streak extending from lower left towards the upper center part of the screen. Great video and amazing test flight! Congrats to everyone at SpaceX!",
    "Now bring the live launches back to YT.",
    "This will be a great video to show people who have No Idea what amazing stuff you guys are doing!",
    "This is the most beautiful looking video I've seen of a take off",
    "Crazy how much work can be done in a company when the owner is an alien who wants to go back home.",
    "LETS GOOOOO",
    "great video, simply amazing.",
    "This is so amazing and inspiring!",
    "The music is extremly beautiful",
    "I SpaceX",
    "Spirit video! Thanks!",
    "man thats the most amazing video i have watched in quite a while",
    "Hell yeah",
    "These are our cathedrals",
    "Thank you, SpaceX, for all you do. And for showing us as much as you show us. Thank you.",
    "I understand why you want to do live launch streams on X, but can you at least repost the stream to YT after a few days?",
    "Ok, so apparently:",
    "- SpaceX places only one external camera in each vehicle nowadays (it used to have more in SN8-15)",
    "- They don't have planes filming, and no tracking stations following the re-entry of the booster (even though, after B10 failed, we did see a glimpse of a tracking camera trying, it seemed, to find the booster, or it was looking away from the crash, not wanting to show the destruction)",
    "The video is cool and all that, but nothing different from what we already saw. Please return showing us more angles, we won't make a duplicate of Starship in our backyards, and don't be afraid to show it being destroyed, our public image of Starship won't be hurt by that amount of transparency",
    "Love the slo-mo to illuminate the shockwaves created by the exhaust, basically sonic booms as fast as a machine gun. Video gave me chills, its awesome!",
    "Congratulations to the whole SpaceX Team!",
    "Flight 4 live on youtube please.",
    "I love the music! Very well done. What's the name of the song, I need it...? best regards from germany:-D",
    "yeah, good video, atmospheric, sinematic, quite inspiring",
    "Good editing",
    "Just in case 1:50 this IS IN REAL TIME.",
    "Comment for the algorithm",
    "THANK YOU FOR THE BEAUTIFUL VIEW",
    "What an inspiration.",
    "1:12 is weird - why does it look like all engines are still running? All but 3 were shut down for stage separation",
    "1:21 i wonder is that piece of engine cover caused the booster to spin uncontrollably",
    "100% give a raise to whoever made the cameras on this vehicle. They are the world's eye into the amazing work SpaceX is doing, and this success wouldn't be nearly as impressive without it.",
    "Go SpaceX, always cheering for you and thank you for superb work!",
    "2:12 Next Up: SpaceX Starship Fourth Orbital Test Flight in June 2024!!!!!!!!!!!!!!! Starship 29 and Super Heavy Booster 11!!!!!!!!!!!!!!!!!!!",
    "dude 0:58 literally looks like a render",
    "Congrats to SpaceX team again for beautiful moments in IF3! We look forward for IF4!!",
    "The shot at 0:44 is literally MAGIC. I got chills.",
    "Go IFT-4!!",
    "HOPE spacex get to mars before i outlive my time on this planet.. watching For all mankind on apple tv, and they just landed on mars in this tvshow...  .. hope same happens real life soon.. consider i was born early 1970ish i do not have that much time left i guess... about to around 2044-2050 if i am lucky:) ... hope we landed before then :)",
    "thats the coolest thing ive seen on my life time. i wish i could fly to america and watch space x take off and landing befor i die",
    "And here I thought I was getting a boring video about an otherwise fantastic achievement. This was very entertaining.",
    "Imagine the rare chance that someone like Musk makes billions to advance mankind that way. It requires a very special type of personality to do that. Almost no one would.",
    "I am a blind   Spaceflight enthusiast",
    "if anybody knows of an audio feed of these launches with good descriptions etc could you please  let me know very frustrating to hear how exciting it all looks and all I got was a somewhat sparse commentary and of course later recounts but still not attuned to a blind \"viewer \"",
    "Thanks 2:22",
    "No lie... that gave me goosebumps.",
    "Absolutely awesome and amazing. Their pace of progress is beyond anything that any other company or country can match now or ever!",
    "People who waiting of the 4th flight of starship",
    "\"Sweet baby inc.\" Is such a creepy name for a company",
    "1.9K",
    "It's funny that they called the curator a \"harassment group\" and the first action they thought of is to harass the curator.",
    "2.3K",
    "You should see the way the company was founded and how the founders talk at investor meetings like GDC on YouTube. These people are cancer to the gaming industry",
    "asking sweet baby inc to consult on your game is like asking homer simpson to design a car. in the end, nothing good will come of it.",
    "Sees a group identifying them.",
    "Claims it is harassment.",
    "Identifies specific individuals.",
    "Asks for a campaign to ruin their life for simply identifying the company.",
    "Then complains about backlash.",
    "Hides and claims victimhood of the 'crime' they just attempted to perpetrate.",
    "These people are unbelievably corrupt individuals",
    "2.1K",
    "This is a throwback to the time TotalBiscuit created a steam curator page for games that were locked to 30 FPS, and some voices in the games industry screamed bloody murder.",
    "Others like Sweet Baby Inc are Silverstring Media, Mendez Consumption LLC, Quinn Titus, Gaymer X, Balance Patch, BAME In Games, Chucklefish, Fearless Futures, Hustle Crew, Raise the Game, Pearn Kandola Level Up Link Up, Diversio, Games for Change, PA Consulting, Wayne Sutton, GLAAD, UKIEPEDIA, Take This, Friction Consulting, Neilsen but the list goes on.",
    "Letting this “Sweet Baby” esg/dei consulting firm put their hands on your products is like a bakery paying a middleman to put diarrhea on their cakes",
    "It's not harassment to know what's in a product before you purchase it.",
    "If you’re doing something good, why do you hate having the light shined on you? These people are evil",
    "I can't believe the public is just finding about this now. Think of all the games the could've been saved from this woke monstrosity.",
    "Would like to thank Sweet Baby Inc for helping me and many other learn today that Blackrock controls all creative expression and freedom and that im not allowed to enjoy things unless they feel like a current day marvel movie.",
    "I'll never buy a AAA title ever again. Thanks.",
    "Kudos to Sweet Baby Inc. for being out of the radar for such a long time, thank God that after the Suicide Squad shitshow they won't be getting that much work now.",
    "A company with that name on top of those beliefs gives me the creeps",
    "ESG is the true root of this problem. Until that fund is down to the negative, stuff like Sweet Baby will continue to be a thing.",
    "The smart move would have been to say ''Hey ''Sweet Baby Group Detected'' is compiling all our game so if you want to look out for game that shares our company's value look them up''. Asmond's right saying that if they believe in their ideology they would probably address it less so defensively",
    "Two studios Sweetbaby worked with have been shut down. A third one is laying off people. Facts.",
    "You're right, Sweet Baby isnt the root of problems. But it gives us a name to communicate a potent phenomonen. Now we can say \"this company is like Sweet Baby Inc.\", or \"this game got Sweet Baby'd\".",
    "This ability to rapidly communicate a criticism makes it memetic, which is vital to naturally changing the culture to fight back against this and make video games about gaming again.",
    "1.5K",
    "Pattern recognition ≠ Making up a Boogeyman",
    "If your company was noble and trustworthy, this type of curation would be a blessing.",
    "The fact that Sweet Baby themselves wants it removed tells you everything you need to know about their intentions.",
    "Interesting that this group doesn’t want people to know which games they were apart of. I wonder why they would be worried about something like that.",
    "The Hogwart’s legacy streamer tracker was A-OK, but the sweet baby inc tracker is unacceptable. I’m glad these people have such consistent morals.",
    "He's right that sweet baby is not the general, just one of the pawns. But sometimes you have to get through the pawns to get to the general.",
    "\"Sweet baby inc.\" Lol. I would never take consultation from a company that named themselves sweet baby. They should have hired a consultant to suggest better names for a company that has nothing to do with baby products.",
    "The thing is Sweet Baby inc isn't the only company that does this. They're just the one that got caught doing it. There are literally dozens of 'consulting' companies just like them all over the world with their fingerprints all over different video games.",
    "If they went out of business tomorrow, nothing would change because there would be someone just like them lined up to take their place. That's what's really demoralizing about this whole progressive movement. It just seems no matter what we do gaming studios and companies just refuse to listen to the customer.",
    "Can’t stand this company",
    "1.2K",
    "I like how this one company has affected our entire forms of entertainment, and we’re still over here going “maybe it’s just a conspiracy theory that all these people want the same thing for everyone who doesn’t follow a prescribed narrative”",
    "The curator is down to 15 games, so Steam is removing their reviews for whatever reason. There aren't lies or anything against TOS, and yet Steam is bending the knee to these freaks.",
    "Funny he mentioned the WEF when they openly said to \"force behavior\" in form of ESG and DEI. They might not be the Illies' but sure they decide stuff we did not vote for.",
    "Anything affiliated with Sweet Baby Inc. Redults in the death of a company",
    "You are right that this is just a symptom of a larger problem. And while it is important to go after the source of the problem, symptoms should still be treated as they appear.",
    "Red flags to look out for in any industry:",
    "ESG",
    "DEI",
    "BRIDGE",
    "WEF and SBI might be easy targets, but they are the correct targets. Just not the only ones at fault. Those they work with are also in part to blame. It is just a sign if you work with them there is something wrong with you.",
    "It's not just that we're tired of being told what to do and what to think but also we're tired of being told that we should feel guilty.",
    "it kinda remind me a little of HOAs where they claimed and still do that an HOA was gonna increase the value of their property but now everyone who is aware of them avoid like a plague buying or renting places with HOA in their neightborhood",
    "No one wonders why they're not absolutely HONORED that someone would let the world know all the games they've \"worked\" on?",
    "Their pedo style branding doesn’t sit well with me.",
    "water???????????????????? is he ok?",
    "A list of every company that participates in this form of consulting needs to be published immediately... so everyone can know what not to buy. Put them all out of business.",
    "it's literally like when Michael Scott says he was a victim of a hate crime, and they say \"Michael....that's not a hate crime.\" and he says \"WELL I HATED IT!!!\"",
    "I’ve been saying it all along. Blue hair devs have ruined gaming",
    "Asking company like Sweet Baby Inc. to \"consult\" is like asking somebody to take a dump on a brand new car in your car dealership. And then paying them a large sum of money for this \"service\".",
    "Sweet baby inc- attacks gamers",
    "Gamers defend themselves",
    "Sweet baby inc- help we are being bullied",
    "Seeing how Remedy went to consult Sweet Baby for Alan Wake 2, makes me fear the remakes of Max Payne 1 and 2 they're working on.",
    "They're hired to make games ESG compliant. It's all about that DEI money. They aren't the only one's of course, but as others have said, it gives a face to a major problem in the gaming industry.",
    "Sweet Baby Inc. name sounds like a company the FBI should investigate...",
    "I played God of War 2018(one of my top 5 of all time) then played Ragnarok. It doesn't feel like it's the same studio. Then months later I find out this company got credit for the story in the game. Then I see the same thing done to Spiderman 2, then Horizon, Suicide Squad and it goes on and on and on. I honestly can't believe it's a coincidence",
    "Weird, as of 12 hours after this video was posted the follower number is doubled, but the list has shurnk by 5 games.",
    "Sweet baby is how you know a game is going to be shit.",
    "Cancer baby more like.",
    "Yeah man, it's companies go through checklists rather than making good games. They've got to hire a firm to make the checklists",
    "I cant imagine not wanting people to know that you worked on a game...",
    "The only reason you wouldnt is if you know that you are in the wrong",
    "Itsagundam made a video and in it pointed out that just after gamergate male suicide went up, he said it mostly as a joke, but I can certainly say that learning about this shit and the localiser shit has made my depression worse.",
    "People fucking with my hobbies to push their world views is pissing me off.",
    "Theres dialogue in starfield that comes from a female npc to a male npc and she said quote:",
    "“ I don’t care to listen to your toxic masculinity. “",
    "I instantly uninstalled. As anyone should.",
    "Glad hes been addressing these issues in games. ive been talking about this on tiktok and youtube for over 2 years now and been caled every \"ist\" \"ism\" and \"phobe\" under the sun. Thank god more people woke up.",
    "\"They wield power not as a shield to protect the downtrodden, but as a sword to hurt and attack the people they think have wronged them.\"",
    "Well said",
    "\"The WEF isn't actually what they think.\"",
    "No, they actually are, buddy.",
    "The people involved with this company are exactly what you'd expect, narcissists who think they're morally better then you and will act like you're the problem if you disagree with their ideas.",
    "They even tried to get former creator of Twisted Metal and freaking God Of War David Jaffe to try to defend them which not only shows how much pull this company has but also how desperate, cowardly, and insecure they truly are.",
    "Not buying anything to do with sweet baby",
    "\"They're not the only company doing this\"",
    "Looks at list of titles they've destroyed........",
    "So? They're certainly the most prevalent",
    "That's funny. I saw every game on that list outing them as having \"consulted\" on it, and it absolutely did not surprise me. It all made sense.",
    "Anyone remember Silverstring Media? Same people.",
    "We need every company like SBI to go under",
    "I want nothing to do with a company like this, or companies who employ them.",
    "That swirl on their baby logo sure is interesting, huh?",
    "Lol the group is already at roughly 30K now and rising. SBI is not just a symptom, they are an active contributor to progressing the disease so they absolutely deserve the backlash and it being a big deal is good. Now we need to expand this to all the other firms that offer similar services and ruin their reputations until they collapse.",
    "Consumers have the right to know what companies worked on a project and decide of they want to buy it.",
    "We want games without real world narratives/problems/issues clogging it down. This is a reason that Helldivers 2, Dark souls games, etc are so good. We fully immerse ourselves into THAT universe and we forget about RL issues. Gaming companies need to get back to this.",
    "Literally zero people believe they are the only ones behind this shit.",
    "Gamers take their wins when they can.",
    "Bro the firm's name is so damn creepy.  Why is their logo a weird baby logo?",
    "Its not just a warning label, they will direct story narratives in certain fashions. They state so on their website.",
    "Joining it, this makes it so easy to be sure I don't support any company using these woke clowns",
    "Dam, Sweet Baby Inc is such a nice company, doing shoutouts for Steam groups.",
    "WEF representatives have stated exactly what you think is hyperbole but even further.",
    "This group is just a symptom of that.",
    "Isn't the same list available on their own webpage? Btw, even though these people should be removed from society, remember that someone hired them.",
    "Nice.. have an ESG score label attached to each game!.",
    "If they were proud of their work and thought they were doing something good, they wouldn't react like this.",
    "Who else cries and tries to eliminate anyone for simply identifying them and what they've done? (The same people funding this agenda.)",
    "Just watch ItsaGundum last 2 videos cover on SBI and how their thought process goes you will know how bad are their intentions.",
    "They LITERALLY speak  on interviews how they DO \"FORCE\" their message into to people that dont agree with then by putting  ESG\\DEI into games.",
    "And guess what, they have people in their team that are straight related with Gamegate people, let THAT sink in ,its THE SAME PEOPLE under a new name doing the SAME scheme.",
    "Isn't a company supposed to be proud of and stand by their work? If it's so good. Then surely the \"modern audience\" they made it for will show up to offset the critics.",
    "Just ask Rotten Tomatoes. So many times we've seen the mainstream critics hate something, the audience loves it, and the movie does well.",
    "Hopefully sweet baby go out of business as a warning to the gaming pubs and devs",
    "“Tired of being told what to do” is a GREAT summarization of every non-radicalized person in the U.S",
    "My biggest regret in my entire 37-year gaming life is not having requested a refund of Starfield immediately after seeing the character creation. Since then I have sworn to myself never again to buy games with delusions like \"body type A or B\".",
    "Since Asmon talked about this group, they have more than doubled their size. Congrats Sweet Baby on another example of the Streisand effect.",
    "It's very clear now that the only form of money game devs care about these days is funding from BlackRock over profits that they make from their products. If that wasn't the case, there wouldn't have been mass layoffs.",
    "It's funny they would be mad at people making an avoid list while they would also probably dogpile on someone who got called out for not boycotting something that the hivemind demands.",
    "The people who founded this company have literally been doing this exact thing for years;  spouting controversial political statements then pretending to be a helpless dying animal caught in a trap to garner sympathy off the public so they can wave a flag of war at anyone who were to disagree by blanket labelling an entire demographic.",
    "If you ever wondered how gamers got the stigmata of all being racist, misogynistic frog posters, its because these people helped lump you in with them.",
    "\"You don't have the authority to tell a free market that they are wrong whenever they reject your agenda\"... lol, tell that to Marvel and Disney",
    "From what I'm seeing, they removed the curator reviews for Starfield, Forspoken and Saints Row. Why?",
    "The fact that they reacted so violently to a single steam list of games they’re involved in, just proves that they know they’re ruining games. If they thought their work was good, they’d either ignore it, or promote it as a way to find the games they’re involved in.",
    "Yeah I don't think Sweet Baby Inc is the one and only group like this, because as far as I'm aware they only spread their propaganda in videogames, when it's also being spread in comic books, television shows, and movies too. They're the first example of a name being associated with what everyone's been seeing for a long time, and what many, mostly on twitter have been trying to gaslight and say isn't happening. I don't have the list off the top of my head, but it goes something like \"That never happened, ok it did happen but it's not a big deal, ok it is happening and that's a good thing\"",
    "We were at the first, now we're between the second and third.",
    "\"Its not enough for these people to have their own perspectives, but if you say I don't want to hear it you're breaking the rules\"",
    "Paraphrasing, but well said, and spot on. Fundamentally its cry bullying.",
    "5 days later - the curator is past 200k followers.",
    "That intro statement, we're not saying they are the sole cause. But they are definitely a strong driving force for multiple games flopping and 2 developers closing shop. So what because they aren't the esg themselves we shouldn't go after them before they ruin both games and peoples jobs and careers?",
    "What you dont understand is, they're not the only ones, but that gives them an out.",
    "Thats such an easy excuse to say \"but were not the only ones so dont hold us accountable.\"",
    "Its like saying domt go after a murdered because theyre not the first one. At some point shouldnt we start somewhere??",
    "Can all of the \"woke\" community just...fall back asleep for a few years. NO, I don't want you to \"be deleted\" I just think you've been awake for hours & need a nap.",
    "Sweet Baby Inc Detected just got themselves another follower, we're up to 217k lads!",
    "Ever heard of the story, \"The Emperor's New Clothes?\"  All this \"inclusivity\" seeping its way into video games and movies is similar.",
    "Two criminals approach the Emperor saying they can offer the most beautiful, magical clothes in the land, but only those who are good and pure can see it.  A box opens.  It has nothing in it.  Because it is a scam and there ARE no clothes.",
    "But Emperor wants the reputation of being good, and seeing the empty box, says, \"That is those are most beautiful clothe I have ever seen. \"",
    "Word gets out that the Emperor will be wearing magical clothing that only good people can see.",
    "Holding a festival to show off his beautiful new clothes, the Emperor parades through the crowd.",
    "All afternoon the townsfolk talk about how wonderful the Emperor looks in his new clothes for they do not want to be seen as wicked.",
    "It is not until a little girl looks at the Emperor and says, \"he doesn't have any clothes on\"  when people start to realize it was all a lie.",
    "People and companies who see \"inclusivity\" as the best thing in the world are branded as wicked people;  Racists, and bigots.  The problem is, when you choose inclusivity above all else.",
    "Choosing it over objective reality, competency, quality.",
    "Results in a loss of focus.",
    "We all of a sudden have to spend resources ticking off boxes that don't matter.",
    "\"I like to look these things up myself rather than have somebody tell me\"",
    "Asmon... That is LITERALLY what having somebody tell you is 95% of the time. Where do you think the source of your information comes from half the time? Unless you do your own journalism, you're always going to regurgitate what other people are saying online. This is Hasan levels of journalism, let's not elevate it higher than it is.",
    "I’m glad we are clapping back on all this soft modern garbage. I thought it would never change or get worse over time.",
    "Brass Lion Entertainment is another one of these companies to avoid their titles.",
    "For those in the not Know: The Steam Curator in question is a women from Brazil.",
    "So Sweet Baby, who claims to fight for the rights of women, did a hate campaign agaisnt a Latina women of color. Let that sink",
    "BlackRock and Vanguard are the root cause, who invented and push ESG.",
    "Crazy how every game i saw they worked on was panned for having cringey dialogue. what a coincidence",
    "This explains why writing in AAA games have gotten lamer. Because of their ideologies and wanting to push their agendas to these games. Those are the people behind it.",
    "Ahhh, so that's why Starfield forces you to choose a pronoun on character creation. Why is someone else's mental illness being forced on me and the games im trying to enjoy..",
    "When will gamers push back against this trash?",
    "I think it's disgusting company's practically get to hide groups they hire to make games. I felt this way when they started coming out after fans for not liking their garbage. Glad someone will track it now. Sure, their companies games might have decent rating, but I don't trust those anymore. Let's look at those player numbers =).",
    "\"oh no ive been found out\"",
    "TOTALLY NAILED IT!  For the last 30+ years we have been had one form of tyrant after another slowly chipping away at our basic rights of being a human.  People are tired of being told what to do by a bunch of ignorant fools who get off on power trips.",
    "almost 200k followers now",
    "Aren't they proud of they work?  Shouldn't they want to be recognized?",
    "Should change the name to sweet baby stink",
    "11 days later...",
    "Sweet Baby Inc detected......273,000 followers",
    "LOL!",
    "Insane how all the games they tainted actually had terrible reviews before they got exposed",
    "Bad example in the beginning. The wef is damn near literally the Illuminaughty",
    "Here is my Problem. Pretty sure you all know the Game Alan Wake 2 right? Well the very first thing it shows is Anderson taking over the Case of Casey, but only the two of them know this at this point.",
    "When Mulligen points that out that he is informed that Casey takes the Case and is expecting him, he dosent know about Anderson and got no info on her.",
    "So why the hell is he apologizing when he meets them? Shouldnt the very first thing be contacting his Superior and asking if he is fine with it, because Mulligen dosent have the power to say if its ok or not.",
    "It was so offputting for me i stopped to watch the Game alltogehter (watched a Streamer to know if i want the Game). If this was Sweet Baby Inc. work/influence here, it stopped me from buying it and killed my Intrest in it.",
    "gta6 2k is consulting SBI aswell",
    "Star Wars Prequels were the best Star wars Movies.",
    "I hope that those massive layoffs were mostly targeting woke agenda people.",
    "Don't give power to people who think they know better than you and have the right to tell you how you have to live your life. Pull rights back to the people and away from these nonsense organizations/government groups.",
    "\"Beliefs are neat. Cherish them, but don't share them like they're the truth.\" - Bill Hicks",
    "Sweet baby logo is oddly unsettling.",
    "If people want an example of the Streisand Effect..",
    "This is the purest form.",
    "their reviews seem to be getting removed from games, it's gone from 18 to 13 including the starfield review being deleted",
    "So liberal progressive propoganda in our games. How am I not surprised.",
    "The main problem is BlackRock and Vanguard ACTIVELY disrupting not just gaming but mass media in general.",
    "Sweet Baby will be the first head to roll in order for this nonsense to stop.",
    "The 4 stages of suppression:",
    "Criticize",
    "Marginalize",
    "Attack",
    "Censor",
    "F Sweet Baby Inc",
    "This is what happens when the people speak up and say what needs to be said. Disney found out. Now it’s time the gaming industry found out as well.",
    "The issue here is the whole concept of the \"stakeholder\". Anyone that can comment on anything or point anything out about you, has stakes in what you do, and can affect your bottom line. Therefor, it is seen as a \"violence\" against you (that they can then censor or call for censorship for). That's how these people see the world and want to redefine it. You mentioned the World Economic Forum, earlier in the video. That's exactly hook, line and sinker, what the leadership at the WEF defended a few years ago (the whole \"Stakeholder economy\" concept). Basically, they gaslight the average person into thinking the concept of \"stakeholder\" is the future, while in fact, it's merely a way to gaslight the average person into silencing those who do not have views that help their bottom line as a company/board of investors/privileged person/etc. It helps if you picture these companies as narcissists who like to appear as if they're saviors or good people - then their behavior and words become obvious. They merely do it to show off for votes and profits.",
    "Don't get me wrong, I'm terminally leftist in terms of ideology. I consider myself \"woke\" unironically and do not subscribe to the conservative views of far and alt right Trump lovers. I'm all for inclusivity and populist movements that defend the average person and minority groups (and not the other kind of populist movement, which is highly conservative and racist). I'm a social democrat. But I don't like these corporate hypocrites who try to pass themselves off as \"progressives\" when they are anything but. They'll drop any semblance of inclusivity once it doesn't serve them any longer (IE they've won elections or have made as much money as they could from a specific minority group and it's not making them any more profit, or they're losing money on it). These kinds of people make us, actual progressives, look bad. Sometimes I paranoidly wonder if it's not on purpose (ok, buddy, calm down, not everything is a psyop).",
    "EDIT: Worst of it all, is I don't even have an issue with what SBI is doing (consulting work designed to help make games more inclusive). I genuinely own copies of all those games they've worked on, some of which I think are amazing games (that they've, I assume, have done amazing work on - though it's hard to pinpoint sometimes, given the nature of their work). I have an issue with how the people working for them (ok, in this case, one bad actor) are treating their work and ideology as gospel, with the right to retaliate towards any criticism and censor it, and will jump to lying and creating malinformation, disinformation and misinformation, to get people to side with them. That's incredibly narcissistic and frustrating. The only defense they should and could have, is that some people on the Steam forum, are bad faith actors, trolls and just plain terrible people. But that's the case anywhere and everywhere. That's like asking you, Asmongold, to have your videos banned because you have someone in the comment section being racist, or you have a roommate who is misogynistic and homophobic (but not directly in your videos). As if you were responsible for them. That's where the whole concept of \"stakeholder responsibility\" comes from - you should be held liable for the actions of others that you could have changed. And I think that idea is bonkers. Would you ask a civilian or cashier at a store to fight back a thief that held them at gunpoint? Would you hold them liable for that, or for a customer that walked in and spewed hate towards a person of color? Rhetorical question, of course. No, you wouldn't. Because that would be utterly insane. So while I don't hold SBI responsible for the action of this one crazed individual, I wouldn't hold responsible the few trolls in that Steam group responsible for the actions of a few others. And to call the whole group a dog whistle for racists, without any evidence (and even evidence to the contrary), is beyond absurd. That's not how burden of proof works, anyway. This whole thing has evolved into a ridiculous drama that isn't worth focusing on any more. The best way to deal with narcissistic gaslighters who try to abuse their powers, is to call them out on it and then proceed to ignore them and not give them any more attention, and that completely reduces their power.",
    "Megan Fox ad made me refund Mortal Kombat 1, that lady is pure evil",
    "Make DEI consiltant companies afraid to exist we must.",
    "Steam group has over 80000 people now and still going up it seems so at this point thankfully the group is to big to stop now and I saw a post in the group saying SBI deleted all their posts on X about it lmao",
    "Go woke go broke. People aren’t buying the identity politics bullshit.",
    "Pink triangle was to label the homosexuals not the jews, the jews had a yellow david star",
    "0:09 wtf is that WATER???",
    "It's a People that Wear small hats that are behind it all.",
    "If i had a tool to sift out bullshit from products, I'd totally use it",
    "Guessing the streisand effect will do its thing here",
    "This company has their hands all over Insomniacs Wolverine. Hard pass on that one.",
    "Art is NOT decided by the artist. Art is in the eye of the beholder. If someone tells you trash is art, that doesn't make trash into art.",
    "A consulting company, is mad that people can know what games they worked on? WHY? Shouldn’t they be proud of their work?",
    "According to Sweet Baby Inc's website they worked on God Of War: Ragnarok",
    "\" this will give you cancer\" thats the exact label i want for  games with sbi involvement.",
    "13:06 That's a statement of someone questioning if the company has legal standing to sue him. They likely threatened litigation.",
    "I'm in firm belief the sudden collusion with \"Bodytype A/B\" all at once in multiple games has something to do with one of these firms. This dehumanizing bullshit needs to stop.",
    "A \"narrative consulting firm\" that frequently gives sequels worse narratives than their predecessors",
    "they should have called it \"Sweet Baby Inc. Detected, Inc.\" i got 15 minutes into the video before i realized these are two separate groups they're talking about and now i have to start it over because i've misunderstood everything.",
    "maybe i'm stupid for that, but it's 6 in the morning on a saturday and i've already been up for 4 hours",
    "Starfield is shockingly mild - they needed to make it hard edged and adult . They failed big time and it’s the mistake that was the most obvious - you could call it from day one , ruins their new release to add to the other problems.",
    "Love how You guys don't mention GOW Ragnarok or spiderman or Alan wake 2",
    "It’s good to finally know the name of the reason you don’t get to play as ratchet and clank in a rachet and clank game",
    "As a fireman il say.. damned right I'm brave",
    "Letting Sweet Baby Inc. work on your game is akin to letting child predators babysit your children.",
    "And of course they went on protected mode after getting backlash. Is anyone surprised?",
    "If SBI was PROUD of their work and could prove they had a positive impact for those games, they would celebrate this curated list!",
    "They don't justify their behavior because they see themselves as \"enlightened\", superior and therefore above explaining or justifying to the plebs.",
    "isn't down bad = horny/attracted? or does it mean just worse/bad/desperate too? just confused on how asmon used it (im not a native english speaker)",
    "How do they forget the rules of the internet . The more you fight and try to hide anything , the more exposed you're going to be",
    "Boycotting games with sweet baby inc involvement is not only showing no one wants their woke service. It shows to companies we don't want anything to do with woke in video games.",
    "SEGA soon join the these consul group. such a mess",
    "Sweet Baby Inc detected from 20.000 to over 80.000 followers in a few days,a great sucess.",
    "It's worse than a warning label, they just take the nicotine out or they replace the cigarettes with candy. But yes I am sure they are not the only ones.",
    "\"HOW DARE YOU TRY TO AVOID MY VIDEO GAMES!\"",
    "We need a list of unfun, unfinished and woke games to ignore.",
    "That follower count doubled to 44,000 8 hours after this video was posted.",
    "Isn't it weird how censorship went from being a Conservative tool to a Liberal tool? That's why I'm more of a centrist than \"picking a side.\" I'm more anti-censorship than pro-censorship, which both sides seem to lean into in different ways."
]